pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23020FC6: Register word32 rijndael_decrypt(Register (ptr32 Eq_93961) a1, Register (ptr32 Eq_93962) a2, Stack word32 dwArg3C, Stack (ptr32 Eq_93964) dwArgE4, Stack word32 dwArg0148, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out (ptr32 byte) s9Out, Register out Eq_93972 s10Out)
// Called from:
//      BL_AesUnWrap
word32 rijndael_decrypt(struct Eq_93961 * a1, struct Eq_93962 * a2, word32 dwArg3C, struct Eq_93964 * dwArgE4, word32 dwArg0148, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, byte & s9Out, union Eq_93972 & s10Out)
{
	ui32 a3_82 = (word32) a1->b000E;
	struct Eq_96508 * a0_356 = ((Eq_363148[]) 20)[a3_82].ptr0000;
	ui32 a5_39 = (word32) a1->b0002;
	ui32 a5_57 = (word32) a1->b0006;
	ui32 a5_72 = (word32) a1->b000A;
	int32 a6_86 = a0_356->dw0004;
	word32 a0_44 = ((Eq_363149[]) 8)[a5_39].dw0000;
	uint32 a4_341 = (word32) a1->b0000 << 24 ^ (word32) a1->b0001 << 16 ^ (word32) a1->b0003 ^ a5_39 << 8 ^ a5_39 << 8;
	uint32 t3_364 = (word32) a1->b0004 << 24 ^ (word32) a1->b0005 << 16 ^ (word32) a1->b0007 ^ a5_57 << 8 ^ a5_57 << 8;
	uint32 a7_119 = (word32) a1->b0008 << 24 ^ (word32) a1->b0009 << 16 ^ (word32) a1->b000B ^ a5_72 << 8 ^ a5_72 << 8;
	uint32 a5_110 = (word32) a1->b000C << 24 ^ (word32) a1->b000D << 16 ^ (word32) a1->b000F ^ a3_82 << 8 ^ a3_82 << 8;
	int32 s7_136 = a6_86 >> 0x01;
	while (true)
	{
		struct Eq_97031 * a3_101 = g_a23079914[(t3_364 & 0x00FF) * 0x04];
		struct Eq_96971 * s0_105 = a3_101->ptr0010;
		uint32 a0_127 = a0_356 ^ a3_101 ^ a3_101 ^ (a5_110 >> 0x0E & 1020)->dw23079114 ^ (a7_119 >> 0x06 & 1020)->dw23079514;
		s7_136 += ~0x00;
		uint32 a1_152 = g_a23078D14[(t3_364 >> 0x18) * 0x04] ^ g_a23079914[(a7_119 & 0x00FF) * 0x04] ^ s0_105->dw0014 ^ (a4_341 >> 0x0E & 1020)->dw23079114 ^ (a5_110 >> 0x06 & 1020)->dw23079514;
		uint32 a3_188 = g_a23078D14[(a7_119 >> 0x18) * 0x04] ^ g_a23079914[(a5_110 & 0x00FF) * 0x04] ^ s0_105->dw0018 ^ (t3_364 >> 0x0E & 1020)->dw23079114 ^ (a4_341 >> 0x06 & 1020)->dw23079514;
		uint32 a5_190 = g_a23078D14[(a5_110 >> 24) * 0x04] ^ g_a23079914[(a4_341 & 0x00FF) * 0x04] ^ s0_105->dw001C ^ (a7_119 >> 0x0E & 1020)->dw23079114 ^ (t3_364 >> 0x06 & 1020)->dw23079514;
		int32 s10_203 = s0_105->dw0020;
		if (s7_136 == 0x00)
			break;
		a0_356 = g_a23079914[(a0_127 & 0x00FF) * 0x04];
		word32 a3_370 = g_a23079114[(a3_188 >> 16 & 0x00FF) * 0x04];
		a4_341 = g_a23078D14[(a0_127 >> 0x18) * 0x04] ^ g_a23079914[(a1_152 & 0x00FF) * 0x04] ^ s10_203 ^ g_a23079114[(a5_190 >> 0x10 & 0x00FF) * 0x04] ^ g_a23079514[(a3_188 >> 0x08 & 0x00FF) * 0x04];
		t3_364 = g_a23078D14[(a1_152 >> 0x18) * 0x04] ^ g_a23079914[(a3_188 & 0x00FF) * 0x04] ^ s0_105->dw0024 ^ g_a23079114[(a0_127 >> 0x10 & 0x00FF) * 0x04] ^ g_a23079514[(a5_190 >> 0x08 & 0x00FF) * 0x04];
		a7_119 = g_a23078D14[(a3_188 >> 0x18) * 0x04] ^ g_a23079914[(a5_190 & 0x00FF) * 0x04] ^ (a0_356->ptr000C)->dw0008 ^ g_a23079114[(a1_152 >> 0x10 & 0x00FF) * 0x04] ^ g_a23079514[(a0_127 >> 0x08 & 0x00FF) * 0x04];
		a5_110 = g_a23078D14[(a5_190 >> 24) * 0x04] ^ a0_356 ^ a0_356 ^ a3_370 ^ a3_370;
	}
	byte * s9_215 = (a0_127 >> 0x18) + 587701524;
	Eq_93972 s10_233 = (word32) *s9_215 << 24 ^ (word32) (a5_190 >> 0x10 & 0x00FF)->b23079D14 << 16 ^ (word32) (a1_152 & 0x00FF)->b23079D14 ^ (word32) (a3_188 >> 0x08 & 0x00FF)->b23079D14 << 8 ^ s10_203;
	a2->b0000 = (byte) (s10_233 >> 0x18);
	a2->b0001 = (byte) (s10_233 >> 0x10);
	a2->b0002 = (byte) (s10_233 >> 0x08);
	byte * s6_229 = (a1_152 >> 0x18) + 587701524;
	byte * s5_243 = (a3_188 & 0x00FF) + 587701524;
	ui32 a4_246 = (word32) *s6_229 << 24 ^ (word32) (a0_127 >> 0x10 & 0x00FF)->b23079D14 << 16;
	word32 a6_247 = (word32) *s5_243;
	a2->b0003 = (byte) s10_233;
	struct Eq_96738 * s8_218 = a0_44 + 8 + ((a6_86 >> 0x01) << 5);
	uint32 a4_259 = a4_246 ^ a6_247 ^ (word32) (a5_190 >> 0x08 & 0x00FF)->b23079D14 << 8 ^ s8_218->dw0004;
	a2->b0004 = (byte) (a4_259 >> 0x18);
	a2->b0005 = (byte) (a4_259 >> 0x10);
	a2->b0006 = (byte) (a4_259 >> 0x08);
	a2->b0007 = (byte) a4_259;
	byte * s3_257 = (a5_190 & 0x00FF) + 587701524;
	ui32 a5_275 = (word32) (a5_190 >> 24)->b23079D14;
	uint32 a4_284 = (word32) (a3_188 >> 0x18)->b23079D14 << 24 ^ (word32) (a1_152 >> 0x10 & 0x00FF)->b23079D14 << 16 ^ (word32) (*s3_257) ^ (word32) (a0_127 >> 0x08 & 0x00FF)->b23079D14 << 8 ^ s8_218->dw0008;
	a2->b0008 = (byte) (a4_284 >> 0x18);
	a2->b0009 = (byte) (a4_284 >> 0x10);
	a2->b000B = (byte) a4_284;
	ui32 a4_291 = (word32) (a3_188 >> 16 & 0x00FF)->b23079D14;
	a2->b000A = (byte) (a4_284 >> 0x08);
	uint32 a5_301 = a5_275 << 24 ^ a4_291 << 16 ^ (word32) (a0_127 & 0x00FF)->b23079D14 ^ (word32) (a1_152 >> 8 & 0x00FF)->b23079D14 << 8 ^ s8_218->dw000C;
	a2->b000C = (byte) (a5_301 >> 0x18);
	a2->b000D = (byte) (a5_301 >> 0x10);
	dwArgE4->b000E = (byte) (a5_301 >> 0x08);
	dwArgE4->b000F = (byte) a5_301;
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s2Out = 587697428;
	s3Out = s3_257;
	s4Out = dwArg98;
	s5Out = s5_243;
	s6Out = s6_229;
	s9Out = s9_215;
	s10Out = s10_233;
	return 587700500;
}

// 23021408: Register word32 rijndael_encrypt(Register (ptr32 Eq_93758) a1, Register (ptr32 Eq_93745) a2, Stack word32 dwArg3C, Stack (ptr32 Eq_93761) dwArgE4, Stack word32 dwArg0148, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out Eq_93767 s7Out, Register out ptr32 s8Out, Register out Eq_93769 s10Out)
// Called from:
//      BL_AesEncrypt
word32 rijndael_encrypt(struct Eq_93758 * a1, struct Eq_93745 * a2, word32 dwArg3C, struct Eq_93761 * dwArgE4, word32 dwArg0148, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, union Eq_93767 & s7Out, ptr32 & s8Out, union Eq_93769 & s10Out)
{
	ui32 a3_82 = (word32) a1->b000E;
	ui32 a5_39 = (word32) a1->b0002;
	ui32 a5_57 = (word32) a1->b0006;
	ui32 a5_72 = (word32) a1->b000A;
	int32 a6_86 = ((Eq_363172[]) 20)[a3_82].ptr0000->dw0004;
	word32 a0_44 = ((Eq_363173[]) 8)[a5_39].dw0000;
	uint32 a4_341 = (word32) a1->b0000 << 24 ^ (word32) a1->b0001 << 16 ^ (word32) a1->b0003 ^ a5_39 << 8 ^ a5_39 << 8;
	uint32 t3_110 = (word32) a1->b0004 << 24 ^ (word32) a1->b0005 << 16 ^ (word32) a1->b0007 ^ a5_57 << 8 ^ a5_57 << 8;
	uint32 a7_119 = (word32) a1->b0008 << 24 ^ (word32) a1->b0009 << 16 ^ (word32) a1->b000B ^ a5_72 << 8 ^ a5_72 << 8;
	uint32 a5_386 = (word32) a1->b000C << 24 ^ (word32) a1->b000D << 16 ^ (word32) a1->b000F ^ a3_82 << 8 ^ a3_82 << 8;
	Eq_93767 s7_150 = a6_86 >> 0x01;
	while (true)
	{
		struct Eq_97691 * a0_108 = *((char *) g_a2307AA14 + (a4_341 & 0x00FF) * 0x04);
		word32 a1_101 = *((char *) g_a2307AA14 + (a5_386 & 0x00FF) * 0x04);
		struct Eq_97631 * s0_135 = a0_108->ptr0014;
		uint32 a3_127 = g_a23079E14[(a4_341 >> 0x18) * 0x04] ^ a1_101 ^ a1_101 ^ (t3_110 >> 0x0E & 1020)->dw2307A214 ^ (a7_119 >> 0x06 & 1020)->dw2307A614;
		s7_150 = (word32) s7_150.u0 - 1;
		uint32 a1_152 = g_a23079E14[(t3_110 >> 0x18) * 0x04] ^ a0_108 ^ a0_108 ^ (a7_119 >> 0x0E & 1020)->dw2307A214 ^ (a5_386 >> 0x06 & 1020)->dw2307A614;
		uint32 a0_186 = g_a23079E14[(a7_119 >> 0x18) * 0x04] ^ *((char *) g_a2307AA14 + (t3_110 & 0x00FF) * 0x04) ^ s0_135->dw0018 ^ (a5_386 >> 0x0E & 1020)->dw2307A214 ^ (a4_341 >> 0x06 & 1020)->dw2307A614;
		uint32 a5_188 = g_a23079E14[(a5_386 >> 24) * 0x04] ^ *((char *) g_a2307AA14 + (a7_119 & 0x00FF) * 0x04) ^ s0_135->dw001C ^ (a4_341 >> 0x0E & 1020)->dw2307A214 ^ (t3_110 >> 0x06 & 1020)->dw2307A614;
		int32 s10_202 = s0_135->dw0020;
		if (s7_150 == 0x00)
			break;
		struct Eq_97581 * a0_356 = *((char *) g_a2307AA14 + (a0_186 & 0x00FF) * 0x04);
		word32 a3_370 = g_a2307A214[(a3_127 >> 16 & 0x00FF) * 0x04];
		a4_341 = g_a23079E14[(a3_127 >> 0x18) * 0x04] ^ *((char *) g_a2307AA14 + (a5_188 & 0x00FF) * 0x04) ^ s10_202 ^ g_a2307A214[(a1_152 >> 0x10 & 0x00FF) * 0x04] ^ g_a2307A614[(a0_186 >> 0x08 & 0x00FF) * 0x04];
		t3_110 = g_a23079E14[(a1_152 >> 0x18) * 0x04] ^ *((char *) g_a2307AA14 + (a3_127 & 0x00FF) * 0x04) ^ s0_135->dw0024 ^ g_a2307A214[(a0_186 >> 0x10 & 0x00FF) * 0x04] ^ g_a2307A614[(a5_188 >> 0x08 & 0x00FF) * 0x04];
		a7_119 = g_a23079E14[(a0_186 >> 0x18) * 0x04] ^ *((char *) g_a2307AA14 + (a1_152 & 0x00FF) * 0x04) ^ (a0_356->ptr000C)->dw0008 ^ g_a2307A214[(a5_188 >> 0x10 & 0x00FF) * 0x04] ^ g_a2307A614[(a3_127 >> 0x08 & 0x00FF) * 0x04];
		a5_386 = g_a23079E14[(a5_188 >> 24) * 0x04] ^ a0_356 ^ a0_356 ^ a3_370 ^ a3_370;
	}
	Eq_93769 s10_233 = (word32) (a3_127 >> 0x18)->b2307AE14 << 24 ^ (word32) (a1_152 >> 0x10 & 0x00FF)->b2307AE14 << 16 ^ (word32) (a5_188 & 0x00FF)->b2307AE14 ^ (word32) (a0_186 >> 0x08 & 0x00FF)->b2307AE14 << 8 ^ s10_202;
	a2->b0000 = (byte) (s10_233 >> 0x18);
	a2->b0001 = (byte) (s10_233 >> 0x10);
	a2->b0002 = (byte) (s10_233 >> 0x08);
	byte * s6_229 = (a1_152 >> 0x18) + 587705876;
	byte * s5_243 = (a3_127 & 0x00FF) + 587705876;
	ui32 a4_246 = (word32) *s6_229 << 24 ^ (word32) (a0_186 >> 0x10 & 0x00FF)->b2307AE14 << 16;
	word32 a6_247 = (word32) *s5_243;
	a2->b0003 = (byte) s10_233;
	struct Eq_97397 * s8_218 = a0_44 + 8 + ((a6_86 >> 0x01) << 5);
	uint32 a4_259 = a4_246 ^ a6_247 ^ (word32) (a5_188 >> 0x08 & 0x00FF)->b2307AE14 << 8 ^ s8_218->dw0004;
	a2->b0004 = (byte) (a4_259 >> 0x18);
	a2->b0005 = (byte) (a4_259 >> 0x10);
	a2->b0006 = (byte) (a4_259 >> 0x08);
	a2->b0007 = (byte) a4_259;
	byte * s3_257 = (a1_152 & 0x00FF) + 587705876;
	ui32 a5_275 = (word32) (a5_188 >> 24)->b2307AE14;
	uint32 a4_284 = (word32) (a0_186 >> 0x18)->b2307AE14 << 24 ^ (word32) (a5_188 >> 0x10 & 0x00FF)->b2307AE14 << 16 ^ (word32) (*s3_257) ^ (word32) (a3_127 >> 0x08 & 0x00FF)->b2307AE14 << 8 ^ s8_218->dw0008;
	a2->b0008 = (byte) (a4_284 >> 0x18);
	a2->b0009 = (byte) (a4_284 >> 0x10);
	a2->b000B = (byte) a4_284;
	ui32 a4_291 = (word32) (a3_127 >> 16 & 0x00FF)->b2307AE14;
	a2->b000A = (byte) (a4_284 >> 0x08);
	uint32 a5_301 = a5_275 << 24 ^ a4_291 << 16 ^ (word32) (a0_186 & 0x00FF)->b2307AE14 ^ (word32) (a1_152 >> 8 & 0x00FF)->b2307AE14 << 8 ^ s8_218->dw000C;
	a2->b000C = (byte) (a5_301 >> 0x18);
	a2->b000D = (byte) (a5_301 >> 0x10);
	dwArgE4->b000E = (byte) (a5_301 >> 0x08);
	dwArgE4->b000F = (byte) a5_301;
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s3Out = s3_257;
	s4Out = dwArg98;
	s5Out = s5_243;
	s6Out = s6_229;
	s7Out = s7_150;
	s8Out = dwArg78;
	s10Out = s10_233;
	return 587701780;
}

