pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302184A: Register (ptr32 Eq_97829) Bl_SHA1ProcessMessageBlock(Register Eq_2 a0)
// Called from:
//      Bl_SHA1Final
//      Bl_SHA1Update
struct Eq_97829 * Bl_SHA1ProcessMessageBlock(Eq_2 a0)
{
	struct Eq_97831 * a4_11 = (word32) a0 + 28;
	do
	{
		++a4_11;
		a4_11[0x03FF] = (struct Eq_97831) ((word32) a4_11[16] << 24 | (word32) a4_11->b0041 << 16 | (word32) a4_11->b003E << 8 | (word32) a4_11->b003F);
	} while ((word32) a0 + 92 != a4_11);
	Eq_97867 a6_137 = *a0;
	Eq_97867 t3_24 = *((word32) a0 + 4);
	int32 t1_100 = *((word32) a0 + 8);
	int32 t4_149 = *((word32) a0 + 0x0C);
	int32 t6_27 = *((word32) a0 + 16);
	struct Eq_97887 * a5_104 = null;
	while (true)
	{
		int32 a4_51;
		ui32 a3_44 = ((t1_100 ^ t4_149) & t3_24 ^ t4_149) + ((a6_137 << 0x05 | a6_137 >> 0x1B) + 0x5A827999);
		if ((a5_104 & 48) != 0x00)
		{
			int32 * a7_65 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
			uint32 a4_74 = *((word32) a0 + ((a5_104 + 0x0D & 0x0F) * 0x04 + 28)) ^ *((word32) a0 + ((a5_104 + 8 & 0x0F) * 0x04 + 28)) ^ *a7_65 ^ *((word32) a0 + ((a5_104 + 2 & 0x0F) * 0x04 + 28));
			a4_51 = a4_74 >> 31 | a4_74 << 0x01;
			*a7_65 = a4_51;
		}
		else
			a4_51 = (word32) a0 + (a5_104 << 0x02) + 28;
		++a5_104;
		Eq_97867 a4_122 = a4_51 + a3_44 + t6_27;
		int32 a7_138 = t3_24 << 0x1E | t3_24 >> 0x02;
		t3_24 = a6_137;
		t6_27 = t4_149;
		if (a5_104 == (struct Eq_97887 *) 0x14)
			break;
		t4_149 = t1_100;
		a6_137 = a4_122;
		t1_100 = a7_138;
	}
	while (true)
	{
		int32 * t3_119 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a1_131 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem114[t3_119 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a1_134 = a1_131 >> 31 | a1_131 << 0x01;
		*t3_119 = a1_134;
		++a5_104;
		Eq_97867 a3_150 = (a6_137 ^ a7_138 ^ t1_100) + ((a4_122 << 0x05 | a4_122 >> 0x1B) + 1859775393) + a1_134 + t4_149;
		int32 t3_151 = a6_137 << 0x1E | a6_137 >> 0x02;
		a6_137 = a4_122;
		t4_149 = t1_100;
		if (a5_104 == (struct Eq_97887 *) 40)
			break;
		t1_100 = a7_138;
		a4_122 = a3_150;
		a7_138 = t3_151;
	}
	while (true)
	{
		int32 * t4_176 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a6_188 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem171[t4_176 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a6_191 = a6_188 >> 0x1F | a6_188 << 0x01;
		*t4_176 = a6_191;
		++a5_104;
		Eq_97867 a1_209 = ((t3_151 | a7_138) & a4_122 | t3_151 & a7_138) + ((a3_150 << 0x05 | a3_150 >> 0x1B) + 2400959708) + a6_191 + t1_100;
		int32 t4_210 = a4_122 << 0x1E | a4_122 >> 0x02;
		a4_122 = a3_150;
		t1_100 = a7_138;
		if (a5_104 == (struct Eq_97887 *) 60)
			break;
		a7_138 = t3_151;
		a3_150 = a1_209;
		t3_151 = t4_210;
	}
	while (true)
	{
		int32 * t1_235 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a4_247 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem230[t1_235 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a4_250 = a4_247 >> 31 | a4_247 << 0x01;
		*t1_235 = a4_250;
		++a5_104;
		Eq_97867 a4_264 = a4_250 + (((a3_150 ^ t4_210) ^ t3_151) + ((a1_209 << 0x05 | a1_209 >> 0x1B) + 0xCA62C1D6)) + a7_138;
		int32 a6_267 = a3_150 << 0x1E | a3_150 >> 0x02;
		a3_150 = a1_209;
		a7_138 = t3_151;
		if (a5_104 == (struct Eq_97887 *) 80)
			break;
		t3_151 = t4_210;
		a1_209 = a4_264;
		t4_210 = a6_267;
	}
	a5_104->ptr0000->w009C = 0x00;
	Mem278[a4_264 + a5_104:word32] = Mem275[a5_104 + 4:word32];
	word32 a1_279 = a1_209 + a5_104;
	a1_279->dw0004 = (word32) a5_104[8];
	*a5_104[0x0C].dw0008 = (struct Eq_97887) (a5_104 + a6_267);
	struct Eq_97977 * a0_286 = a5_104[16];
	a0_286->dw000C = a5_104 + t4_210;
	a0_286->dw0010 = a5_104 + t3_151;
	return a1_279;
}

// 23021B14: void Bl_SHA1Init(Register (ptr32 Eq_94088) a0)
// Called from:
//      Bl_hmac_sha1
void Bl_SHA1Init(struct Eq_94088 * a0)
{
	if (a0 == null)
		return;
	*(struct Eq_94088 **) 0x67452301 = a0;
	*(struct Eq_94088 **) 4023233421 = a0;
	*(struct Eq_94088 **) 0x98BADD06 = a0;
	*(struct Eq_94088 **) 271733890 = a0;
	a0->dw0014 = 0x00;
	a0->dw0018 = 0x00;
	*(struct Eq_94088 **) 0xC3D2E200 = a0;
	a0->dw009C = 0x00;
}

// 23021B5C: Register Eq_2 Bl_SHA1Final(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 s1Out)
// Called from:
//      Bl_hmac_sha1
Eq_2 Bl_SHA1Final(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_2 & s1Out)
{
	if (a0 == 0x00 || (a1 == 0x00 || (word32) (*((word32) a0 + 0x009F)) != 0x00))
	{
		s1Out = s1;
		return ra;
	}
	else
	{
		Eq_2 s0_168 = a0;
		if ((word32) *((word32) a0 + 0x009E) == 0x00)
		{
			int32 a4_20 = (int32) *((word32) a0 + 0x009C);
			*((word32) a0 + 0x009C) = (word16) (int32) (word16) (a4_20 + 1);
			(word32) a0 + a4_20 + 92 = (ptr32) 0x80;
			if (a4_20 > 55)
			{
				while (true)
				{
					int32 a5_41 = (int32) *((word32) a0 + 0x009C);
					if (a5_41 > 63)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_41 + 1);
					(word32) a0 + a5_41 + 92 = (word32) 0x00;
				}
				Bl_SHA1ProcessMessageBlock(a0);
				while (true)
				{
					int32 a5_65 = (int32) *((word32) a0 + 0x009C);
					if (a5_65 > 55)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_65 + 1);
					(word32) a0 + a5_65 + 92 = (word32) 0x00;
				}
			}
			else
			{
				while (true)
				{
					int32 a5_32 = (int32) *((word32) a0 + 0x009C);
					if (a5_32 > 55)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_32 + 1);
					(word32) a0 + a5_32 + 92 = (word32) 0x00;
				}
			}
			uint32 a5_73 = (word32) *((word32) a0 + 24);
			struct Eq_98318 * s0_78 = (a5_73 >> 8)->ptr0018;
			s0_78->w0096 = (word16) (a5_73 << 0x08 | a5_73 >> 8);
			s0_78->b0095 = (byte) (a5_73 >> 24);
			uint32 a5_83 = (word32) s0_78->w0014;
			s0_78->b0094 = (byte) (a5_73 >> 0x20);
			s0_168 = (a5_83 >> 8)->t0014;
			*((word32) s0_168 + 0x009A) = (word16) (a5_83 << 0x08 | a5_83 >> 8);
			((word32) s0_168 + 0x0099)->u1 = (byte) (a5_83 >> 24);
			*((word32) s0_168 + 0x0098) = (byte) (a5_83 >> 0x20);
			Bl_SHA1ProcessMessageBlock(a0);
			byte * a5_108 = (word32) s0_168 + 92;
			do
			{
				*a5_108 = 0x00;
				++a5_108;
			} while ((word32) s0_168 + 0x009C != a5_108);
			*((word32) s0_168 + 20) = 0x00;
			*((word32) s0_168 + 24) = 0x00;
			((word32) s0_168 + 0x009E)->u1 = 0x01;
		}
		int32 a5_119;
		for (a5_119 = 0x00; a5_119 != 0x14; ++a5_119)
			((word32) a1 + a5_119)->u1 = (byte) (*((word32) s0_168 + (a5_119 & -4)) >> ((~a5_119 & 0x03) << 3));
		word32 a5_275;
		word32 a4_274;
		word32 a2_272;
		word32 a3_273;
		word32 a1_271;
		word32 t1_269;
		word32 a0_270;
		Eq_2 ra_152 = memset(ra, s0_168, 0x00, 0x00A0, out t1_269, out a0_270, out a1_271, out a2_272, out a3_273, out a4_274, out a5_275);
		s1Out = a1;
		return ra_152;
	}
}

// 23021CA8: Register word32 Bl_SHA1Update(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack word32 dwArg0128, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 s2Out, Register out Eq_94330 s3Out)
// Called from:
//      Bl_hmac_sha1
word32 Bl_SHA1Update(Eq_2 a0, Eq_2 a1, Eq_2 a2, word32 dwArg0128, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & s2Out, union Eq_94330 & s3Out)
{
	if (a2 != 0x00)
	{
		Eq_2 s0_10 = a0;
		if (a0 != 0x00 && a1 != 0x00)
		{
			if ((word32) *((word32) a0 + 0x009E) != 0x00)
				((word32) a0 + 0x009F)->u1 = 0x03;
			else if ((word32) *((word32) a0 + 0x009F) == 0x00)
			{
				word32 s1_22 = a1 + a2;
				s2 = 0x01;
				s3.u0 = 64;
				while (a1 != s1_22 && (word32) (*((word32) s0_10 + 0x009F)) == 0x00)
				{
					int32 a4_30 = (int32) *((word32) s0_10 + 0x009C);
					int32 a5_32 = a4_30 + 1 << 16;
					*((word32) s0_10 + 0x009C) = (word16) (a5_32 >> 16);
					struct Eq_98521 * a4_36 = (word32) s0_10 + a4_30;
					a4_36->b005C = (byte) (word32) *a1;
					s0_10 = a4_36->t0014;
					a4_36->t001C = s0_10;
					if (a4_36 == (struct Eq_98521 *) 0x08)
					{
						s0_10 = a4_36->t0020;
						a4_36->t0021 = s0_10;
						if (a4_36 == (struct Eq_98521 *) 0x09)
							((word32) s0_10 + 0x009F)->u1 = 0x01;
					}
					if (a5_32 >> 16 == 64)
						a1 = Bl_SHA1ProcessMessageBlock(s0_10);
					a1 = (word32) a1 + 1;
				}
			}
		}
		0x00 = dwArg0128;
		a1Out = a1;
		a2Out = dwArg0100;
		s2Out = s2;
		s3Out = s3;
		return dwArgE4;
	}
	else
	{
		a1Out = a1;
		a2Out = a2;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
}

