pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23021D3E: Register Eq_2 supplicantRestoreDefaults(Register Eq_2 ra, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s2Out)
// Called from:
//      supplicantFuncInit
Eq_2 supplicantRestoreDefaults(Eq_2 ra, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s2Out)
{
	word32 s1_107;
	word32 a2_108;
	word32 a5_109;
	word32 a6_110;
	word32 s2_111;
	word32 s3_112;
	word32 s4_113;
	word32 s5_114;
	word32 s6_115;
	word32 s7_116;
	word32 s8_117;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_107, out a2_108, out a5_109, out a6_110, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117);
	Eq_2 ra_41 = pmkCacheInit(ra, dwArg28, dwArg0158, dwArg0168);
	word32 s2_118;
	pmkCacheRomInit(dwArg28, dwArg0158, dwArg0168, out s2_118);
	ptr32 s2_86;
	word32 s1_119;
	word32 a2_120;
	word32 a5_121;
	word32 a6_122;
	word32 s3_123;
	word32 s4_124;
	word32 s5_125;
	word32 s6_126;
	word32 s7_127;
	word32 s8_128;
	dbg_test_print(&g_b23075D78, dwArg0168, out s1_119, out a2_120, out a5_121, out a6_122, out s2_86, out s3_123, out s4_124, out s5_125, out s6_126, out s7_127, out s8_128);
	0x00 = (uint16) dwArg38;
	s2Out = s2_86;
	return ra_41;
}

// 23021D9A: Register Eq_2 supplicantFuncInit(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      bl_init
Eq_2 supplicantFuncInit(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 s1_90;
	word32 a2_91;
	word32 a5_92;
	word32 a6_93;
	word32 s2_94;
	word32 s3_95;
	word32 s4_96;
	word32 s5_97;
	word32 s6_98;
	word32 s7_99;
	word32 s8_100;
	dbg_test_print(&g_b23075D64, dwArg0168, out s1_90, out a2_91, out a5_92, out a6_93, out s2_94, out s3_95, out s4_96, out s5_97, out s6_98, out s7_99, out s8_100);
	word32 s2_101;
	Eq_2 ra_41 = supplicantRestoreDefaults(ra, dwArg18, dwArg28, dwArg0148, dwArg0158, out s2_101);
	0x00 = (uint16) dwArg38;
	word32 s1_102;
	word32 a2_103;
	word32 a5_104;
	word32 a6_105;
	word32 s2_106;
	word32 s3_107;
	word32 s4_108;
	word32 s5_109;
	word32 s6_110;
	word32 s7_111;
	word32 s8_112;
	dbg_test_print(&g_b23075D78, dwArg0178, out s1_102, out a2_103, out a5_104, out a6_105, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112);
	return ra_41;
}

// 23021DEE: Register word32 ap_setpsk(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      apm_start_req_handler
word32 ap_setpsk(Eq_2 a0, Eq_2 a1, Eq_2 a2)
{
	word32 a4_111;
	word32 a5_112;
	struct Eq_50194 * a0_15 = cm_GetApInfo(a0, out a4_111, out a5_112);
	if (a0_15 == null)
		return;
	Eq_2 a1_29;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	a0_15->b00A4 = (byte) strlen(a1, out a1_29, out a2_113, out a3_114, out a4_115, out a5_116);
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	word32 a5_121;
	word32 a6_122;
	word32 a7_123;
	memcpy(&a0_15->dw0080 + 1, a1_29, 32, out a1_117, out a2_118, out a3_119, out a4_120, out a5_121, out a6_122, out a7_123);
	word32 a1_124;
	word32 a2_125;
	word32 a3_126;
	word32 a4_127;
	word32 a5_128;
	a0_15->b0058 = (byte) strlen(a2, out a1_124, out a2_125, out a3_126, out a4_127, out a5_128);
	word32 a1_129;
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	word32 a6_134;
	word32 a7_135;
	memcpy(&a0_15->b0016 + 2, a2, 64, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out a6_134, out a7_135);
	return;
}

// 23021E46: void ap_resetConfiguration(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      InitializeAp
void ap_resetConfiguration(Eq_2 ra, Eq_2 a0)
{
	word32 a4_116;
	word32 a5_117;
	struct Eq_50194 * a0_12 = cm_GetApInfo(a0, out a4_116, out a5_117);
	word32 a4_118;
	word32 a5_119;
	Eq_2 a0_17 = cm_GetApData(a0, out a4_118, out a5_119);
	if (a0_12 != null && a0_17 != 0x00)
	{
		word32 a1_120;
		word32 a2_121;
		word32 a3_122;
		word32 a4_123;
		word32 a5_124;
		a0_12->b00A4 = (byte) strlen(587706220, out a1_120, out a2_121, out a3_122, out a4_123, out a5_124);
		word32 a1_125;
		word32 a2_126;
		word32 a3_127;
		word32 a4_128;
		word32 a5_129;
		word32 a6_130;
		word32 a7_131;
		memcpy(&a0_12->dw0080 + 1, 587706220, 32, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a6_130, out a7_131);
		a0_12->dw00B8 = 0x01;
		word32 t1_132;
		word32 a0_133;
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a5_138;
		memset(ra, &a0_12->w0008, 0x00, 0x007C, out t1_132, out a0_133, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138);
		ui32 a5_59 = (word32) a0_12->w0008;
		a0_12->w0010 = 0x01;
		a0_12->w0008 = (word16) (a5_59 & 0x00F7 | 264);
		a0_12->w000C = (word16) ((word32) a0_12->w000C & 0x00F7 | 264);
		a0_12->b0079 = 0x03;
		a0_12->b007A = 0x03;
		*(struct Eq_50194 **) 0xE0 = a0_12;
		a0_12->dw0080 = 100;
		*(struct Eq_50194 **) 0x15000194 = a0_12;
	}
}

// 23021EDE: void InitializeAp(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      cm_AllocResources
void InitializeAp(Eq_2 ra, Eq_2 a0)
{
	ap_resetConfiguration(ra, a0);
}

// 23021EE2: Register Eq_2 bl60x_check_mac_status(Register Eq_2 a0, Register out Eq_98892 a3Out, Register out Eq_98892 a4Out, Register out (ptr32 Eq_98894) a5Out)
// Called from:
//      stateDisconnect_enter
Eq_2 bl60x_check_mac_status(Eq_2 a0, union Eq_98892 & a3Out, union Eq_98892 & a4Out, struct Eq_98894 & a5Out)
{
	Eq_98892 a3_5 = (word32) g_b4200DD64;
	struct Eq_98894 * a5_12 = &g_t4201201C;
	Eq_98892 a4_10 = 0x00;
	while (a4_10 < a3_5)
	{
		++a5_12;
		if (a5_12->dwFFFFFFEC != 0x8801E000)
		{
			*(union Eq_2 *) 0x01 = a0;
			a5_12 = (struct Eq_98894 *) 0x01;
			goto l23021F12;
		}
		a4_10 = (word32) a4_10.u0 + 1;
	}
	*a0 = 0x00;
l23021F12:
	a3Out = a3_5;
	a4Out = a4_10;
	a5Out = a5_12;
	return 0x00;
}

// 23021F1A: Register Eq_2 helper_record_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_98935) s0Out, Register out ptr32 a3Out)
// Called from:
//      stateDisconnect_enter
Eq_2 helper_record_dump(Eq_2 ra, Eq_2 a3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0128, struct Eq_98935 & s0Out, ptr32 & a3Out)
{
	word32 a4_282;
	word32 a2_281;
	word32 a1_280;
	word32 a0_279;
	word32 s8_285;
	word32 s4_284;
	word32 a5_283;
	puts(0x2307AF80, out a0_279, out a1_280, out a2_281, out a4_282, out a5_283, out s4_284, out s8_285);
	int32 s1_183 = 0x00;
	struct Eq_98956 * s6_190 = &g_t4200E000;
	word32 s7_191 = 0x2307B000;
	while (s1_183 < (word32) s6_190->bFFFFFD64)
	{
		struct Eq_98960 * a1_61;
		uint32 a2_62;
		word32 s4_72;
		word32 s7_296;
		word32 s6_295;
		word32 s5_294;
		word32 s3_293;
		word32 s2_292;
		word32 a7_291;
		word32 a5_290;
		word32 a4_289;
		word32 a3_288;
		word32 a0_287;
		word32 s1_286;
		word32 s8_297;
		word32 s9_298;
		word32 s10_299;
		word32 s11_300;
		word32 t4_301;
		Eq_2 ra_66 = printf(ra, s7_191 + -96, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_286, out a0_287, out a1_61, out a2_62, out a3_288, out a4_289, out a5_290, out a7_291, out s2_292, out s3_293, out s4_72, out s5_294, out s6_295, out s7_296, out s8_297, out s9_298, out s10_299, out s11_300, out t4_301);
		struct Eq_99004 * s0_82 = a1_61->ptr0014;
		word32 s5_102;
		Eq_2 a3_148;
		word32 s1_302;
		word32 a0_303;
		word32 a1_304;
		word32 a2_305;
		word32 a3_306;
		word32 a4_307;
		word32 a5_308;
		word32 a7_309;
		word32 s2_310;
		word32 s3_311;
		word32 s4_312;
		word32 s6_313;
		word32 s7_314;
		word32 s8_315;
		word32 s9_316;
		word32 s10_317;
		word32 s11_318;
		word32 t4_319;
		word32 s1_320;
		word32 a0_321;
		word32 a1_322;
		word32 a2_323;
		word32 a3_324;
		word32 a4_325;
		word32 a5_326;
		word32 a7_327;
		word32 s2_328;
		word32 s3_329;
		word32 s4_330;
		word32 s5_331;
		word32 s6_332;
		word32 s7_333;
		word32 s8_334;
		word32 s9_335;
		word32 s10_336;
		word32 s11_337;
		word32 t4_338;
		word32 s1_339;
		word32 a0_340;
		word32 a1_341;
		word32 a2_342;
		word32 a4_343;
		word32 a5_344;
		word32 a7_345;
		word32 s2_346;
		word32 s3_347;
		word32 s4_348;
		word32 s5_349;
		word32 s6_350;
		word32 s7_351;
		word32 s8_352;
		word32 s9_353;
		word32 s10_354;
		word32 s11_355;
		word32 t4_356;
		word32 a0_357;
		word32 a1_358;
		word32 a2_359;
		word32 a4_360;
		word32 a5_361;
		word32 a7_362;
		word32 s2_363;
		word32 s3_364;
		word32 s4_365;
		word32 s5_366;
		word32 s8_367;
		word32 s9_368;
		word32 s10_369;
		word32 s11_370;
		word32 t4_371;
		ra = printf(printf(printf(printf(ra_66, s4_72 + -0x0044, a2_62 >> 0x08 & 511, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_302, out a0_303, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a7_309, out s2_310, out s3_311, out s4_312, out s5_102, out s6_313, out s7_314, out s8_315, out s9_316, out s10_317, out s11_318, out t4_319), s5_102 + -8, (word32) s0_82->w001C, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_320, out a0_321, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a7_327, out s2_328, out s3_329, out s4_330, out s5_331, out s6_332, out s7_333, out s8_334, out s9_335, out s10_336, out s11_337, out t4_338), &g_t2307B02C, (word32) s0_82->w0024, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_339, out a0_340, out a1_341, out a2_342, out a3_148, out a4_343, out a5_344, out a7_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355, out t4_356), &g_t2307B068, a3_148, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_183, out a0_357, out a1_358, out a2_359, out a3, out a4_360, out a5_361, out a7_362, out s2_363, out s3_364, out s4_365, out s5_366, out s6_190, out s7_191, out s8_367, out s9_368, out s10_369, out s11_370, out t4_371);
	}
	0x00 = (uint16) dwArg0128;
	ptr32 a3_212;
	word32 s1_372;
	word32 a0_373;
	word32 a1_374;
	word32 a2_375;
	word32 a4_376;
	word32 a5_377;
	word32 a7_378;
	word32 s2_379;
	word32 s3_380;
	word32 s4_381;
	word32 s5_382;
	word32 s6_383;
	word32 s7_384;
	word32 s8_385;
	word32 s9_386;
	word32 s10_387;
	word32 s11_388;
	word32 t4_389;
	Eq_2 ra_215 = printf(ra, &g_t2307B07C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_372, out a0_373, out a1_374, out a2_375, out a3_212, out a4_376, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388, out t4_389);
	s0Out = dwArgE4;
	a3Out = a3_212;
	return ra_215;
}

// 2302200E: void helper_record_rc_rf_states(Register word32 a0, Register word32 a1)
// Called from:
//      helper_record_all_states
void helper_record_rc_rf_states(word32 a0, word32 a1)
{
	*(int32 *) 0x40001220 = *(int32 *) 0x40001220 & 0x0FFFFFFF | 0x10000000;
	*(int32 *) 0x40001220 = *(int32 *) 0x40001220 & 0x0FFFFFFF | 0x20000000;
	Eq_99249 a5_18 = *(union Eq_99249 *) 0x40001224;
	*(a5_18 >> 0x1C & 0x07) = a0;
	*(a5_18 >> 25 & 0x07) = a1;
}

// 23022052: Register uint32 helper_record_all_states(Register (ptr32 Eq_79026) a0, Stack Eq_2 dwArg38)
// Called from:
//      hal_machw_reset
uint32 helper_record_all_states(struct Eq_79026 * a0, Eq_2 dwArg38)
{
	struct Eq_99267 * a5_8 = (word32) g_b4200DD64;
	Eq_2 a3_19 = *(union Eq_2 *) 0x44B00120;
	a0->dw0004 = (char *) a5_8 + 0x42012044;
	*a3_19 = (char *) a5_8 + 0x42012044;
	helper_record_rc_rf_states((char *) a5_8 + 1107370060, (char *) a5_8 + 0x42012050);
	(*(struct Eq_99292 **) 0x44B00500)->dw0010 = (char *) a5_8 + 0x42012044;
	(*(struct Eq_99298 **) 0x44B00504)->dw0014 = (char *) a5_8 + 0x42012044;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & -0x0100 | 49;
	*(int32 *) 0x44B00510 &= 0xF00000FF;
	(*(struct Eq_99318 **) 0x44B0050C)->dw0018 = (char *) a5_8 + 0x42012044;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & -0x0100 | 11;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & 0xF00000FF | 0x02FFFF00;
	(*(struct Eq_99318 **) 0x44B0050C)->dw001C = (char *) a5_8 + 0x42012044;
	*(word32 *) 0x03AE = 0x44900000;
	Eq_2 a4_63 = *(union Eq_2 *) 930;
	*(union Eq_2 *) 0x7C = a4_63;
	*(word32 *) 0x400000D0 = 0x04;
	*(word32 *) 0x400000D4 = 0x40000004;
	*(word32 *) 0x400000D8 = 0x80000004;
	*(word32 *) 0x400000DC = 0xC0000004;
	*(union Eq_99365 *) 0x400000E0 &= ~0x01;
	Eq_99365 a3_85 = *(union Eq_99365 *) 0x400000E0;
	a5_8->w42012066 = (word16) (a3_85 >> 1);
	a5_8->w42012064 = (word16) (a3_85 >> 0x11);
	*(union Eq_2 *) 16776061 = a4_63;
	*(union Eq_99365 *) 0x400000E0 &= ~0x01;
	Eq_99365 a5_96 = *(union Eq_99365 *) 0x400000E0;
	a5_8->w42012068 = (word16) (a5_96 >> 1);
	word32 a5_100 = (word32) g_b4200DD64;
	a5_8->w4201206A = (word16) (a5_96 >> 0x11);
	g_b4200DD64 = (byte) (a5_100 + 0x01 & 0x0F);
	0x00 = (uint16) dwArg38;
	return a5_96 >> 0x11;
}

// 23022194: void ipc_emb2app_rawstatus_get()
// Called from:
//      ipc_host_get_rawstatus
void ipc_emb2app_rawstatus_get()
{
}

// 2302219C: Register Eq_2 ipc_host_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bl_ipc_init
Eq_2 ipc_host_init(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_99433 * s1_38;
	word32 s2_41;
	Eq_2 s3_42;
	word32 a0_132;
	word32 a1_133;
	word32 a2_134;
	word32 a3_135;
	word32 a4_136;
	word32 a5_137;
	word32 a7_138;
	word32 s4_139;
	word32 s5_140;
	word32 s6_141;
	word32 s7_142;
	word32 s8_143;
	word32 s9_144;
	word32 s10_145;
	word32 s11_146;
	word32 t4_147;
	Eq_2 ra_37 = printf(ra, &g_t2307B144, g_dw4200D908 + g_dw4200D938, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_38, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out a7_138, out s2_41, out s3_42, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
	utils_list_init(&g_t4201E440);
	word32 t1_148;
	word32 a0_149;
	word32 a1_150;
	word32 a2_151;
	word32 a3_152;
	word32 a4_153;
	word32 a5_154;
	Eq_2 ra_62 = memset(ra_37, a0, 0x00, 228, out t1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154);
	s1_38->t0020 = a0;
	word32 a1_155;
	word32 a2_156;
	word32 a3_157;
	word32 a4_158;
	word32 a5_159;
	word32 a6_160;
	word32 a7_161;
	memcpy(a0, s3_42, 32, out a1_155, out a2_156, out a3_157, out a4_158, out a5_159, out a6_160, out a7_161);
	*(union Eq_2 *) 0x3A = a0;
	((word32) a0 + 53)->u1 = 0x02;
	((word32) a0 + 0x00A4)->u0 = 0x08;
	((word32) a0 + 0x00A8)->u0 = 992;
	*((word32) a0 + 224) = s2_41;
	*(union Eq_2 *) 0x00FFF83C = a0;
	*((word32) a0 + 0x00A0) = a0;
	s1_38->t0260 = a0;
	ptr32 a3_108;
	ptr32 a4_109;
	word32 t1_162;
	word32 a0_163;
	word32 a1_164;
	word32 a2_165;
	word32 a5_166;
	Eq_2 ra_111 = memset(ra_62, (char *) &s1_38->t0020 + 484, 0x00, (word32) dwArg48 - 832, out t1_162, out a0_163, out a1_164, out a2_165, out a3_108, out a4_109, out a5_166);
	s0Out = a0;
	a3Out = a3_108;
	a4Out = a4_109;
	return ra_111;
}

