pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302223A: Register word32 ipc_host_msg_push(Register Eq_99572 a2, Register Eq_2 a3, Register Eq_2 a4, Register out ptr32 a5Out)
// Called from:
//      cmd_mgr_llind
//      cmd_mgr_queue
word32 ipc_host_msg_push(Eq_99572 a2, Eq_2 a3, Eq_2 a4, ptr32 & a5Out)
{
	Eq_30459 a1_5 = *((word32) a3 + 0x0C);
	Eq_2 a0_7 = *((word32) a4 + 32);
	Eq_99572 a5_17 = 0x00;
	while (a5_17 < a2)
	{
		Mem18[a4 + a5_17 + 4:word32] = Mem13[a3 + a5_17:int32];
		a5_17 = (word32) a5_17.u0 + 4;
	}
	*((word32) a0_7 + 0x00B0) = a1_5;
	((union Eq_2 *) 0x02)->u0 = 0x44800000;
	a5Out = 0x44800000;
	return 0x00;
}

// 23022268: Register Eq_2 ipc_host_get_rawstatus(Register Eq_2 a0)
// Called from:
//      bl_irq_bottomhalf
Eq_2 ipc_host_get_rawstatus(Eq_2 a0)
{
	Eq_2 a0_5 = *((word32) a0 + 32);
	ipc_emb2app_rawstatus_get();
	return a0_5;
}

// 2302226E: Register word32 ipc_host_txdesc_get(Register (ptr32 Eq_46930) a2, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      bl_tx_push
//      bl_tx_resend
//      bl_tx_try_flush
word32 ipc_host_txdesc_get(struct Eq_46930 * a2, Eq_2 a4, Eq_2 a5, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_7 = *((word32) a5 + 64);
	if (a5 < a4)
		a2->dw0001 = a2->dw0000;
	if ((word32) a4 + 4 == a5)
	{
		a3Out = (word32) a4 + 4;
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
	else
	{
		Eq_2 a0_21 = *((word32) a0_7 + 92);
		if (a5 - a4 > 0x04)
		{
			while (true)
				;
		}
		else
		{
			a3Out = 0x04;
			a4Out.u0 = 0x0330;
			Eq_2 a5_24 = (a5 & 0x03) + 0x0330;
			a5Out = a5_24;
			return a0_21 + a5_24;
		}
	}
}

// 230222AC: Register word32 ipc_host_txdesc_push(Register (ptr32 (ptr32 Eq_99663)) a1, Register ui32 a5, Register out ptr32 a3Out, Register out Eq_99653 a4Out)
// Called from:
//      bl_tx_push
word32 ipc_host_txdesc_push(struct Eq_99663 ** a1, ui32 a5, ptr32 & a3Out, union Eq_99653 & a4Out)
{
	ui32 a3_8 = (a5 & 0x03) + 0x0330;
	*(union Eq_2 *) ~0x00 = a3_8 + 0x0330;
	struct Eq_99663 * a5_15 = ((a5 & 0x03) << 2) + (a3_8 + 0x0330);
	*a1 = (struct Eq_99663 **) a5_15;
	word32 a0_18 = a5_15->dw0040;
	a5_15->dw0041 = a0_18;
	*(word32 *) 0x0100 = 0x44800000;
	a3Out = ~0x00;
	a4Out.u0 = 0x0100;
	return a0_18;
}

// 230222DA: Register Eq_2 ipc_host_irq(Register Eq_2 ra, Register ui32 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_46930) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_46927 s6, Register ptr32 mstatus, Stack word32 dwArg00, Stack ptr32 dwArg04, Stack word32 dwArg28, Stack ptr32 dwArg48, Stack Eq_2 dwArg88, Stack word32 dwArgA8, Register out Eq_99701 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_99705) a4Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out Eq_46927 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_irq_bottomhalf
Eq_2 ipc_host_irq(Eq_2 ra, ui32 s1, Eq_2 a0, Eq_2 a1, struct Eq_46930 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_46927 s6, ptr32 mstatus, word32 dwArg00, ptr32 dwArg04, word32 dwArg28, ptr32 dwArg48, Eq_2 dwArg88, word32 dwArgA8, union Eq_99701 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_99705 & a4Out, union Eq_2 & s2Out, ptr32 & s4Out, union Eq_46927 & s6Out, ptr32 & mstatusOut)
{
	*((word32) a1 + 8) = (struct Eq_99663 **) 0x44800000;
	struct Eq_99714 * sp_115 = fp + ~0x1F;
	Eq_2 s0_25 = a0;
	ui32 s1_26 = s1 | a1;
	if ((s1_26 & 0x0780) != 0x00)
	{
		int32 * s3_29 = &g_dw2307B184;
		word32 s4_30 = 0x07;
		s6.u0 = 0x01;
		word32 s5_32 = 11;
		do
		{
			struct Eq_46930 * a2_73;
			Eq_2 a4_68;
			if ((s6 << s4_30 & s1_26) != 0x00)
			{
				while (true)
				{
					struct Eq_99790 * a5_40 = *s3_29;
					ui32 s2_43 = *((word32) s0_25 + 0x0044) & a5_40;
					s0_25 = a5_40->t0058;
					s2 = s2_43 << 2;
					Eq_2 a5_47 = *a1;
					if (a1 == 0x00)
						break;
					word32 s0_48 = *a5_47;
					struct Eq_99814 * a5_58;
					word32 t1_69;
					a5_47();
					a4 = a4_68;
					a2 = a2_73;
					if (a0 != 0x00)
						break;
					Mem317[s2 + a5_58:word32] = 0x00;
					a5_58->dw0045 = a5_58->dw0044;
					ra = bl_tx_notify(ra, a4_68, mstatus, sp_115->t0014, sp_115->t0038, sp_115->t0058, sp_115->t00E4, sp_115->t0100, sp_115->t0104, sp_115->t0128, out s0_25, out s1_26, out a0, out a1, out a2, out a3, out a4, out s3_29, out s4_30, out mstatus);
				}
			}
			++s4_30;
			++s3_29;
		} while (s4_30 != s5_32);
	}
	word32 s4_129;
	word32 a2_121;
	ui32 s1_127;
	word32 s3_128;
	word32 s5_130;
	struct Eq_99705 * a4_123;
	ptr32 a3_122;
	struct Eq_99732 * s0_126 = bl_tx_resend(ra, a0, a1, a2, a3, a4, s2, mstatus, sp_115->t0030, sp_115->t0034, sp_115->t0058, sp_115->t007C, out s1_127, out a2_121, out a3_122, out a4_123, out s3_128, out s4_129, out s5_130);
	if ((s1_127 & 4) != 0x00)
	{
		struct Eq_99887 * a5_135 = (word32) s0_126->b00AC;
		int32 a1_136 = s0_126->dw00B0;
		int32 a0_137 = s0_126->dw00E0;
		s0_126->b00AC = (byte) ((char *) a5_135 + 1);
		struct Eq_99906 * s0_140 = a5_135->ptr0011;
		s0_140->dw00B0 = 0x00;
		word32 t1_157;
		(*((char *) a5_135 + 1))();
	}
	if ((s1_127 & 1) != 0x00)
	{
		do
		{
			word32 s0_171 = a4_123->dw0014;
			word32 t1_201;
			a4_123();
		} while (a0 == 0x00);
	}
	struct Eq_99916 * a5_210 = s1_127 & 16;
	if (a5_210 != null)
	{
		word32 s0_213 = a5_210->dw0018;
		word32 t1_252;
		a5_210();
	}
	Eq_99701 s1_261 = s1_127 & 32;
	if (s1_261 == 0x00)
	{
		0x00 = dwArgA8;
		s1Out = s1_261;
		a0Out = a0;
		a2Out = dwArg48;
		a3Out = a3_122;
		a4Out = a4_123;
		s2Out = s2;
		s4Out = dwArg04;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		<anonymous> * t1_275 = s0_126->ptr001C;
		int32 a0_276 = s0_126->dw00E0;
		0x00 = dwArgA8;
		Eq_2 ra_297;
		Eq_99701 s1_298;
		Eq_2 s2_299;
		ptr32 s4_301;
		Eq_46927 s6_303;
		Eq_2 a0_305;
		struct Eq_99705 * a4_306;
		word32 t1_307;
		ptr32 a2_311;
		ptr32 mstatus_313;
		ptr32 a3_314;
		t1_275();
		s1Out = s1_298;
		a0Out = a0_305;
		a2Out = a2_311;
		a3Out = a3_314;
		a4Out = a4_306;
		s2Out = s2_299;
		s4Out = s4_301;
		s6Out = s6_303;
		mstatusOut = mstatus_313;
		return ra_297;
	}
}

// 230223D4: void ipc_host_enable_irq(Register (ptr32 Eq_99963) a1)
// Called from:
//      bl_main_rtthread_start
//      bl_irq_bottomhalf
void ipc_host_enable_irq(struct Eq_99963 * a1)
{
	a1->dw000C = 0x44800000;
}

// 230223DC: Register int32 ipc_host_disable_irq_e2a()
// Called from:
//      bl_irq_handler
int32 ipc_host_disable_irq_e2a()
{
	*(word32 *) 0x080F = 0x44800000;
	return 0x07FF;
}

