pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230223E8: void bl_main_disconnect(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      stateConnectedIPYesGuard_disconnect
//      stateGlobalGuard_fw_disconnect
void bl_main_disconnect(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	bl_send_sm_disconnect_req(ra, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
}

// 23022404: void bl_main_powersaving(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      stateGlobalGuard_fw_powersaving
void bl_main_powersaving(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	bl_send_mm_powersaving_req(ra, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg30, dwArg34, dwArg40, dwArg44, dwArg58, dwArg68, dwArg7C, dwArg8C, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168);
}

// 23022412: Register Eq_2 bl_main_denoise(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a4Out)
// Called from:
//      stateConnectedIPYes_exit
//      stateGlobalGuard_denoise
Eq_2 bl_main_denoise(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a4Out)
{
	ptr32 a4_18;
	Eq_2 ra_22 = bl_send_mm_denoise_req(ra, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg30, dwArg34, dwArg40, dwArg44, dwArg58, dwArg68, dwArg7C, dwArg8C, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out a4_18);
	a4Out = a4_18;
	return ra_22;
}

// 23022420: void bl_main_monitor(Register Eq_2 ra, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      stateIdleGuard_sniffer
void bl_main_monitor(Eq_2 ra, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	Eq_2 a5_14;
	word32 t1_69;
	word32 a0_70;
	word32 a1_71;
	word32 a2_72;
	bl_send_monitor_enable(memset(ra, fp + -56, 0x00, 40, out t1_69, out a0_70, out a1_71, out a2_72, out a3_12, out a4_13, out a5_14), a3_12, a4_13, a5_14, s3, mstatus, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg28, dwArg4C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
}

// 23022446: Register word32 bl_main_phy_up(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      stateIfaceDownGuard_phyup
word32 bl_main_phy_up(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_15;
	struct Eq_100227 * s0_41 = bl_send_start(ra, a3, a4, a5, s3, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a0_15);
	if (a0_15 == 0x00)
		s0_41->dw100138C = s0_41->dw100038C | 4;
	else
		a0_15 = ~0x00;
	return a0_15;
}

// 2302247A: void bl_main_monitor_channel_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg44, Stack Eq_2 dwArg4C, Stack up32 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      stateSnifferGuard_ChannelSet
void bl_main_monitor_channel_set(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, word32 dwArg44, Eq_2 dwArg4C, up32 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	bl_send_monitor_channel_set(ra, s1, a1, a4, a5, s3, mstatus, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg44, dwArg4C, dwArg64, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
}

// 23022498: Register Eq_2 bl_main_if_remove(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      stateDisconnect_action_idle
//      stateGlobalGuard_stop
//      stateGlobalGuard_disable_autoreconnect
Eq_2 bl_main_if_remove(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_15;
	Eq_2 a3_19;
	Eq_2 a4_20;
	Eq_2 s3_27;
	Eq_2 a3_43;
	ptr32 mstatus_65;
	ptr32 a3_74;
	word32 s1_124;
	word32 a0_125;
	word32 a1_126;
	word32 a2_127;
	word32 a7_128;
	word32 s2_129;
	word32 s4_130;
	word32 s5_131;
	word32 s6_132;
	word32 s7_133;
	word32 s8_134;
	word32 s9_135;
	word32 s10_136;
	word32 s11_137;
	word32 t4_138;
	word32 s1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a4_143;
	word32 a5_144;
	word32 a7_145;
	word32 s2_146;
	word32 s3_147;
	word32 s4_148;
	word32 s5_149;
	word32 s6_150;
	word32 s7_151;
	word32 s8_152;
	word32 s9_153;
	word32 s10_154;
	word32 s11_155;
	word32 t4_156;
	Eq_2 ra_77 = printf(bl_send_remove_if(printf(ra, &g_t2307B358, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_124, out a0_125, out a1_126, out a2_127, out a3_19, out a4_20, out a5_15, out a7_128, out s2_129, out s3_27, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138), a3_19, a4_20, a5_15, s3_27, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a3_43, out mstatus_65), &g_t2307B390, a3_43, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_139, out a0_140, out a1_141, out a2_142, out a3_74, out a4_143, out a5_144, out a7_145, out s2_146, out s3_147, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	a3Out = a3_74;
	mstatusOut = mstatus_65;
	return ra_77;
}

// 230224D2: void bl_main_raw_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      stateSnifferGuard_raw_send
void bl_main_raw_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0138)
{
	bl_send_scanu_raw_send(ra, s0, a0, a3, a4, a5, s2, s3, mstatus, dwArg10, dwArg14, dwArg38, dwArgD8, dwArgF8, dwArg0118, dwArg0128, dwArg0138);
}

// 230224E2: void bl_main_rate_config(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      stateConnectedIPYesGuard_rcconfig
void bl_main_rate_config(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	bl_send_me_rate_config_req(ra, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg58, dwArg68, dwArg7C, dwArg8C, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168);
}

// 230224F2: Register Eq_2 bl_main_set_country_code(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a1Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_set_country_code_internal
Eq_2 bl_main_set_country_code(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a1Out, ptr32 & mstatusOut)
{
	Eq_2 a3_10;
	Eq_2 a4_11;
	Eq_2 a5_12;
	Eq_2 s3_21;
	ptr32 a1_37;
	ptr32 mstatus_61;
	word32 s0_97;
	Eq_2 ra_44 = bl_send_me_chan_config_req(bl_msg_update_channel_cfg(ra, a0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out a3_10, out a4_11, out a5_12, out s3_21), a3_10, a4_11, a5_12, s3_21, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s0_97, out a1_37, out mstatus_61);
	a1Out = a1_37;
	mstatusOut = mstatus_61;
	return ra_44;
}

// 2302250E: Register word32 bl_main_get_channel_nums()
// Called from:
//      wifi_mgmr_set_country_code_internal
word32 bl_main_get_channel_nums()
{
	return bl_msg_get_channel_nums();
}

// 23022512: Register Eq_2 bl_main_if_add(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack ptr32 dwArgB4, Stack Eq_2 dwArgC8, Stack word32 dwArgD0, Stack word32 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_100682 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      stateGlobalGuard_AP
//      stateIdleGuard_connect
Eq_2 bl_main_if_add(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgA8, ptr32 dwArgB4, Eq_2 dwArgC8, word32 dwArgD0, word32 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_100682 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	byte bLoc24_251 = (byte) s4;
	byte bLoc23_253 = SLICE(s4, byte, 8);
	word32 s5_340;
	word32 s6_341;
	Eq_2 a5_34;
	Eq_2 s2_45;
	Eq_2 s3_46;
	Eq_2 a3_67;
	word32 s0_73;
	ptr32 mstatus_90;
	word32 s3_109;
	byte * s4_110;
	word32 s7_342;
	word32 s4_339;
	word32 a7_338;
	word32 a4_337;
	word32 a3_336;
	word32 a2_335;
	word32 a1_334;
	word32 a0_333;
	word32 s1_332;
	word32 s8_343;
	word32 s9_344;
	word32 s10_345;
	word32 s11_346;
	word32 t4_347;
	word32 a0_348;
	word32 a1_349;
	word32 a2_350;
	word32 a7_351;
	word32 s5_352;
	word32 s6_353;
	word32 s7_354;
	word32 s8_355;
	word32 s9_356;
	word32 s10_357;
	word32 s11_358;
	word32 t4_359;
	ptr32 s1_105;
	ptr32 s2_108;
	ptr32 a5_160;
	Eq_100682 a4_102;
	Eq_2 a3_101;
	Eq_2 ra_104 = printf(bl_send_add_if(printf(ra, &g_t2307B2D4, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_332, out a0_333, out a1_334, out a2_335, out a3_336, out a4_337, out a5_34, out a7_338, out s2_45, out s3_46, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out s9_344, out s10_345, out s11_346, out t4_347), 0x4201D000, (word32) s2_45 + 58, 0x00, fp + -36, a5_34, s2_45, s3_46, mstatus, s2, s0, dwArg08, dwArg10, dwArg14, dwArg38, s3, ra, dwArgA8, dwArgB4, dwArgC8, dwArgD0, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, out s0_73, out a3_67, out mstatus_90), &g_t2307B2F8, a3_67, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_105, out a0_348, out a1_349, out a2_350, out a3_101, out a4_102, out a5_160, out a7_351, out s2_108, out s3_109, out s4_110, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
	if (s1_105 == 0x00)
	{
		if ((word32) bLoc24_251 != 0x00)
		{
			word32 t4_331;
			word32 s11_330;
			word32 s10_329;
			word32 s9_328;
			word32 s8_327;
			word32 s7_326;
			word32 s6_325;
			word32 s5_324;
			word32 s4_323;
			word32 s3_322;
			word32 a7_321;
			word32 a2_320;
			word32 s1_317;
			word32 a1_319;
			word32 a0_318;
			ra_104 = printf(ra_104, &g_t2307B31C, a3_101, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_317, out a0_318, out a1_319, out a2_320, out a3_101, out a4_102, out a5_160, out a7_321, out s2_108, out s3_322, out s4_323, out s5_324, out s6_325, out s7_326, out s8_327, out s9_328, out s10_329, out s11_330, out t4_331);
			s1_105 = ~0x04;
		}
		else
		{
			word32 a1_120 = (word32) bLoc23_253;
			if (s3_109 != 0x00)
				g_dw4201F3C8 = a1_120;
			else
				g_dw4201F3CC = a1_120;
			*s4_110 = (byte) a1_120;
			word32 a0_360;
			word32 a1_361;
			word32 a2_362;
			word32 a4_363;
			word32 a5_364;
			word32 a7_365;
			word32 s3_366;
			word32 s4_367;
			word32 s5_368;
			word32 s6_369;
			word32 s7_370;
			word32 s8_371;
			word32 s9_372;
			word32 s10_373;
			word32 s11_374;
			word32 t4_375;
			ra_104 = printf(ra_104, &g_t2307B334, a3_101, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_105, out a0_360, out a1_361, out a2_362, out a3_101, out a4_363, out a5_364, out a7_365, out s2_108, out s3_366, out s4_367, out s5_368, out s6_369, out s7_370, out s8_371, out s9_372, out s10_373, out s11_374, out t4_375);
			struct Eq_100918 * s0_159 = s0_73 + 0x05AC + ((word32) bLoc23_253 + 0x00C4);
			s0_159->ptr0368 = s2_108;
			s0_159->b03CF = 0x01;
			a4_102.u0 = 0x00C4;
			a5_160 = 0x01;
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	a0Out = s1_105;
	a3Out = a3_101;
	a4Out = a4_102;
	a5Out = a5_160;
	s2Out = s2_108;
	mstatusOut = mstatus_90;
	return ra_104;
}

// 230225E6: Register Eq_2 bl_main_apm_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      stateGlobalGuard_AP
Eq_2 bl_main_apm_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a3_30;
	Eq_2 s4_53;
	Eq_2 a3_74;
	struct Eq_100955 * s0_80;
	ptr32 mstatus_99;
	Eq_2 a3_108;
	Eq_2 a3_133;
	Eq_2 a3_158;
	Eq_2 a3_183;
	ptr32 a3_208;
	ptr32 a4_209;
	ptr32 s1_212;
	word32 t1_271;
	word32 a0_272;
	word32 a1_273;
	word32 a2_274;
	word32 a4_275;
	word32 a5_276;
	word32 s1_277;
	word32 a0_278;
	word32 a1_279;
	word32 a2_280;
	word32 a3_281;
	word32 a4_282;
	word32 a5_283;
	word32 a7_284;
	word32 s2_285;
	word32 s3_286;
	word32 s5_287;
	word32 s6_288;
	word32 s7_289;
	word32 s8_290;
	word32 s9_291;
	word32 s10_292;
	word32 s11_293;
	word32 t4_294;
	word32 s1_295;
	word32 a0_296;
	word32 a1_297;
	word32 a2_298;
	word32 a4_299;
	word32 a5_300;
	word32 a7_301;
	word32 s2_302;
	word32 s3_303;
	word32 s4_304;
	word32 s5_305;
	word32 s6_306;
	word32 s7_307;
	word32 s8_308;
	word32 s9_309;
	word32 s10_310;
	word32 s11_311;
	word32 t4_312;
	word32 s1_313;
	word32 a0_314;
	word32 a1_315;
	word32 a2_316;
	word32 a4_317;
	word32 a5_318;
	word32 a7_319;
	word32 s2_320;
	word32 s3_321;
	word32 s4_322;
	word32 s5_323;
	word32 s6_324;
	word32 s7_325;
	word32 s8_326;
	word32 s9_327;
	word32 s10_328;
	word32 s11_329;
	word32 t4_330;
	word32 s1_331;
	word32 a0_332;
	word32 a1_333;
	word32 a2_334;
	word32 a4_335;
	word32 a5_336;
	word32 a7_337;
	word32 s2_338;
	word32 s3_339;
	word32 s4_340;
	word32 s5_341;
	word32 s6_342;
	word32 s7_343;
	word32 s8_344;
	word32 s9_345;
	word32 s10_346;
	word32 s11_347;
	word32 t4_348;
	word32 s1_349;
	word32 a0_350;
	word32 a1_351;
	word32 a2_352;
	word32 a4_353;
	word32 a5_354;
	word32 a7_355;
	word32 s2_356;
	word32 s3_357;
	word32 s4_358;
	word32 s5_359;
	word32 s6_360;
	word32 s7_361;
	word32 s8_362;
	word32 s9_363;
	word32 s10_364;
	word32 s11_365;
	word32 t4_366;
	word32 a0_367;
	word32 a1_368;
	word32 a2_369;
	word32 a5_370;
	word32 a7_371;
	word32 s2_372;
	word32 s3_373;
	word32 s4_374;
	word32 s5_375;
	word32 s6_376;
	word32 s7_377;
	word32 s8_378;
	word32 s9_379;
	word32 s10_380;
	word32 s11_381;
	word32 t4_382;
	Eq_2 ra_211 = printf(printf(printf(printf(printf(bl_send_apm_start_req(printf(memset(ra, fp + -36, 0x00, 0x04, out t1_271, out a0_272, out a1_273, out a2_274, out a3_30, out a4_275, out a5_276), &g_t2307B1D4, a3_30, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_277, out a0_278, out a1_279, out a2_280, out a3_281, out a4_282, out a5_283, out a7_284, out s2_285, out s3_286, out s4_53, out s5_287, out s6_288, out s7_289, out s8_290, out s9_291, out s10_292, out s11_293, out t4_294), 1107416492, s4_53, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, dwArg64, dwArg88, dwArgA8, dwArgC8, dwArgE8, out s0_80, out a3_74, out mstatus_99), &g_t2307B204, a3_74, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_295, out a0_296, out a1_297, out a2_298, out a3_108, out a4_299, out a5_300, out a7_301, out s2_302, out s3_303, out s4_304, out s5_305, out s6_306, out s7_307, out s8_308, out s9_309, out s10_310, out s11_311, out t4_312), &g_t2307B220, a3_108, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_313, out a0_314, out a1_315, out a2_316, out a3_133, out a4_317, out a5_318, out a7_319, out s2_320, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325, out s8_326, out s9_327, out s10_328, out s11_329, out t4_330), &g_t2307B238, a3_133, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_331, out a0_332, out a1_333, out a2_334, out a3_158, out a4_335, out a5_336, out a7_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_345, out s10_346, out s11_347, out t4_348), &g_t2307B250, a3_158, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_349, out a0_350, out a1_351, out a2_352, out a3_183, out a4_353, out a5_354, out a7_355, out s2_356, out s3_357, out s4_358, out s5_359, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365, out t4_366), &g_t2307B268, a3_183, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_212, out a0_367, out a1_368, out a2_369, out a3_208, out a4_209, out a5_370, out a7_371, out s2_372, out s3_373, out s4_374, out s5_375, out s6_376, out s7_377, out s8_378, out s9_379, out s10_380, out s11_381, out t4_382);
	s0_80->dw10013D4 = (word32) SLICE(s0, byte, 24);
	s1Out = s1_212;
	a0Out = s1_212;
	a3Out = a3_208;
	a4Out = a4_209;
	mstatusOut = mstatus_99;
	return ra_211;
}

