pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302269C: Register Eq_2 bl_main_apm_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      stateGlobalGuard_stop
Eq_2 bl_main_apm_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_15;
	Eq_2 a3_19;
	Eq_2 a4_20;
	Eq_2 s3_27;
	Eq_2 a3_43;
	ptr32 mstatus_65;
	ptr32 a3_75;
	word32 s1_126;
	word32 a0_127;
	word32 a1_128;
	word32 a2_129;
	word32 a7_130;
	word32 s2_131;
	word32 s4_132;
	word32 s5_133;
	word32 s6_134;
	word32 s7_135;
	word32 s8_136;
	word32 s9_137;
	word32 s10_138;
	word32 s11_139;
	word32 t4_140;
	word32 s1_141;
	word32 a0_142;
	word32 a1_143;
	word32 a2_144;
	word32 a4_145;
	word32 a5_146;
	word32 a7_147;
	word32 s2_148;
	word32 s3_149;
	word32 s4_150;
	word32 s5_151;
	word32 s6_152;
	word32 s7_153;
	word32 s8_154;
	word32 s9_155;
	word32 s10_156;
	word32 s11_157;
	word32 t4_158;
	Eq_2 ra_78 = printf(bl_send_apm_stop_req(printf(ra, &g_t2307B280, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_126, out a0_127, out a1_128, out a2_129, out a3_19, out a4_20, out a5_15, out a7_130, out s2_131, out s3_27, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136, out s9_137, out s10_138, out s11_139, out t4_140), a3_19, a4_20, a5_15, s3_27, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a3_43, out mstatus_65), &g_t2307B2B0, a3_43, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_141, out a0_142, out a1_143, out a2_144, out a3_75, out a4_145, out a5_146, out a7_147, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_156, out s11_157, out t4_158);
	a3Out = a3_75;
	mstatusOut = mstatus_65;
	return ra_78;
}

// 230226D8: void bl_main_apm_sta_cnt_get(Register (ptr32 byte) a0)
// Called from:
//      wifi_mgmr_ap_sta_cnt_get_internal
void bl_main_apm_sta_cnt_get(byte * a0)
{
	*a0 = 0x0C;
}

// 230226E2: void bl_main_apm_sta_info_get(Register (ptr32 Eq_101409) a0, Register Eq_2 a1)
// Called from:
//      wifi_mgmr_ap_sta_info_get_internal
void bl_main_apm_sta_info_get(struct Eq_101409 * a0, Eq_2 a1)
{
	if ((word32) *((word32) a1 + 1124192864) == 0x00)
		return;
	a0->b0000 = (byte) (word32) *((word32) a1 + 1124192865);
	a0->b1001 = (byte) (word32) *((word32) a1 + 1124192864);
	a0->dw0010 = (int32) *((word32) a1 + 1124192868);
	a0->dw000C = (int32) *((word32) a1 + 1124192872);
	a0->dw0008 = (int32) *((word32) a1 + 1124192876);
	a0->b0014 = (byte) (word32) *((word32) a1 + 1124192880);
	word32 a1_76;
	word32 a2_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 a6_81;
	word32 a7_82;
	memcpy(&a0->b0000 + 2, (word32) a1 + 1124192856, 0x06, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80, out a6_81, out a7_82);
}

// 2302274E: Register Eq_2 bl_main_apm_sta_delete(Register Eq_2 ra, Register (ptr32 Eq_101482) s0, Register Eq_2 s1, Register (ptr32 Eq_101482) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_101499 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_remove_all_sta
//      wifi_mgmr_ap_sta_delete_internal
Eq_2 bl_main_apm_sta_delete(Eq_2 ra, struct Eq_101482 * s0, Eq_2 s1, struct Eq_101482 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_101499 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	word32 a3_198;
	word32 a4_199;
	word32 a2_197;
	word32 a1_196;
	word32 a0_195;
	word32 t1_194;
	word32 a5_200;
	Eq_2 ra_39 = memset(ra, fp + -36, 0x00, 0x03, out t1_194, out a0_195, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200);
	Eq_2 a3_42 = (word32) a0->b4301D262;
	Eq_2 a5_49;
	Eq_2 a3_53;
	Eq_2 a4_54;
	Eq_2 s1_57;
	Eq_2 s3_61;
	Eq_2 s0_84;
	ptr32 s1_85;
	ptr32 s2_88;
	ptr32 s3_89;
	ptr32 mstatus_101;
	word32 a0_201;
	word32 a1_202;
	word32 a2_203;
	word32 a7_204;
	word32 s2_205;
	word32 s4_206;
	word32 s5_207;
	word32 s6_208;
	word32 s7_209;
	word32 s8_210;
	word32 s9_211;
	word32 s10_212;
	word32 s11_213;
	word32 t4_214;
	Eq_2 ra_113 = bl_send_apm_sta_del_req(printf(ra_39, &g_t2307B1A0, a3_42, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_57, out a0_201, out a1_202, out a2_203, out a3_53, out a4_54, out a5_49, out a7_204, out s2_205, out s3_61, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213, out t4_214), s1_57, a3_53, a4_54, a5_49, s3_61, mstatus, dwLoc30, s4, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, a3_42, dwArg4C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_84, out s1_85, out s2_88, out s3_89, out mstatus_101);
	if ((word32) (byte) s0 == 0x00)
	{
		word32 t1_215;
		word32 a0_216;
		word32 a1_217;
		word32 a2_218;
		word32 a3_219;
		word32 a4_220;
		word32 a5_221;
		ra_113 = memset(ra_113, s0_84, 0x00, 0x1C, out t1_215, out a0_216, out a1_217, out a2_218, out a3_219, out a4_220, out a5_221);
	}
	s0Out = dwArg0158;
	s1Out = s1_85;
	s2Out = s2_88;
	s3Out = s3_89;
	s4Out = dwArgF4;
	mstatusOut = mstatus_101;
	return ra_113;
}

// 230227D0: Register ui32 bl_main_apm_remove_all_sta(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
// Called from:
//      stateGlobalGuard_stop
ui32 bl_main_apm_remove_all_sta(Eq_2 ra, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg5C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	Eq_2 s1_15 = 0x4201E244;
	struct Eq_101482 * s0_16 = null;
	word32 s3_17 = 0x01;
	ui32 s2_18 = 0x0C;
	do
	{
		if ((word32) *s1_15 == s3_17)
			ra = bl_main_apm_sta_delete(ra, s0_16, s1_15, s0_16, s4, mstatus, dwLoc20, dwLoc1C, s2, dwArg10, dwArg14, dwArg2C, dwArg5C, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_16, out s1_15, out s2_18, out s3_17, out s4, out mstatus);
		ui32 s0_57 = (char *) s0_16 + 1;
		s0_16 = s0_57 & 0x00FF;
		s1_15 = (word32) s1_15 + 28;
	} while ((s0_57 & 0x00FF) != s2_18);
	return s0_57 & 0x00FF;
}

// 23022814: void bl_main_conf_max_sta(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      stateGlobalGuard_conf_max_sta
void bl_main_conf_max_sta(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	bl_send_apm_conf_max_sta_req(ra, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg58, dwArg68, dwArg7C, dwArg8C, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168);
}

// 23022822: void bl_main_cfg_task_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      stateGlobal_cfg_req
void bl_main_cfg_task_req(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	bl_send_cfg_task_req(ra, s0, a1, a2, a3, a4, s2, s3, mstatus, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgB4, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168);
}

// 2302283A: Register word32 bl_main_scan(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateConnectedIPYes_enter
word32 bl_main_scan(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	return bl_send_scanu_req(ra, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
}

