pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23022D2C: Register Eq_2 bl_msg_zalloc.constprop.3(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_103286 a5Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      bl_main_powersaving
//      bl_main_denoise
//      bl_main_raw_send
//      bl_main_rate_config
//      bl_main_conf_max_sta
//      bl_main_cfg_task_req
//      bl_send_reset
//      bl_send_monitor_enable
//      bl_send_monitor_channel_set
//      bl_send_version_req
//      bl_send_me_config_req
//      bl_send_me_chan_config_req
//      bl_send_start
//      bl_send_add_if
//      bl_send_remove_if
//      bl_send_scanu_req
//      bl_send_sm_connect_req
//      bl_send_sm_disconnect_req
//      bl_send_apm_start_req
//      bl_send_apm_stop_req
//      bl_send_apm_sta_del_req
Eq_2 bl_msg_zalloc.constprop.3(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_103286 & a5Out, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	Eq_2 ra_128;
	ptr32 a1_121;
	ptr32 a3_122;
	ptr32 a4_123;
	Eq_103286 a5_124;
	Eq_2 a0_27;
	Eq_2 a3_30;
	ptr32 a6_33;
	word32 a1_163;
	word32 a2_164;
	word32 a4_165;
	word32 a5_166;
	word32 s8_167;
	ptr32 s1_129;
	ptr32 s2_134;
	ptr32 s3_135;
	ptr32 s4_136;
	pvPortMalloc(ra, a2, (word32) a2 + 8, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_129, out a0_27, out a1_163, out a2_164, out a3_30, out a4_165, out a5_166, out a6_33, out s2_134, out s3_135, out s4_136, out s8_167);
	Eq_2 s0_42 = a0_27;
	if (a0_27 == 0x00)
	{
		word32 a0_172;
		word32 a2_173;
		word32 a7_174;
		word32 s5_175;
		word32 s7_176;
		word32 s8_177;
		word32 s9_178;
		word32 s10_179;
		word32 s11_180;
		word32 t4_181;
		ra_128 = printf(ra, &g_t2307C03C, a3_30, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_129, out a0_172, out a1_121, out a2_173, out a3_122, out a4_123, out a5_124, out a7_174, out s2_134, out s3_135, out s4_136, out s5_175, out s6, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out t4_181);
	}
	else
	{
		word32 t1_168;
		word32 a0_169;
		word32 a2_170;
		word32 a5_171;
		ra_128 = memset(ra, a0_27, 0x00, (word32) a2 + 8, out t1_168, out a0_169, out a1_121, out a2_170, out a3_122, out a4_123, out a5_171);
		*a0_27 = (word16) s3_135;
		*((word32) a0_27 + 2) = (word16) s2_134;
		*((word32) a0_27 + 4) = 100;
		*((word32) a0_27 + 6) = (word16) s1_129;
		a5_124.u0 = 100;
		s0_42 = (word32) a0_27 + 8;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_129;
	a0Out = s0_42;
	a1Out = a1_121;
	a3Out = a3_122;
	a4Out = a4_123;
	a5Out = a5_124;
	a6Out = a6_33;
	s2Out = s2_134;
	s3Out = s3_135;
	s4Out = s4_136;
	s6Out = s6;
	return ra_128;
}

// 23022D90: Register Eq_2 bl_msg_update_channel_cfg(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      bl_main_set_country_code
//      bl606a0_wifi_init
Eq_2 bl_msg_update_channel_cfg(Eq_2 ra, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	struct Eq_103399 * s3_19 = g_a2307C148;
	word32 s1_20;
	for (s1_20 = 0x00; s1_20 != 0x04; ++s1_20)
	{
		struct Eq_274 * a0_51;
		word32 a2_30;
		Eq_2 a3_31;
		word32 a4_158;
		word32 a5_159;
		word32 a1_157;
		if (strcmp(s3_19->dw0000, a0, out a1_157, out a2_30, out a3_31, out a4_158, out a5_159) == 0x00)
		{
			g_dw4200ED6C = a2_30;
			g_dw4200ED70 = 0x4200E000;
			a0_51 = (struct Eq_274 *) &g_t2307BFD0;
			goto l23022DE2;
		}
		++s3_19;
	}
	g_dw4200ED6C = 0x0E;
	g_dw4200ED70 = 0x2307BABC;
	a0_51 = (struct Eq_274 *) &g_t2307C000;
l23022DE2:
	ptr32 a5_78;
	ptr32 a3_82;
	ptr32 a4_83;
	ptr32 s3_90;
	word32 t4_156;
	word32 s10_154;
	word32 s11_155;
	word32 s8_152;
	word32 s9_153;
	word32 s6_150;
	word32 s7_151;
	word32 s4_148;
	word32 s5_149;
	word32 a7_146;
	word32 s2_147;
	word32 a1_144;
	word32 a2_145;
	word32 s1_142;
	word32 a0_143;
	Eq_2 ra_85 = printf(ra, a0_51, a3_31, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_142, out a0_143, out a1_144, out a2_145, out a3_82, out a4_83, out a5_78, out a7_146, out s2_147, out s3_90, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	a3Out = a3_82;
	a4Out = a4_83;
	a5Out = a5_78;
	s3Out = s3_90;
	return ra_85;
}

// 23022E24: Register int32 bl_msg_get_channel_nums()
// Called from:
//      bl_main_get_channel_nums
int32 bl_msg_get_channel_nums()
{
	return g_dw4200DD6C;
}

// 23022E2E: Register Eq_2 bl_send_reset(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_reset(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a0_18;
	ptr32 a3_21;
	ptr32 a4_22;
	ptr32 a5_23;
	Eq_2 s0_26;
	Eq_2 s3_29;
	Eq_2 s6_40;
	word32 s1_139;
	word32 a1_140;
	word32 a6_141;
	word32 s2_142;
	word32 s4_143;
	Eq_2 ra_25 = bl_msg_zalloc.constprop.3(ra, 0x00, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_26, out s1_139, out a0_18, out a1_140, out a3_21, out a4_22, out a5_23, out a6_141, out s2_142, out s3_29, out s4_143, out s6_40);
	if (a0_18 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x0B;
		a2Out = dwArg10;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		mstatusOut = mstatus;
		return ra_25;
	}
	else
	{
		Eq_2 a2_57;
		ptr32 a3_58;
		ptr32 a4_59;
		ptr32 a5_60;
		ptr32 mstatus_63;
		ptr32 s0_65;
		ptr32 a0_82;
		word32 s1_144;
		word32 a1_145;
		word32 s2_146;
		word32 s3_147;
		Eq_2 ra_64 = bl_send_msg(ra_25, s0_26, a0_18, 0x01, s3_29, s6_40, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_65, out s1_144, out a0_82, out a1_145, out a2_57, out a3_58, out a4_59, out a5_60, out s2_146, out s3_147, out mstatus_63);
		s0Out = s0_65;
		a0Out = a0_82;
		a2Out = a2_57;
		a3Out = a3_58;
		a4Out = a4_59;
		a5Out = a5_60;
		mstatusOut = mstatus_63;
		return ra_64;
	}
}

// 23022E60: void bl_send_monitor_enable(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_monitor
void bl_send_monitor_enable(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_20;
	Eq_2 s0_28;
	Eq_2 s3_31;
	Eq_2 s6_42;
	word32 s1_137;
	word32 a1_138;
	word32 a3_139;
	word32 a4_140;
	word32 a5_141;
	word32 a6_142;
	word32 s2_143;
	word32 s4_144;
	Eq_2 ra_27 = bl_msg_zalloc.constprop.3(ra, 0x04, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_28, out s1_137, out a0_20, out a1_138, out a3_139, out a4_140, out a5_141, out a6_142, out s2_143, out s3_31, out s4_144, out s6_42);
	if (a0_20 == 0x00)
		return;
	*(union Eq_2 *) 0x01 = a0_20;
	word32 s0_145;
	word32 s1_146;
	word32 a0_147;
	word32 a1_148;
	word32 a2_149;
	word32 a3_150;
	word32 a4_151;
	word32 a5_152;
	word32 s2_153;
	word32 s3_154;
	word32 mstatus_155;
	bl_send_msg(ra_27, s0_28, a0_20, 93, s3_31, s6_42, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_145, out s1_146, out a0_147, out a1_148, out a2_149, out a3_150, out a4_151, out a5_152, out s2_153, out s3_154, out mstatus_155);
}

// 23022E9C: void bl_send_monitor_channel_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack word32 dwArg84, Stack Eq_2 dwArg8C, Stack up32 dwArgA4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_monitor_channel_set
void bl_send_monitor_channel_set(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, word32 dwArg84, Eq_2 dwArg8C, up32 dwArgA4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_25;
	word32 a3_28;
	up32 s0_33;
	Eq_2 s1_34;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 s4_232;
	word32 a5_229;
	word32 a6_230;
	word32 s2_231;
	word32 a1_227;
	word32 a4_228;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x0C, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_33, out s1_34, out a0_25, out a1_227, out a3_28, out a4_228, out a5_229, out a6_230, out s2_231, out s3_36, out s4_232, out s6_47);
	if (a0_25 == 0x00)
		return;
	union Eq_2 * s0_61;
	if (dwArgA4 >= s0_33 + -1)
	{
		if (dwArg84 != 0x0E)
			s0_61 = (word32) (word16) (dwArg84 + 0x00FFF96C);
		else
			s0_61 = (union Eq_2 *) 0x00FFF9B4;
	}
	else
		s0_61 = (union Eq_2 *) 0x0FFFFFFF;
	*s0_61 = (union Eq_2 *) a0_25;
	if (a3_28 != 0x00)
	{
		*(union Eq_2 *) 0x05 = a0_25;
		if (a3_28 != 0x01)
		{
			*(union Eq_2 *) 0x09 = a0_25;
			goto l23022F04;
		}
	}
	else
		*((word32) a0_25 + 4) = 0x00;
	*((word32) a0_25 + 8) = 0x00;
l23022F04:
	word32 s0_233;
	word32 a2_237;
	word32 a0_235;
	word32 a1_236;
	word32 s1_234;
	word32 a3_238;
	word32 a4_239;
	word32 a5_240;
	word32 s2_241;
	word32 s3_242;
	word32 mstatus_243;
	bl_send_msg(ra_32, s1_34, a0_25, 95, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, s1, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_233, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out s2_241, out s3_242, out mstatus_243);
}

// 23022F2A: Register Eq_2 bl_send_version_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_version_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & mstatusOut)
{
	Eq_2 a0_20;
	Eq_2 s0_28;
	Eq_2 s3_31;
	Eq_2 s6_42;
	word32 s1_138;
	word32 a1_139;
	word32 a3_140;
	word32 a4_141;
	word32 a5_142;
	word32 a6_143;
	word32 s2_144;
	word32 s4_145;
	Eq_2 ra_27 = bl_msg_zalloc.constprop.3(ra, 0x00, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_28, out s1_138, out a0_20, out a1_139, out a3_140, out a4_141, out a5_142, out a6_143, out s2_144, out s3_31, out s4_145, out s6_42);
	if (a0_20 == 0x00)
	{
		s0Out = s0_28;
		a0Out = ~0x0B;
		mstatusOut = mstatus;
		return ra_27;
	}
	else
	{
		ptr32 mstatus_65;
		Eq_2 s0_67;
		ptr32 a0_84;
		word32 s1_146;
		word32 a1_147;
		word32 a2_148;
		word32 a3_149;
		word32 a4_150;
		word32 a5_151;
		word32 s2_152;
		word32 s3_153;
		Eq_2 ra_66 = bl_send_msg(ra_27, s0_28, a0_20, 0x05, s3_31, s6_42, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_67, out s1_146, out a0_84, out a1_147, out a2_148, out a3_149, out a4_150, out a5_151, out s2_152, out s3_153, out mstatus_65);
		s0Out = s0_67;
		a0Out = a0_84;
		mstatusOut = mstatus_65;
		return ra_66;
	}
}

// 23022F5E: Register Eq_2 bl_send_me_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_me_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_23;
	Eq_2 a3_26;
	ptr32 a4_27;
	ptr32 a5_28;
	ptr32 s3_34;
	word32 s0_232;
	word32 s1_233;
	word32 a1_234;
	word32 a6_235;
	word32 s2_236;
	word32 s4_237;
	word32 s6_238;
	Eq_2 ra_30 = bl_msg_zalloc.constprop.3(ra, 52, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_232, out s1_233, out a0_23, out a1_234, out a3_26, out a4_27, out a5_28, out a6_235, out s2_236, out s3_34, out s4_237, out s6_238);
	if (a0_23 == 0x00)
	{
		0x00 = (uint16) dwArg38;
		a3Out = a3_26;
		a4Out = a4_27;
		a5Out = a5_28;
		s3Out = s3_34;
		mstatusOut = mstatus;
		return ra_30;
	}
	else
	{
		word32 s1_68;
		Eq_2 s2_71;
		Eq_2 s3_72;
		Eq_2 s6_75;
		word32 a0_239;
		word32 a1_240;
		word32 a2_241;
		word32 a3_242;
		word32 a4_243;
		word32 a5_244;
		word32 a7_245;
		word32 s4_246;
		word32 s5_247;
		word32 s7_248;
		word32 s8_249;
		word32 s9_250;
		word32 s10_251;
		word32 s11_252;
		word32 t4_253;
		Eq_2 ra_67 = printf(ra_30, &g_t2307C098, a3_26, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_68, out a0_239, out a1_240, out a2_241, out a3_242, out a4_243, out a5_244, out a7_245, out s2_71, out s3_72, out s4_246, out s5_247, out s6_75, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253);
		((word32) a0_23 + 46)->u0 = 0x01;
		struct Eq_103836 * a4_82 = (word32) s2_71 + s1_68;
		*a0_23 = (word16) (word32) a4_82->wFFFFFE04;
		*((word32) a0_23 + 2) = (byte) ((word32) a4_82->bFFFFFE08 << 2 | (word32) a4_82->bFFFFFE07);
		byte * a5_102;
		struct Eq_103865 * a4_100 = (word32) a0_23 + 3;
		byte * s1_95 = (word32) s2_71 + (s1_68 + -486);
		for (a5_102 = (word32) s2_71 + (s1_68 + -502); a5_102 != s1_95; ++a5_102)
		{
			++a4_100;
			a4_100[0x0FFF] = (struct Eq_103865) (byte) (word32) *a5_102;
		}
		*((word32) a0_23 + 20) = 0x00;
		*((word32) a0_23 + 24) = 0x00;
		((word32) a0_23 + 28)->u1 = 0x00;
		*((word32) a0_23 + 48) = (byte) (word32) *((word32) *((word32) s2_71 + 0x00FFFDFC) + 56);
		*((word32) a0_23 + 44) = *((word32) *((word32) s2_71 + 0x00FFFDFC) + 60);
		0x00 = (uint16) dwArg38;
		Eq_2 a3_132;
		ptr32 a4_133;
		ptr32 a5_134;
		ptr32 mstatus_137;
		ptr32 s3_144;
		word32 s0_254;
		word32 s1_255;
		word32 a0_256;
		word32 a1_257;
		word32 a2_258;
		word32 s2_259;
		Eq_2 ra_138 = bl_send_msg(ra_67, s2_71, a0_23, 0x01000401, s3_72, s6_75, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_254, out s1_255, out a0_256, out a1_257, out a2_258, out a3_132, out a4_133, out a5_134, out s2_259, out s3_144, out mstatus_137);
		a3Out = a3_132;
		a4Out = a4_133;
		a5Out = a5_134;
		s3Out = s3_144;
		mstatusOut = mstatus_137;
		return ra_138;
	}
}

// 23023022: Register Eq_2 bl_send_me_chan_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_100619) s0Out, Register out ptr32 a1Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_set_country_code
//      bl_main_rtthread_start
Eq_2 bl_send_me_chan_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, struct Eq_100619 & s0Out, ptr32 & a1Out, ptr32 & mstatusOut)
{
	Eq_2 a0_19;
	ptr32 a1_20;
	Eq_2 s0_27;
	Eq_2 s3_30;
	Eq_2 s6_41;
	word32 s1_258;
	word32 a3_259;
	word32 a4_260;
	word32 a5_261;
	word32 a6_262;
	word32 s2_263;
	word32 s4_264;
	Eq_2 ra_26 = bl_msg_zalloc.constprop.3(ra, 0x00FE, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_27, out s1_258, out a0_19, out a1_20, out a3_259, out a4_260, out a5_261, out a6_262, out s2_263, out s3_30, out s4_264, out s6_41);
	if (a0_19 == 0x00)
	{
		s0Out = s0;
		a1Out = a1_20;
		mstatusOut = mstatus;
		return ra_26;
	}
	else
	{
		((word32) a0_19 + 252)->u1 = 0x00;
		int32 a2_106;
		for (a2_106 = 0x34; a2_106 < g_dw4200DD6C; ++a2_106)
		{
			word32 a4_63 = (word32) *((word32) a0_19 + 252);
			struct Eq_103990 * a5_70 = (word32) a0_19 + (a4_63 + 0x06);
			a5_70->b0003 = 0x00;
			int32 a0_65 = a2_106 + 0;
			if (((word32) g_t4200DD70 + a0_65 + 8 & 0x01) != 0x00)
				a5_70->b0003 = 0x02;
			ui32 t0_82 = (word32) a5_70->b0003;
			ui32 a3_85 = (word32) g_t4200DD70 + a0_65 + 8;
			a5_70->b0002 = 0x00;
			a5_70->b0003 = (byte) ((word32) ((a3_85 & 0x0A) != 0x00) | t0_82);
			a5_70->w0000 = (word16) (word32) ((word32) g_t4200DD70 + a0_65 + 2);
			a5_70->t0004 = g_t4200DD70;
			ui32 a5_100 = a4_63 + 1 & 0x00FF;
			*((word32) a0_19 + 252) = (byte) a5_100;
			if (a5_100 == 0x0E)
				break;
		}
		((word32) a0_19 + 0x00FD)->u1 = 0x00;
		ptr32 a1_135;
		ptr32 mstatus_142;
		struct Eq_100619 * s0_144;
		word32 s1_265;
		word32 a0_266;
		word32 a2_267;
		word32 a3_268;
		word32 a4_269;
		word32 a5_270;
		word32 s2_271;
		word32 s3_272;
		Eq_2 ra_143 = bl_send_msg(ra_26, s0_27, a0_19, 0x01000403, s3_30, s6_41, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_144, out s1_265, out a0_266, out a1_135, out a2_267, out a3_268, out a4_269, out a5_270, out s2_271, out s3_272, out mstatus_142);
		s0Out = s0_144;
		a1Out = a1_135;
		mstatusOut = mstatus_142;
		return ra_143;
	}
}

