pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230230F4: void bl_send_me_rate_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_rate_config
void bl_send_me_rate_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_27;
	Eq_2 s0_35;
	word32 s1_36;
	word32 s2_37;
	Eq_2 s3_38;
	Eq_2 s6_49;
	word32 a1_148;
	word32 a3_149;
	word32 a4_150;
	word32 a5_151;
	word32 a6_152;
	word32 s4_153;
	Eq_2 ra_34 = bl_msg_zalloc.constprop.3(ra, 0x04, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_35, out s1_36, out a0_27, out a1_148, out a3_149, out a4_150, out a5_151, out a6_152, out s2_37, out s3_38, out s4_153, out s6_49);
	if (a0_27 == 0x00)
		0x00 = dwArg38;
	else
	{
		a0_27->u1 = (byte) s2_37;
		*((word32) a0_27 + 2) = (word16) s1_36;
		0x00 = dwArg38;
		word32 s0_154;
		word32 s1_155;
		word32 a0_156;
		word32 a1_157;
		word32 a2_158;
		word32 a3_159;
		word32 a4_160;
		word32 a5_161;
		word32 s2_162;
		word32 s3_163;
		word32 mstatus_164;
		bl_send_msg(ra_34, s0_35, a0_27, 0x00, s3_38, s6_49, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_154, out s1_155, out a0_156, out a1_157, out a2_158, out a3_159, out a4_160, out a5_161, out s2_162, out s3_163, out mstatus_164);
	}
}

// 23023142: Register word32 bl_send_start(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out)
// Called from:
//      bl_main_phy_up
word32 bl_send_start(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out)
{
	Eq_2 a0_22;
	Eq_2 s1_31;
	Eq_2 s3_33;
	Eq_2 s6_44;
	word32 s0_172;
	word32 a1_173;
	word32 a3_174;
	word32 a4_175;
	word32 a5_176;
	word32 a6_177;
	word32 s2_178;
	word32 s4_179;
	Eq_2 ra_29 = bl_msg_zalloc.constprop.3(ra, 72, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_172, out s1_31, out a0_22, out a1_173, out a3_174, out a4_175, out a5_176, out a6_177, out s2_178, out s3_33, out s4_179, out s6_44);
	if (a0_22 == 0x00)
	{
		0x00 = (uint16) dwArg38;
		a0Out = ~0x0B;
		return s0;
	}
	else
	{
		*((word32) s1_31 + 0x01000E2C) = 0x01;
		word32 a1_180;
		word32 a2_181;
		word32 a3_182;
		word32 a4_183;
		word32 a5_184;
		word32 a6_185;
		word32 a7_186;
		memcpy(a0_22, (word32) s1_31 + 0x00FFFE2C, 64, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184, out a6_185, out a7_186);
		*((word32) *((word32) *((word32) s1_31 + 0x00FFFDFC) + 16) + 64) = a0_22;
		*((word32) a0_22 + 0x0044) = *((word32) *((word32) s1_31 + 0x00FFFDFC) + 52);
		0x00 = (uint16) dwArg38;
		word32 s0_97;
		ptr32 a0_114;
		word32 s1_187;
		word32 a1_188;
		word32 a2_189;
		word32 a3_190;
		word32 a4_191;
		word32 a5_192;
		word32 s2_193;
		word32 s3_194;
		word32 mstatus_195;
		bl_send_msg(ra_29, s1_31, a0_22, 0x03, s3_33, s6_44, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_97, out s1_187, out a0_114, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out s2_193, out s3_194, out mstatus_195);
		a0Out = a0_114;
		return s0_97;
	}
}

// 230231B0: Register Eq_2 bl_send_add_if(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArgD8, Stack ptr32 dwArgE4, Stack Eq_2 dwArgF8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_if_add
Eq_2 bl_send_add_if(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArgD8, ptr32 dwArgE4, Eq_2 dwArgF8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_28;
	ptr32 a3_31;
	word32 s1_37;
	Eq_2 s2_38;
	Eq_2 s3_39;
	Eq_2 s6_50;
	word32 s0_211;
	word32 a1_212;
	word32 a4_213;
	word32 a5_214;
	word32 a6_215;
	word32 s4_216;
	Eq_2 ra_35 = bl_msg_zalloc.constprop.3(ra, 0x08, a3, a4, a5, a1, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, out s0_211, out s1_37, out a0_28, out a1_212, out a3_31, out a4_213, out a5_214, out a6_215, out s2_38, out s3_39, out s4_216, out s6_50);
	if (a0_28 == 0x00)
	{
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		a3Out = a3_31;
		mstatusOut = mstatus;
		return ra_35;
	}
	else
	{
		word32 a4_64;
		word32 a1_67;
		word32 a3_69;
		word32 a2_217;
		word32 a5_218;
		word32 a6_219;
		word32 a7_220;
		memcpy((word32) a0_28 + 1, s3_39, 0x06, out a1_67, out a2_217, out a3_69, out a4_64, out a5_218, out a6_219, out a7_220);
		if (dwArg94 > 0x08)
		{
			a0_28->u1 = 0x00;
			0x00 = (uint16) dwArg0128;
			ptr32 a3_92;
			ptr32 mstatus_97;
			ptr32 s0_99;
			word32 s1_221;
			word32 a0_222;
			word32 a1_223;
			word32 a2_224;
			word32 a4_225;
			word32 a5_226;
			word32 s2_227;
			word32 s3_228;
			Eq_2 ra_98 = bl_send_msg(ra_35, s2_38, a0_28, 0x07, s3_39, s6_50, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_99, out s1_221, out a0_222, out a1_223, out a2_224, out a3_92, out a4_225, out a5_226, out s2_227, out s3_228, out mstatus_97);
			s0Out = s0_99;
			a3Out = a3_92;
			mstatusOut = mstatus_97;
			return ra_98;
		}
		else
		{
			Eq_2 ra_128;
			ptr32 s0_129;
			ptr32 a3_134;
			ptr32 mstatus_135;
			word32 t5_149;
			word32 t6_150;
			g_t2307B510();
			s0Out = s0_129;
			a3Out = a3_134;
			mstatusOut = mstatus_135;
			return ra_128;
		}
	}
}

