pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230236A4: Register Eq_2 bl_send_apm_start_req(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_start
Eq_2 bl_send_apm_start_req(Eq_2 ra, Eq_2 a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a4_34;
	Eq_2 a5_35;
	Eq_2 a3_39;
	word32 a1_330;
	word32 a2_331;
	word32 a6_332;
	word32 a7_333;
	memcpy(fp + -44, 587707700, 0x0C, out a1_330, out a2_331, out a3_39, out a4_34, out a5_35, out a6_332, out a7_333);
	struct Eq_105288 * a0_52;
	up32 a4_56;
	word32 a5_57;
	word32 a6_58;
	Eq_2 s1_61;
	Eq_2 s2_62;
	Eq_2 s3_63;
	Eq_2 s6_74;
	word32 s0_334;
	word32 a1_335;
	word32 s4_336;
	ptr32 a3_221;
	Eq_2 ra_227 = bl_msg_zalloc.constprop.3(ra, 0x00A8, a3_39, a4_34, a5_35, a0, mstatus, dwLoc30, s4, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgC8, dwArgE8, dwArg0108, out s0_334, out s1_61, out a0_52, out a1_335, out a3_221, out a4_56, out a5_57, out a6_58, out s2_62, out s3_63, out s4_336, out s6_74);
	if (a0_52 != null)
	{
		struct Eq_105319 * a4_86;
		a0_52->b0010 = 0x00;
		if (a4_56 <= ~0x0D)
		{
			if (a4_56 != 0x0E)
				a4_86 = (word32) (word16) (a4_56 + 0x00FFF96C);
			else
				a4_86 = (struct Eq_105319 *) 0x00FFF9B4;
		}
		else
			a4_86 = (struct Eq_105319 *) 0x0FFFFFFF;
		*((word32) dwArgA4 + 0x0E) = (word16) a4_86;
		a4_86->t0014 = dwArgA4;
		((word32) dwArgA4 + 40)->u0 = 100;
		*(union Eq_2 *) 0x34 = dwArgA4;
		((word32) dwArgA4 + 48)->u0 = ~0x0177;
		((word32) dwArgA4 + 50)->u1 = 0x06;
		((word32) dwArgA4 + 29)->u1 = (byte) a6_58;
		((word32) dwArgA4 + 0x0033)->u1 = (byte) a5_57;
		((word32) dwArgA4 + 0x0011)->u1 = 0x00;
		((word32) dwArgA4 + 18)->u1 = 0x00;
		*((word32) dwArgA4 + 24) = 0x00;
		((word32) dwArgA4 + 28)->u1 = 0x00;
		((word32) dwArgA4 + 32)->u0 = 0x00;
		((word32) dwArgA4 + 36)->u0 = 0x00;
		word32 a1_337;
		word32 a2_338;
		word32 a3_339;
		word32 a4_340;
		word32 a5_341;
		word32 a0_129 = (word32) (strlen(s2_62, out a1_337, out a2_338, out a3_339, out a4_340, out a5_341) != 0x00);
		((word32) dwArgA4 + 52)->u1 = 0x01;
		*((word32) dwArgA4 + 0x0066) = (byte) a0_129;
		word32 a1_342;
		word32 a2_343;
		word32 a3_344;
		word32 a4_345;
		word32 a5_346;
		word32 a1_347;
		word32 a2_348;
		word32 a3_349;
		word32 a4_350;
		word32 a5_351;
		word32 a6_352;
		word32 a7_353;
		memcpy((word32) dwArgA4 + 69, s1_61, strlen(s1_61, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346), out a1_347, out a2_348, out a3_349, out a4_350, out a5_351, out a6_352, out a7_353);
		word32 a1_354;
		word32 a2_355;
		word32 a3_356;
		word32 a4_357;
		word32 a5_358;
		word32 a1_359;
		word32 a2_360;
		word32 a3_361;
		word32 a4_362;
		word32 a5_363;
		word32 a6_364;
		word32 a7_365;
		memcpy((word32) dwArgA4 + 0x0067, s2_62, strlen(s2_62, out a1_354, out a2_355, out a3_356, out a4_357, out a5_358), out a1_359, out a2_360, out a3_361, out a4_362, out a5_363, out a6_364, out a7_365);
		word32 a1_366;
		word32 a2_367;
		word32 a3_368;
		word32 a4_369;
		word32 a5_370;
		*((word32) dwArgA4 + 0x0044) = (byte) strlen(s1_61, out a1_366, out a2_367, out a3_368, out a4_369, out a5_370);
		((word32) dwArgA4 + 53)->u1 = 0x0C;
		word32 a1_371;
		word32 a2_372;
		word32 a3_373;
		word32 a4_374;
		word32 a5_375;
		word32 a6_376;
		word32 a7_377;
		memcpy((word32) dwArgA4 + 54, fp + -44, 0x0C, out a1_371, out a2_372, out a3_373, out a4_374, out a5_375, out a6_376, out a7_377);
		*((word32) dwArgA4 + 66) = 0x0101;
		word32 s0_378;
		word32 s1_379;
		word32 a0_380;
		word32 a1_381;
		word32 a2_382;
		word32 a4_383;
		word32 a5_384;
		word32 s2_385;
		word32 s3_386;
		ra_227 = bl_send_msg(ra_227, s3_63, dwArgA4, 0x01FFFC01, s3_63, s6_74, mstatus, dwLoc30, s4, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_378, out s1_379, out a0_380, out a1_381, out a2_382, out a3_221, out a4_383, out a5_384, out s2_385, out s3_386, out mstatus);
	}
	s0Out = dwArg0158;
	a3Out = a3_221;
	mstatusOut = mstatus;
	return ra_227;
}

// 230237E4: Register Eq_2 bl_send_apm_stop_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_stop
Eq_2 bl_send_apm_stop_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_25;
	ptr32 a3_28;
	word32 s0_33;
	Eq_2 s1_34;
	word32 s2_35;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 a1_147;
	word32 a4_148;
	word32 a5_149;
	word32 a6_150;
	word32 s4_151;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_33, out s1_34, out a0_25, out a1_147, out a3_28, out a4_148, out a5_149, out a6_150, out s2_35, out s3_36, out s4_151, out s6_47);
	if (a0_25 == 0x00)
	{
		0x00 = (uint16) dwArg38;
		a3Out = a3_28;
		mstatusOut = mstatus;
		return ra_32;
	}
	else
	{
		a0_25->u1 = (byte) s2_35;
		0x00 = (uint16) dwArg38;
		ptr32 a3_68;
		ptr32 mstatus_73;
		word32 s0_152;
		word32 s1_153;
		word32 a0_154;
		word32 a1_155;
		word32 a2_156;
		word32 a4_157;
		word32 a5_158;
		word32 s2_159;
		word32 s3_160;
		Eq_2 ra_74 = bl_send_msg(ra_32, s1_34, a0_25, s0_33 + -1021, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_152, out s1_153, out a0_154, out a1_155, out a2_156, out a3_68, out a4_157, out a5_158, out s2_159, out s3_160, out mstatus_73);
		a3Out = a3_68;
		mstatusOut = mstatus_73;
		return ra_74;
	}
}

// 2302382E: Register Eq_2 bl_send_apm_sta_del_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_sta_delete
Eq_2 bl_send_apm_sta_del_req(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_28;
	word32 a3_31;
	ptr32 s0_36;
	Eq_2 s1_37;
	ptr32 s2_38;
	Eq_2 s3_39;
	Eq_2 s6_50;
	word32 a1_159;
	word32 a4_160;
	word32 a5_161;
	word32 a6_162;
	word32 s4_163;
	Eq_2 ra_35 = bl_msg_zalloc.constprop.3(ra, 0x02, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_36, out s1_37, out a0_28, out a1_159, out a3_31, out a4_160, out a5_161, out a6_162, out s2_38, out s3_39, out s4_163, out s6_50);
	if (a0_28 == 0x00)
	{
		s0Out = s0_36;
		s1Out = s1_37;
		s2Out = s2_38;
		s3Out = s3_39;
		mstatusOut = mstatus;
		return ra_35;
	}
	else
	{
		*((word32) a0_28 + 1) = (byte) s2_38;
		a0_28->u1 = (byte) a3_31;
		ptr32 mstatus_80;
		ptr32 s0_82;
		Eq_2 s1_83;
		ptr32 s2_86;
		Eq_2 s3_87;
		word32 a0_164;
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a5_169;
		Eq_2 ra_81 = bl_send_msg(ra_35, s1_37, a0_28, (word32) dwArg84 - 1012, s3_39, s6_50, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, s1, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_82, out s1_83, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_86, out s3_87, out mstatus_80);
		s0Out = s0_82;
		s1Out = s1_83;
		s2Out = s2_86;
		s3Out = s3_87;
		mstatusOut = mstatus_80;
		return ra_81;
	}
}

// 23023882: void bl_send_apm_conf_max_sta_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_conf_max_sta
void bl_send_apm_conf_max_sta_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_25;
	word32 s0_33;
	Eq_2 s1_34;
	word32 s2_35;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 a1_145;
	word32 a3_146;
	word32 a4_147;
	word32 a5_148;
	word32 a6_149;
	word32 s4_150;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_33, out s1_34, out a0_25, out a1_145, out a3_146, out a4_147, out a5_148, out a6_149, out s2_35, out s3_36, out s4_150, out s6_47);
	if (a0_25 == 0x00)
		0x00 = dwArg38;
	else
	{
		a0_25->u1 = (byte) s2_35;
		0x00 = dwArg38;
		word32 s0_151;
		word32 s1_152;
		word32 a0_153;
		word32 a1_154;
		word32 a2_155;
		word32 a3_156;
		word32 a4_157;
		word32 a5_158;
		word32 s2_159;
		word32 s3_160;
		word32 mstatus_161;
		bl_send_msg(ra_32, s1_34, a0_25, s0_33 + -1010, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_151, out s1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_158, out s2_159, out s3_160, out mstatus_161);
	}
}

// 230238CC: void bl_send_cfg_task_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_cfg_task_req
void bl_send_cfg_task_req(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_32;
	struct Eq_105733 * a4_36;
	byte * a5_37;
	union Eq_2 * s1_41;
	word32 s2_42;
	Eq_2 s3_43;
	Eq_2 s4_44;
	Eq_2 s6_54;
	word32 s0_255;
	word32 a1_256;
	word32 a3_257;
	word32 a6_258;
	Eq_2 ra_39 = bl_msg_zalloc.constprop.3(ra, 36, a3, a4, a5, a2, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, out s0_255, out s1_41, out a0_32, out a1_256, out a3_257, out a4_36, out a5_37, out a6_258, out s2_42, out s3_43, out s4_44, out s6_54);
	if (a0_32 == 0x00)
		0x00 = (uint16) dwArg0128;
	else
	{
		*s1_41 = (union Eq_2 *) a0_32;
		Eq_2 s0_114 = a0_32;
		if (s1_41 <= (union Eq_2 *) 0x02)
		{
			s0_114 = dwArgB4;
			if (s1_41 == null)
			{
				*((word32) a0_32 + 4) = s3_43;
				*((word32) a0_32 + 8) = s2_42;
				a4_36->t000C = a0_32;
				utils_tlv_bl_pack_auto((word32) a0_32 + 20, 0x08, (word32) (word16) a4_36, a5_37, a4_36)->t0010 = dwArgB4;
			}
		}
		else
		{
			if (s1_41 != (union Eq_2 *) 0x03)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_270;
					xTaskGetTickCountFromISR(out a5_270);
				}
				else
				{
					word32 a5_288;
					xTaskGetTickCount(out a5_288);
				}
				word32 s1_271;
				word32 a0_272;
				word32 a1_273;
				word32 a2_274;
				word32 a3_275;
				word32 a4_276;
				word32 a5_277;
				word32 s2_278;
				word32 s3_279;
				word32 s4_280;
				word32 s5_281;
				word32 s6_282;
				word32 s7_283;
				word32 s8_284;
				word32 s9_285;
				word32 s10_286;
				word32 s11_287;
				bl_printk(ra_39, &g_t2307C074, 587710552, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_271, out a0_272, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277, out s2_278, out s3_279, out s4_280, out s5_281, out s6_282, out s7_283, out s8_284, out s9_285, out s10_286, out s11_287);
				while (true)
					;
			}
			*((word32) a0_32 + 4) = s3_43;
			*((word32) a0_32 + 8) = s2_42;
			*((word32) a0_32 + 16) = 0x00;
		}
		0x00 = (uint16) dwArg0128;
		word32 s0_259;
		word32 s1_260;
		word32 a0_261;
		word32 a1_262;
		word32 a2_263;
		word32 a3_264;
		word32 a4_265;
		word32 a5_266;
		word32 s2_267;
		word32 s3_268;
		word32 mstatus_269;
		bl_send_msg(ra_39, s4_44, s0_114, 0x03000001, s3_43, s6_54, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_259, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out s2_267, out s3_268, out mstatus_269);
	}
}

// 230239A6: Register Eq_2 bl_platform_on(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_platform_on(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	g_dw4201E41C = 0x42042000;
	ptr32 a0_12;
	ptr32 a3_15;
	ptr32 s0_21;
	ptr32 s1_22;
	ptr32 s2_25;
	Eq_2 ra_20 = bl_ipc_init(ra, 0x42042000, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgB8, dwArgF8, dwArg0138, out s0_21, out s1_22, out a0_12, out a3_15, out s2_25);
	if (a0_12 == 0x00)
		((union Eq_2 *) 0x07)->u0 = 0x44800000;
	s0Out = s0_21;
	s1Out = s1_22;
	a0Out = a0_12;
	a3Out = a3_15;
	s2Out = s2_25;
	return ra_20;
}

// 230239D2: void bl_rx_chan_pre_switch_ind()
void bl_rx_chan_pre_switch_ind()
{
}

// 230239D6: void bl_rx_rssi_status_ind(Register word32 ra, Register word32 a2)
void bl_rx_rssi_status_ind(word32 ra, word32 a2)
{
	<anonymous> * a5_5 = g_ptr4200DD90;
	if (a5_5 == null)
		return;
	a5_5();
}

// 230239FE: void bl_rx_apm_sta_del_ind(Register Eq_2 ra, Register (ptr32 Eq_105935) a2, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bl_rx_apm_sta_del_ind(Eq_2 ra, struct Eq_105935 * a2, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_2 a3_22;
	Eq_2 a3_47;
	ptr32 s1_51;
	word32 s1_147;
	word32 a0_148;
	word32 a1_149;
	word32 a2_150;
	word32 a4_151;
	word32 a5_152;
	word32 a7_153;
	word32 s2_154;
	word32 s3_155;
	word32 s4_156;
	word32 s5_157;
	word32 s6_158;
	word32 s7_159;
	word32 s8_160;
	word32 s9_161;
	word32 s10_162;
	word32 s11_163;
	word32 t4_164;
	word32 a0_165;
	word32 a1_166;
	word32 a2_167;
	word32 a5_168;
	word32 a7_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s5_173;
	word32 s6_174;
	word32 s7_175;
	word32 s8_176;
	word32 s9_177;
	word32 s10_178;
	word32 s11_179;
	word32 t4_180;
	struct Eq_604 * a4_102;
	Eq_2 ra_101 = printf(printf(ra, &g_t2307C26C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_147, out a0_148, out a1_149, out a2_150, out a3_22, out a4_151, out a5_152, out a7_153, out s2_154, out s3_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160, out s9_161, out s10_162, out s11_163, out t4_164), &g_t2307C284, a3_22, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_51, out a0_165, out a1_166, out a2_167, out a3_47, out a4_102, out a5_168, out a7_169, out s2_170, out s3_171, out s4_172, out s5_173, out s6_174, out s7_175, out s8_176, out s9_177, out s10_178, out s11_179, out t4_180);
	Eq_106027 a0_64 = (word32) a2->b0008;
	if (a0_64 <= 11)
		(s1_51 + ((word32) a0_64 + 28))->b1000C98 = 0x00;
	else
	{
		word32 s1_181;
		word32 a0_182;
		word32 a1_183;
		word32 a2_184;
		word32 a3_185;
		word32 a5_186;
		word32 a7_187;
		word32 s2_188;
		word32 s3_189;
		word32 s4_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s8_194;
		word32 s9_195;
		word32 s10_196;
		word32 s11_197;
		word32 t4_198;
		ra_101 = printf(ra_101, &g_t2307C29C, a3_47, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_181, out a0_182, out a1_183, out a2_184, out a3_185, out a4_102, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
	}
	word32 s0_199;
	word32 a0_200;
	word32 a1_201;
	word32 a3_202;
	aos_post_event(ra_101, 0x02, a4_102, dwArg14, out s0_199, out a0_200, out a1_201, out a3_202);
}

