pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23023A66: void bl_rx_apm_sta_add_ind(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void bl_rx_apm_sta_add_ind(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_604 * a4_158;
	struct Eq_106102 * a1_24;
	Eq_2 a3_26;
	word32 s1_272;
	word32 a0_273;
	word32 a2_274;
	word32 a4_275;
	word32 a5_276;
	word32 a7_277;
	word32 s2_278;
	word32 s3_279;
	word32 s4_280;
	word32 s5_281;
	word32 s6_282;
	word32 s7_283;
	word32 s8_284;
	word32 s9_285;
	word32 s10_286;
	word32 s11_287;
	word32 t4_288;
	Eq_2 ra_29 = printf(ra, &g_t2307C1CC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_272, out a0_273, out a1_24, out a2_274, out a3_26, out a4_275, out a5_276, out a7_277, out s2_278, out s3_279, out s4_280, out s5_281, out s6_282, out s7_283, out s8_284, out s9_285, out s10_286, out s11_287, out t4_288);
	struct Eq_106144 * s0_43 = a1_24->ptr0008;
	Eq_2 a3_81;
	Eq_2 a3_106;
	Eq_2 a3_131;
	up32 s3_139;
	word32 s1_289;
	word32 a0_290;
	word32 a1_291;
	word32 a2_292;
	word32 a3_293;
	word32 a4_294;
	word32 a5_295;
	word32 a7_296;
	word32 s2_297;
	word32 s3_298;
	word32 s4_299;
	word32 s5_300;
	word32 s6_301;
	word32 s7_302;
	word32 s8_303;
	word32 s9_304;
	word32 s10_305;
	word32 s11_306;
	word32 t4_307;
	word32 s1_308;
	word32 a0_309;
	word32 a1_310;
	word32 a2_311;
	word32 a4_312;
	word32 a5_313;
	word32 a7_314;
	word32 s2_315;
	word32 s3_316;
	word32 s4_317;
	word32 s5_318;
	word32 s6_319;
	word32 s7_320;
	word32 s8_321;
	word32 s9_322;
	word32 s10_323;
	word32 s11_324;
	word32 t4_325;
	word32 s1_326;
	word32 a0_327;
	word32 a1_328;
	word32 a2_329;
	word32 a4_330;
	word32 a5_331;
	word32 a7_332;
	word32 s2_333;
	word32 s3_334;
	word32 s4_335;
	word32 s5_336;
	word32 s6_337;
	word32 s7_338;
	word32 s8_339;
	word32 s9_340;
	word32 s10_341;
	word32 s11_342;
	word32 t4_343;
	word32 s1_344;
	word32 a0_345;
	word32 a1_346;
	word32 a2_347;
	word32 a4_348;
	word32 a5_349;
	word32 a7_350;
	word32 s2_351;
	word32 s4_352;
	word32 s5_353;
	word32 s6_354;
	word32 s7_355;
	word32 s8_356;
	word32 s9_357;
	word32 s10_358;
	word32 s11_359;
	word32 t4_360;
	Eq_2 ra_134 = printf(printf(printf(printf(ra_29, &g_t2307C1E4, a3_26, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_289, out a0_290, out a1_291, out a2_292, out a3_293, out a4_294, out a5_295, out a7_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s7_302, out s8_303, out s9_304, out s10_305, out s11_306, out t4_307), &g_t2307C1FC, (word32) s0_43->b000E, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_308, out a0_309, out a1_310, out a2_311, out a3_81, out a4_312, out a5_313, out a7_314, out s2_315, out s3_316, out s4_317, out s5_318, out s6_319, out s7_320, out s8_321, out s9_322, out s10_323, out s11_324, out t4_325), &g_t2307C228, a3_81, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_326, out a0_327, out a1_328, out a2_329, out a3_106, out a4_330, out a5_331, out a7_332, out s2_333, out s3_334, out s4_335, out s5_336, out s6_337, out s7_338, out s8_339, out s9_340, out s10_341, out s11_342, out t4_343), &g_t2307C284, a3_106, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_344, out a0_345, out a1_346, out a2_347, out a3_131, out a4_348, out a5_349, out a7_350, out s2_351, out s3_139, out s4_352, out s5_353, out s6_354, out s7_355, out s8_356, out s9_357, out s10_358, out s11_359, out t4_360);
	up32 s2_148 = (word32) s0_43->b0013;
	if (s2_148 <= 11)
	{
		word32 a1_379;
		word32 a2_380;
		word32 a3_381;
		word32 a5_382;
		word32 a6_383;
		word32 a7_384;
		memcpy(s2_148 + 0x00FFFCAC + s3_139, (char *) s0_43 + 0x0C, 0x06, out a1_379, out a2_380, out a3_381, out a4_158, out a5_382, out a6_383, out a7_384);
		struct Eq_106385 * a0_196 = s3_139 + (s2_148 + 0x1C);
		a0_196->b1000C99 = (byte) (word32) s0_43->b0013;
		a0_196->b1000C9A = (byte) (word32) s0_43->b0012;
		a0_196->b1000C98 = 0x01;
		struct Eq_106409 * a5_203 = (int32) s0_43->b0014;
		a0_196->b1000C9C = (byte) a5_203;
		a0_196->ptr1000CA0 = a5_203;
		struct Eq_106421 * s0_207 = a5_203->ptr001C;
		a0_196->ptr1000CA4 = a5_203;
		a0_196->b1000CA8 = (byte) (word32) s0_207->b0020;
	}
	else
	{
		word32 s1_361;
		word32 a0_362;
		word32 a1_363;
		word32 a2_364;
		word32 a3_365;
		word32 a5_366;
		word32 a7_367;
		word32 s2_368;
		word32 s3_369;
		word32 s4_370;
		word32 s5_371;
		word32 s6_372;
		word32 s7_373;
		word32 s8_374;
		word32 s9_375;
		word32 s10_376;
		word32 s11_377;
		word32 t4_378;
		ra_134 = printf(ra_134, &g_t2307C240, a3_131, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_361, out a0_362, out a1_363, out a2_364, out a3_365, out a4_158, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out t4_378);
	}
	word32 s0_385;
	word32 a0_386;
	word32 a1_387;
	word32 a3_388;
	aos_post_event(ra_134, 0x02, a4_158, dwArg04, out s0_385, out a0_386, out a1_387, out a3_388);
}

// 23023B5A: void notify_event_scan_done(Register Eq_2 ra, Register word32 a0)
// Called from:
//      bl_rx_scanu_join_cfm
//      bl_rx_scanu_start_cfm
void notify_event_scan_done(Eq_2 ra, word32 a0)
{
	word32 a0_80;
	word32 t1_79;
	word32 a1_81;
	word32 a2_82;
	word32 a3_83;
	word32 a4_84;
	word32 a5_85;
	word32 t1_86;
	word32 a0_87;
	word32 a1_88;
	word32 a2_89;
	word32 a3_90;
	word32 a4_91;
	word32 a5_92;
	Eq_2 ra_31 = memset(memset(ra, fp + ~0x17, 0x00, 0x04, out t1_79, out a0_80, out a1_81, out a2_82, out a3_83, out a4_84, out a5_85), fp + ~0x13, 0x00, 0x04, out t1_86, out a0_87, out a1_88, out a2_89, out a3_90, out a4_91, out a5_92);
	<anonymous> * a5_38 = g_ptr4200DD7C;
	if (a5_38 != null)
		a5_38();
}

// 23023BA2: void bl_rx_scanu_join_cfm(Register Eq_2 ra)
void bl_rx_scanu_join_cfm(Eq_2 ra)
{
	notify_event_scan_done(ra, 0x01);
}

// 23023BB4: void bl_rx_scanu_start_cfm(Register Eq_2 ra)
void bl_rx_scanu_start_cfm(Eq_2 ra)
{
	notify_event_scan_done(ra, 0x00);
}

// 23023BC6: void bl_rx_chan_switch_ind(Register Eq_2 ra, Register (ptr32 Eq_106506) a2)
void bl_rx_chan_switch_ind(Eq_2 ra, struct Eq_106506 * a2)
{
	word32 s0_9 = (word32) a2->b0008;
	word32 a2_27;
	word32 a0_77;
	word32 t1_76;
	word32 a1_78;
	word32 a2_79;
	word32 a3_80;
	word32 a4_81;
	word32 a5_82;
	word32 t1_83;
	word32 a0_84;
	word32 a1_85;
	word32 a3_86;
	word32 a4_87;
	word32 a5_88;
	Eq_2 ra_31 = memset(memset(ra, fp + ~0x17, 0x00, 0x04, out t1_76, out a0_77, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82), fp + ~0x13, 0x00, 0x04, out t1_83, out a0_84, out a1_85, out a2_27, out a3_86, out a4_87, out a5_88);
	<anonymous> * a5_35 = g_ptr4200DD7C;
	if (a5_35 != null)
		a5_35();
}

