pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23023C08: void bl_rx_sm_connect_ind(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_106561) a2, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void bl_rx_sm_connect_ind(Eq_2 ra, Eq_2 s1, struct Eq_106561 * a2, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	byte bLoc35_700 = SLICE(dwLoc38, byte, 24);
	Eq_2 a3_15 = (word32) a2->w0008;
	struct Eq_106581 * a4_17 = g_a2307C79C;
	word32 s2_22 = 0x00;
	while ((word32) a4_17->w0000 != a3_15)
	{
		++s2_22;
		++a4_17;
		if (s2_22 == 0x10)
			break;
	}
	Eq_2 a3_46;
	Eq_2 a3_74;
	Eq_2 a3_130;
	Eq_2 a3_155;
	Eq_2 a3_180;
	Eq_2 a3_205;
	Eq_2 a3_230;
	Eq_2 a3_255;
	Eq_2 a3_280;
	Eq_2 a3_305;
	Eq_2 a3_330;
	Eq_2 a3_355;
	Eq_2 a3_380;
	Eq_2 a3_405;
	Eq_2 a3_430;
	word32 s3_463;
	word32 s4_902;
	word32 s11_909;
	word32 s10_908;
	word32 s9_907;
	word32 s8_906;
	word32 a1_913;
	word32 a0_912;
	word32 s1_911;
	word32 t4_910;
	word32 a4_915;
	word32 a5_916;
	word32 a7_917;
	word32 a2_914;
	word32 s3_919;
	word32 s5_921;
	word32 s6_922;
	word32 s2_918;
	word32 s4_920;
	word32 s10_926;
	word32 s7_923;
	word32 s8_924;
	word32 s9_925;
	word32 s5_903;
	word32 s6_904;
	word32 s7_905;
	word32 a5_898;
	word32 a7_899;
	word32 s2_900;
	word32 s3_901;
	word32 a1_894;
	word32 a2_895;
	word32 a3_896;
	word32 a4_897;
	word32 s11_890;
	word32 t4_891;
	word32 s1_892;
	word32 a0_893;
	word32 s7_886;
	word32 s8_887;
	word32 s9_888;
	word32 s10_889;
	word32 a7_880;
	word32 s3_882;
	word32 s4_883;
	word32 s5_884;
	word32 s6_885;
	word32 s2_881;
	word32 s1_874;
	word32 a1_876;
	word32 a2_877;
	word32 a4_878;
	word32 a5_879;
	word32 a0_875;
	word32 s7_868;
	word32 s9_870;
	word32 s10_871;
	word32 s11_872;
	word32 t4_873;
	word32 s8_869;
	word32 a7_862;
	word32 s3_864;
	word32 s4_865;
	word32 s5_866;
	word32 s6_867;
	word32 s2_863;
	word32 s1_856;
	word32 a1_858;
	word32 a2_859;
	word32 a4_860;
	word32 a5_861;
	word32 a0_857;
	word32 s11_927;
	word32 t4_928;
	word32 s1_929;
	word32 a0_930;
	word32 a1_931;
	word32 a2_932;
	word32 a4_933;
	word32 a5_934;
	word32 a7_935;
	word32 s2_936;
	word32 s3_937;
	word32 s4_938;
	word32 s5_939;
	word32 s6_940;
	word32 s7_941;
	word32 s8_942;
	word32 s9_943;
	word32 s10_944;
	word32 s11_945;
	word32 t4_946;
	word32 s1_947;
	word32 a0_948;
	word32 a1_949;
	word32 a2_950;
	word32 a4_951;
	word32 a5_952;
	word32 a7_953;
	word32 s2_954;
	word32 s3_955;
	word32 s4_956;
	word32 s5_957;
	word32 s6_958;
	word32 s7_959;
	word32 s8_960;
	word32 s9_961;
	word32 s10_962;
	word32 s11_963;
	word32 t4_964;
	word32 s1_965;
	word32 a0_966;
	word32 a1_967;
	word32 a2_968;
	word32 a4_969;
	word32 a5_970;
	word32 a7_971;
	word32 s2_972;
	word32 s3_973;
	word32 s4_974;
	word32 s5_975;
	word32 s6_976;
	word32 s7_977;
	word32 s8_978;
	word32 s9_979;
	word32 s10_980;
	word32 s11_981;
	word32 t4_982;
	word32 s1_983;
	word32 a0_984;
	word32 a1_985;
	word32 a2_986;
	word32 a4_987;
	word32 a5_988;
	word32 a7_989;
	word32 s2_990;
	word32 s3_991;
	word32 s4_992;
	word32 s5_993;
	word32 s6_994;
	word32 s7_995;
	word32 s8_996;
	word32 s9_997;
	word32 s10_998;
	word32 s11_999;
	word32 t4_1000;
	word32 s1_1001;
	word32 a0_1002;
	word32 a1_1003;
	word32 a2_1004;
	word32 a4_1005;
	word32 a5_1006;
	word32 a7_1007;
	word32 s2_1008;
	word32 s3_1009;
	word32 s4_1010;
	word32 s5_1011;
	word32 s6_1012;
	word32 s7_1013;
	word32 s8_1014;
	word32 s9_1015;
	word32 s10_1016;
	word32 s11_1017;
	word32 t4_1018;
	word32 s1_1019;
	word32 a0_1020;
	word32 a1_1021;
	word32 a2_1022;
	word32 a4_1023;
	word32 a5_1024;
	word32 a7_1025;
	word32 s2_1026;
	word32 s3_1027;
	word32 s4_1028;
	word32 s5_1029;
	word32 s6_1030;
	word32 s7_1031;
	word32 s8_1032;
	word32 s9_1033;
	word32 s10_1034;
	word32 s11_1035;
	word32 t4_1036;
	word32 s1_1037;
	word32 a0_1038;
	word32 a1_1039;
	word32 a2_1040;
	word32 a4_1041;
	word32 a5_1042;
	word32 a7_1043;
	word32 s2_1044;
	word32 s3_1045;
	word32 s4_1046;
	word32 s5_1047;
	word32 s6_1048;
	word32 s7_1049;
	word32 s8_1050;
	word32 s9_1051;
	word32 s10_1052;
	word32 s11_1053;
	word32 t4_1054;
	word32 s1_1055;
	word32 a0_1056;
	word32 a1_1057;
	word32 a2_1058;
	word32 a4_1059;
	word32 a5_1060;
	word32 a7_1061;
	word32 s2_1062;
	word32 s3_1063;
	word32 s4_1064;
	word32 s5_1065;
	word32 s6_1066;
	word32 s7_1067;
	word32 s8_1068;
	word32 s9_1069;
	word32 s10_1070;
	word32 s11_1071;
	word32 t4_1072;
	word32 s1_1073;
	word32 a0_1074;
	word32 a1_1075;
	word32 a2_1076;
	word32 a4_1077;
	word32 a5_1078;
	word32 a7_1079;
	word32 s2_1080;
	word32 s3_1081;
	word32 s4_1082;
	word32 s5_1083;
	word32 s6_1084;
	word32 s7_1085;
	word32 s8_1086;
	word32 s9_1087;
	word32 s10_1088;
	word32 s11_1089;
	word32 t4_1090;
	word32 s1_1091;
	word32 a0_1092;
	word32 a1_1093;
	word32 a2_1094;
	word32 a4_1095;
	word32 a5_1096;
	word32 a7_1097;
	word32 s2_1098;
	word32 s3_1099;
	word32 s4_1100;
	word32 s5_1101;
	word32 s6_1102;
	word32 s7_1103;
	word32 s8_1104;
	word32 s9_1105;
	word32 s10_1106;
	word32 s11_1107;
	word32 t4_1108;
	word32 s1_1109;
	word32 a0_1110;
	word32 a1_1111;
	word32 a2_1112;
	word32 a4_1113;
	word32 a5_1114;
	word32 a7_1115;
	word32 s2_1116;
	word32 s3_1117;
	word32 s4_1118;
	word32 s5_1119;
	word32 s6_1120;
	word32 s7_1121;
	word32 s8_1122;
	word32 s9_1123;
	word32 s10_1124;
	word32 s11_1125;
	word32 t4_1126;
	word32 s1_1127;
	word32 a0_1128;
	word32 a1_1129;
	word32 a2_1130;
	word32 a4_1131;
	word32 a5_1132;
	word32 a7_1133;
	word32 s2_1134;
	word32 s3_1135;
	word32 s4_1136;
	word32 s5_1137;
	word32 s6_1138;
	word32 s7_1139;
	word32 s8_1140;
	word32 s9_1141;
	word32 s10_1142;
	word32 s11_1143;
	word32 t4_1144;
	word32 a0_1145;
	word32 a1_1146;
	word32 a2_1147;
	word32 a3_1148;
	word32 a4_1149;
	word32 a5_1150;
	word32 a7_1151;
	word32 s4_1152;
	word32 s5_1153;
	word32 s6_1154;
	word32 s7_1155;
	word32 s8_1156;
	word32 s9_1157;
	word32 s10_1158;
	word32 s11_1159;
	word32 t4_1160;
	Eq_2 s1_459;
	Eq_2 s2_462;
	Eq_2 ra_458 = printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(ra, &g_t2307C2F0, a3_15, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_856, out a0_857, out a1_858, out a2_859, out a3_46, out a4_860, out a5_861, out a7_862, out s2_863, out s3_864, out s4_865, out s5_866, out s6_867, out s7_868, out s8_869, out s9_870, out s10_871, out s11_872, out t4_873), &g_t2307C30C, a3_46, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_874, out a0_875, out a1_876, out a2_877, out a3_74, out a4_878, out a5_879, out a7_880, out s2_881, out s3_882, out s4_883, out s5_884, out s6_885, out s7_886, out s8_887, out s9_888, out s10_889, out s11_890, out t4_891), &g_t2307C324, a3_74, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_892, out a0_893, out a1_894, out a2_895, out a3_896, out a4_897, out a5_898, out a7_899, out s2_900, out s3_901, out s4_902, out s5_903, out s6_904, out s7_905, out s8_906, out s9_907, out s10_908, out s11_909, out t4_910), &g_t2307C340, (word32) a2->b000C, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_911, out a0_912, out a1_913, out a2_914, out a3_130, out a4_915, out a5_916, out a7_917, out s2_918, out s3_919, out s4_920, out s5_921, out s6_922, out s7_923, out s8_924, out s9_925, out s10_926, out s11_927, out t4_928), &g_t2307C36C, a3_130, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_929, out a0_930, out a1_931, out a2_932, out a3_155, out a4_933, out a5_934, out a7_935, out s2_936, out s3_937, out s4_938, out s5_939, out s6_940, out s7_941, out s8_942, out s9_943, out s10_944, out s11_945, out t4_946), &g_t2307C380, a3_155, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_947, out a0_948, out a1_949, out a2_950, out a3_180, out a4_951, out a5_952, out a7_953, out s2_954, out s3_955, out s4_956, out s5_957, out s6_958, out s7_959, out s8_960, out s9_961, out s10_962, out s11_963, out t4_964), &g_t2307C394, a3_180, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_965, out a0_966, out a1_967, out a2_968, out a3_205, out a4_969, out a5_970, out a7_971, out s2_972, out s3_973, out s4_974, out s5_975, out s6_976, out s7_977, out s8_978, out s9_979, out s10_980, out s11_981, out t4_982), &g_t2307C3A8, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_983, out a0_984, out a1_985, out a2_986, out a3_230, out a4_987, out a5_988, out a7_989, out s2_990, out s3_991, out s4_992, out s5_993, out s6_994, out s7_995, out s8_996, out s9_997, out s10_998, out s11_999, out t4_1000), &g_t2307C3B8, a3_230, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1001, out a0_1002, out a1_1003, out a2_1004, out a3_255, out a4_1005, out a5_1006, out a7_1007, out s2_1008, out s3_1009, out s4_1010, out s5_1011, out s6_1012, out s7_1013, out s8_1014, out s9_1015, out s10_1016, out s11_1017, out t4_1018), &g_t2307C3C8, a3_255, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1019, out a0_1020, out a1_1021, out a2_1022, out a3_280, out a4_1023, out a5_1024, out a7_1025, out s2_1026, out s3_1027, out s4_1028, out s5_1029, out s6_1030, out s7_1031, out s8_1032, out s9_1033, out s10_1034, out s11_1035, out t4_1036), &g_t2307C3E8, a3_280, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1037, out a0_1038, out a1_1039, out a2_1040, out a3_305, out a4_1041, out a5_1042, out a7_1043, out s2_1044, out s3_1045, out s4_1046, out s5_1047, out s6_1048, out s7_1049, out s8_1050, out s9_1051, out s10_1052, out s11_1053, out t4_1054), &g_t2307C408, a3_305, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1055, out a0_1056, out a1_1057, out a2_1058, out a3_330, out a4_1059, out a5_1060, out a7_1061, out s2_1062, out s3_1063, out s4_1064, out s5_1065, out s6_1066, out s7_1067, out s8_1068, out s9_1069, out s10_1070, out s11_1071, out t4_1072), &g_t2307C418, a3_330, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1073, out a0_1074, out a1_1075, out a2_1076, out a3_355, out a4_1077, out a5_1078, out a7_1079, out s2_1080, out s3_1081, out s4_1082, out s5_1083, out s6_1084, out s7_1085, out s8_1086, out s9_1087, out s10_1088, out s11_1089, out t4_1090), &g_t2307C42C, a3_355, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1091, out a0_1092, out a1_1093, out a2_1094, out a3_380, out a4_1095, out a5_1096, out a7_1097, out s2_1098, out s3_1099, out s4_1100, out s5_1101, out s6_1102, out s7_1103, out s8_1104, out s9_1105, out s10_1106, out s11_1107, out t4_1108), &g_t2307C444, a3_380, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1109, out a0_1110, out a1_1111, out a2_1112, out a3_405, out a4_1113, out a5_1114, out a7_1115, out s2_1116, out s3_1117, out s4_1118, out s5_1119, out s6_1120, out s7_1121, out s8_1122, out s9_1123, out s10_1124, out s11_1125, out t4_1126), &g_t2307C458, a3_405, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1127, out a0_1128, out a1_1129, out a2_1130, out a3_430, out a4_1131, out a5_1132, out a7_1133, out s2_1134, out s3_1135, out s4_1136, out s5_1137, out s6_1138, out s7_1139, out s8_1140, out s9_1141, out s10_1142, out s11_1143, out t4_1144), &g_t2307C474, a3_430, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_459, out a0_1145, out a1_1146, out a2_1147, out a3_1148, out a4_1149, out a5_1150, out a7_1151, out s2_462, out s3_463, out s4_1152, out s5_1153, out s6_1154, out s7_1155, out s8_1156, out s9_1157, out s10_1158, out s11_1159, out t4_1160);
	if ((word32) a2->w0008 == 0x00)
	{
		*((word32) s1_459 + 0x01000E24) = (word32) a2->b0012;
		*(union Eq_2 *) 0x01 = s1_459;
	}
	else
		*s1_459 = 0x00;
	word32 a2_487;
	struct Eq_107330 * a5_490;
	word32 t1_1161;
	word32 a0_1162;
	word32 a1_1163;
	word32 a4_1164;
	Eq_2 a3_488;
	Eq_2 ra_491 = memset(ra_458, fp + -64, 0x00, 32, out t1_1161, out a0_1162, out a1_1163, out a2_487, out a3_488, out a4_1164, out a5_490);
	Eq_2 s0_497 = a5_490->t000C;
	<anonymous> * a5_520 = g_ptr4200DD98;
	Eq_2 dwLoc38_701 = SEQ(bLoc35_700, (byte) (word32) *((word32) s0_497 + 19), (byte) (word32) *((word32) s0_497 + 18), (byte) (word32) *((word32) s0_497 + 0x0011));
	if (a5_520 != null)
	{
		word32 t5_705;
		word32 t6_706;
		word32 tp_707;
		a5_520();
	}
	if ((word32) *((word32) s0_497 + 8) == 0x00)
	{
		word32 a5_556 = (word32) *((word32) s0_497 + 0x0011);
		if ((word32) s1_459 + (a5_556 + 0x0424) != 0x00 && ((word32) s1_459 + (a5_556 + 0x00C4)) + 872 != 0x00)
		{
			Eq_2 a3_607;
			Eq_2 a4_608;
			Eq_2 a5_609;
			Eq_2 s2_614;
			word32 a3_1184;
			word32 a4_1185;
			word32 a5_1186;
			word32 s2_1187;
			netifapi_netif_common(ra_491, netifapi_netif_common(ra_491, s0_497, a3_488, 0x00C4, a5_556 + 0x00C4, s2_462, mstatus, dwArg48, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out a3_607, out a4_608, out a5_609, out s2_614), a3_607, a4_608, a5_609, s2_614, mstatus, dwArg48, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out a3_1184, out a4_1185, out a5_1186, out s2_1187);
		}
		else
		{
			word32 s1_1165;
			word32 a0_1166;
			word32 a1_1167;
			word32 a2_1168;
			word32 a3_1169;
			word32 a4_1170;
			word32 a5_1171;
			word32 a7_1172;
			word32 s2_1173;
			word32 s3_1174;
			word32 s4_1175;
			word32 s5_1176;
			word32 s6_1177;
			word32 s7_1178;
			word32 s8_1179;
			word32 s9_1180;
			word32 s10_1181;
			word32 s11_1182;
			word32 t4_1183;
			printf(ra_491, &g_t2307C490, a3_488, dwLoc38_701, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1165, out a0_1166, out a1_1167, out a2_1168, out a3_1169, out a4_1170, out a5_1171, out a7_1172, out s2_1173, out s3_1174, out s4_1175, out s5_1176, out s6_1177, out s7_1178, out s8_1179, out s9_1180, out s10_1181, out s11_1182, out t4_1183);
		}
	}
}

// 23023E52: void bl_rx_sm_disconnect_ind(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void bl_rx_sm_disconnect_ind(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a3_21;
	word32 a0_327;
	Eq_2 s0_141 = ipaddr_addr(0x2307C4CC, out a0_327, out a3_21);
	Eq_2 a3_45;
	Eq_2 a3_70;
	struct Eq_107505 * s2_103;
	word32 s5_338;
	word32 s6_339;
	word32 s7_340;
	word32 s8_341;
	word32 s9_342;
	word32 s4_337;
	word32 s3_336;
	word32 s2_335;
	word32 a5_333;
	word32 a7_334;
	word32 a2_331;
	word32 a4_332;
	word32 a0_329;
	word32 a1_330;
	word32 s1_328;
	word32 s10_343;
	word32 s11_344;
	word32 t4_345;
	word32 s1_346;
	word32 a0_347;
	word32 a1_348;
	word32 a2_349;
	word32 a4_350;
	word32 a5_351;
	word32 a7_352;
	word32 s2_353;
	word32 s3_354;
	word32 s4_355;
	word32 s5_356;
	word32 s6_357;
	word32 s7_358;
	word32 s8_359;
	word32 s9_360;
	word32 s10_361;
	word32 s11_362;
	word32 t4_363;
	word32 a0_364;
	word32 a1_365;
	word32 a2_366;
	word32 a4_367;
	word32 a5_368;
	word32 a7_369;
	word32 s3_370;
	word32 s4_371;
	word32 s5_372;
	word32 s6_373;
	word32 s7_374;
	word32 s8_375;
	word32 s9_376;
	word32 s10_377;
	word32 s11_378;
	word32 t4_379;
	ptr32 s1_100;
	Eq_2 a3_147;
	Eq_2 ra_140 = printf(printf(printf(ra, &g_t2307C4D4, a3_21, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_328, out a0_329, out a1_330, out a2_331, out a3_45, out a4_332, out a5_333, out a7_334, out s2_335, out s3_336, out s4_337, out s5_338, out s6_339, out s7_340, out s8_341, out s9_342, out s10_343, out s11_344, out t4_345), &g_t2307C504, a3_45, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_346, out a0_347, out a1_348, out a2_349, out a3_70, out a4_350, out a5_351, out a7_352, out s2_353, out s3_354, out s4_355, out s5_356, out s6_357, out s7_358, out s8_359, out s9_360, out s10_361, out s11_362, out t4_363), &g_t2307C51C, a3_70, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_100, out a0_364, out a1_365, out a2_366, out a3_147, out a4_367, out a5_368, out a7_369, out s2_103, out s3_370, out s4_371, out s5_372, out s6_373, out s7_374, out s8_375, out s9_376, out s10_377, out s11_378, out t4_379);
	Eq_2 s2_113 = &s2_103->ptrFFFFFDA0;
	if (s2_103->ptrFFFFFDA0 != null)
	{
		word32 a2_120;
		word32 t1_380;
		word32 a0_381;
		word32 a1_382;
		word32 a3_383;
		word32 a4_384;
		word32 a5_385;
		Eq_2 ra_124 = memset(ra_140, fp + ~0x17, 0x00, 0x08, out t1_380, out a0_381, out a1_382, out a2_120, out a3_383, out a4_384, out a5_385);
		<anonymous> * a5_136 = s2_103->ptrFFFFFDA0;
		word32 tp_257;
		a5_136();
	}
	word32 a5_168 = (word32) *((word32) s0_141 + 0x0A);
	Eq_2 a4_173 = a5_168 + 0x0424 + s1_100;
	if (a4_173 != 0x00 && (s1_100 + (a5_168 + 0x00C4))->dw0368 != 0x00)
	{
		Eq_2 a4_189;
		Eq_2 a5_190;
		Eq_2 s2_195;
		word32 a3_386;
		word32 a4_387;
		word32 s3_388;
		netifapi_netif_set_addr(ra_140, netifapi_netif_common(ra_140, s0_141, a3_147, a4_173, a5_168 + 0x00C4, s2_113, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_386, out a4_189, out a5_190, out s2_195), fp - 28, fp - 28, fp - 28, a4_189, a5_190, s2_195, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a4_387, out s3_388);
	}
}

