pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23023F22: void bl_rx_scanu_result_ind(Register Eq_2 ra, Register (ptr32 Eq_35616) a2, Stack Eq_2 dwArg18, Stack word32 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArg8C)
void bl_rx_scanu_result_ind(Eq_2 ra, struct Eq_35616 * a2, Eq_2 dwArg18, word32 dwArg24, word32 dwArg44, Eq_2 dwArg8C)
{
	Eq_2 a3_25;
	word32 a0_891;
	word32 t1_890;
	word32 a4_894;
	word32 a5_895;
	word32 a1_892;
	word32 a2_893;
	Eq_2 ra_28 = memset(ra, fp + -0x0078, 0x00, 32, out t1_890, out a0_891, out a1_892, out a2_893, out a3_25, out a4_894, out a5_895);
	struct Eq_35616 * s0_249 = a2;
	ui32 a5_31 = (word32) a2->w0024;
	if ((a5_31 & 252) != 0x0080)
	{
		if ((a5_31 & 252) == 80)
		{
			word32 s1_70;
			word32 s2_73;
			word32 s3_74;
			word32 s4_75;
			word32 a3_932;
			word32 a4_933;
			word32 a0_929;
			word32 a1_930;
			word32 a5_934;
			word32 a7_935;
			word32 a2_931;
			word32 s6_937;
			word32 s5_936;
			word32 s8_939;
			word32 s10_941;
			word32 s11_942;
			word32 t4_943;
			word32 s9_940;
			word32 s7_938;
			Eq_2 ra_69 = printf(ra_28, &g_t2307C2CC, a3_25, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_70, out a0_929, out a1_930, out a2_931, out a3_932, out a4_933, out a5_934, out a7_935, out s2_73, out s3_74, out s4_75, out s5_936, out s6_937, out s7_938, out s8_939, out s9_940, out s10_941, out s11_942, out t4_943);
			<anonymous> * a3_84 = g_ptr4200DD8C;
			if (a3_84 != null)
			{
				word32 a4_85 = (word32) a2->w003E;
				word32 a5_86 = (word32) a2->w0042;
				word32 t3_113;
				word32 s10_114;
				word32 s11_115;
				word32 s6_116;
				word32 s7_117;
				word32 s8_118;
				word32 t5_552;
				word32 tp_554;
				word32 t6_553;
				word32 a6_551;
				a3_84();
			}
		}
		else
		{
			word32 a1_912;
			word32 a3_914;
			word32 a2_913;
			word32 t4_928;
			word32 a0_911;
			word32 a4_915;
			word32 a5_916;
			word32 a7_917;
			word32 s9_925;
			word32 s5_921;
			word32 s1_910;
			word32 s3_919;
			word32 s4_920;
			word32 s2_918;
			word32 s6_922;
			word32 s10_926;
			word32 s11_927;
			word32 s8_924;
			word32 s7_923;
			printf(ra_28, &g_t2307C2E0, a3_25, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_910, out a0_911, out a1_912, out a2_913, out a3_914, out a4_915, out a5_916, out a7_917, out s2_918, out s3_919, out s4_920, out s5_921, out s6_922, out s7_923, out s8_924, out s9_925, out s10_926, out s11_927, out t4_928);
		}
		return;
	}
	<anonymous> ** s3_121 = &g_dw4200DD74;
	if (g_dw4200DD74 == 0x00)
		return;
	word32 a5_902;
	word32 a2_899;
	word32 a4_901;
	word32 a0_897;
	word32 a1_898;
	word32 t1_896;
	word32 a3_900;
	Eq_2 ra_131 = memset(ra_28, fp + -88, 0x00, 56, out t1_896, out a0_897, out a1_898, out a2_899, out a3_900, out a4_901, out a5_902);
	Eq_2 s1_134 = (word32) a2->w0008;
	Eq_2 s4_135 = &a2->w0046 + 1;
	struct Eq_107796 * s2_136 = &a2->w0046 + 1;
	Eq_2 a5_137 = 0x00;
	while (a5_137 < s1_134)
	{
		Eq_2 a2_143 = (word32) s2_136->b0001;
		if ((word32) s2_136->b0000 == 0x00)
		{
			if (a2_143 <= 32)
			{
				word32 a3_905;
				word32 a1_903;
				word32 a2_904;
				word32 a7_909;
				word32 a5_907;
				word32 a6_908;
				word32 a4_906;
				memcpy(fp + -82, &s2_136->b0001 + 1, a2_143, out a1_903, out a2_904, out a3_905, out a4_906, out a5_907, out a6_908, out a7_909);
				((word32) s2_136->b0001 + (fp + -32))->b0FCE = 0x00;
			}
			break;
		}
		a5_137 = (word32) a5_137 + ((word32) a2_143 + 2);
		s2_136 += ((word32) a2_143 + 2) / 2;
	}
	int32 a2_172 = (word32) a2->w0008;
	struct Eq_107805 * a5_175 = &a2->w0046 + 1;
	int32 a3_176;
	for (a3_176 = 0x00; a3_176 < a2_172; a3_176 += (word32) a4_183.u1 + 2)
	{
		Eq_107979 a4_183 = (word32) a5_175->b0001;
		if ((word32) a5_175->b0000 == 0x03)
			break;
		a5_175 += ((word32) a4_183.u1 + 2) / 2;
	}
	if (((word32) a2->w0046 & 0x10) == 0x00)
	{
l230240A6:
		<anonymous> * a5_440 = *s3_121;
		word32 t3_519;
		word32 s10_520;
		word32 s11_521;
		word32 s6_522;
		word32 s7_523;
		word32 s8_524;
		word32 a6_525;
		word32 t5_526;
		word32 t6_527;
		word32 tp_528;
		a5_440();
		return;
	}
	uint32 s1_204 = (word32) s1_134 - 36 << 16;
	byte * s1_205 = s1_204 >> 16;
	word32 a5_944;
	Eq_2 a0_213 = mac_ie_find(&a2->w0046 + 1, s1_204 >> 16, 48, out a5_944);
	s2_136 = null;
	if (a0_213 != 0x00)
	{
		struct Eq_35374 * a4_223;
		word32 a5_224;
		word32 a1_945;
		word32 a2_946;
		word32 a3_947;
		word32 a6_948;
		word32 a7_949;
		memcpy(fp + -0x0078, a0_213, (word32) *((word32) a0_213 + 1) + 0x02 & 0x00FF, out a1_945, out a2_946, out a3_947, out a4_223, out a5_224, out a6_948, out a7_949);
		bLoc27 = (byte) ((word32) bLoc27 | 32);
		struct Eq_107796 * a0_240;
		ra_131 = process_rsn_ie(fp + -0x0078, fp + -41, fp + -40, fp + -121, a4_223, a5_224, dwArg8C, out s0_249, out s1_205, out a0_240, out s3_121, out s4_135);
		s2_136 = a0_240;
	}
	Eq_2 a0_276;
	ui32 a4_278;
	s1_134 = mac_vsie_find(s4_135, s1_205, &g_t2307C188, (byte *) 0x04, out a0_276, out a2_172, out a4_278, out s4_135);
	if (a0_276 != 0x00)
	{
		bLoc27 = (byte) ((word32) bLoc27 | 8);
		if (s2_136 == null)
		{
			word32 a1_950;
			word32 a3_952;
			word32 a4_953;
			word32 a2_951;
			word32 a7_956;
			word32 a5_954;
			word32 a6_955;
			memcpy(fp + -0x0078, a0_276, (word32) *((word32) a0_276 + 1) + 0x02 & 0x00FF, out a1_950, out a2_951, out a3_952, out a4_953, out a5_954, out a6_955, out a7_956);
			s0_249 = process_wpa_ie(fp + -0x0078, fp + -43, fp + -42, out s1_134, out a2_172, out a4_278, out s2_136, out s3_121, out s4_135);
		}
	}
	ui32 a3_344;
	ui32 a4_337 = a4_278 & 0x02FFF800;
	if (a4_337 == 0x02FFF800)
	{
		ui32 a5_356 = (word32) bLoc28 | (word32) bLoc2A;
		a3_344 = a5_356 & 8;
		if ((a5_356 & 0x04) != 0x00)
			goto l2302408C;
		if ((a5_356 & 8) == 0x00)
			goto l230240A0;
		if ((a5_356 & 8 & 0x08000800) != 0x00 || ((a5_356 & 8) & 0x04000400) == 0x00)
		{
l23024092:
			if (a4_337 == 0x02FFF800)
			{
l230240A2:
				goto l230240A6;
			}
			goto l23024172;
		}
l23024090:
		goto l23024092;
	}
	ui32 a5_346;
	ui32 a5_338 = (word32) bLoc27;
	if ((a5_338 & 8) != 0x00)
	{
		ui32 a5_347 = (word32) bLoc2A;
		a3_344 = a5_347 & 8;
		if ((a5_347 & 0x04) == 0x00)
		{
			if ((a5_347 & 8) != 0x00)
			{
				a5_346 = (word32) bLoc2B;
				goto l23024146;
			}
			goto l23024172;
		}
	}
	else
	{
		if ((a5_338 & 32) == 0x00)
			goto l23024172;
		ui32 a5_343 = (word32) bLoc28;
		a3_344 = a5_343 & 8;
		if ((a5_343 & 0x04) == 0x00)
		{
			if ((a5_343 & 8) != 0x00)
			{
				a5_346 = (word32) bLoc29;
l23024146:
				if ((a5_346 & 8) != 0x00 || (a5_346 & 0x04) == 0x00)
					goto l23024118;
				goto l23024090;
			}
l23024172:
			ui32 a5_386 = (word32) bLoc27;
			goto l230240A2;
		}
	}
l2302408C:
	if (a3_344 == 0x00)
		goto l23024092;
	goto l23024090;
}

// 230241DC: void bl_rx_mesh_path_update_ind()
void bl_rx_mesh_path_update_ind()
{
}

// 230241E0: void bl_rx_mesh_proxy_update_ind()
void bl_rx_mesh_proxy_update_ind()
{
}

// 230241E4: void bl_rx_remain_on_channel_exp_ind()
void bl_rx_remain_on_channel_exp_ind()
{
}

// 230241E8: void bl_rx_ps_change_ind()
void bl_rx_ps_change_ind()
{
}

