pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230241EC: void bl_rx_traffic_req_ind()
void bl_rx_traffic_req_ind()
{
}

// 230241F0: void bl_rx_csa_counter_ind()
void bl_rx_csa_counter_ind()
{
}

// 230241F4: void bl_rx_csa_finish_ind()
void bl_rx_csa_finish_ind()
{
}

// 230241F8: void bl_rx_csa_traffic_ind()
void bl_rx_csa_traffic_ind()
{
}

// 230241FC: void bl_rx_channel_survey_ind()
void bl_rx_channel_survey_ind()
{
}

// 23024200: void bl_rx_dbg_error_ind()
void bl_rx_dbg_error_ind()
{
}

// 23024204: void bl_rx_tdls_chan_switch_cfm()
void bl_rx_tdls_chan_switch_cfm()
{
}

// 23024208: void bl_rx_tdls_chan_switch_ind()
void bl_rx_tdls_chan_switch_ind()
{
}

// 2302420C: void bl_rx_tdls_chan_switch_base_ind()
void bl_rx_tdls_chan_switch_base_ind()
{
}

// 23024210: void bl_rx_tdls_peer_ps_ind()
void bl_rx_tdls_peer_ps_ind()
{
}

// 23024214: void bl_rx_me_tkip_mic_failure_ind()
void bl_rx_me_tkip_mic_failure_ind()
{
}

// 23024218: void bl_rx_me_tx_credits_update_ind()
void bl_rx_me_tx_credits_update_ind()
{
}

// 2302421C: void bl_rx_mesh_path_create_cfm()
void bl_rx_mesh_path_create_cfm()
{
}

// 23024220: void bl_rx_mesh_peer_update_ind()
void bl_rx_mesh_peer_update_ind()
{
}

// 23024224: void bl_rx_sm_connect_ind_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_sm_connect_ind_cb_register(word32 a0, word32 a1)
{
	g_dw4200ED98 = a1;
	g_dw4200ED9C = a0;
}

// 23024238: void bl_rx_sm_disconnect_ind_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_sm_disconnect_ind_cb_register(word32 a0, word32 a1)
{
	g_dw4200EDA0 = a1;
	g_dw4200EDA4 = a0;
}

// 2302424C: void bl_rx_beacon_ind_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_beacon_ind_cb_register(word32 a0, word32 a1)
{
	g_dw4200ED74 = a1;
	g_dw4200ED78 = a0;
}

// 23024260: void bl_rx_probe_resp_ind_cb_register(Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_probe_resp_ind_cb_register(word32 a1)
{
	g_dw4200ED8C = a1;
}

// 2302426C: void bl_rx_pkt_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_sniffer_register
void bl_rx_pkt_cb_register(word32 a0, word32 a1)
{
	g_dw4200ED84 = a1;
	g_dw4200ED88 = a0;
}

// 23024280: void bl_rx_pkt_cb_unregister()
// Called from:
//      wifi_mgmr_sniffer_unregister
void bl_rx_pkt_cb_unregister()
{
	g_dw4200ED84 = 0x00;
	g_dw4200ED88 = 0x00;
}

// 23024294: void bl_rx_rssi_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_rssi_cb_register(word32 a0, word32 a1)
{
	g_dw4200ED90 = a1;
	g_dw4200ED94 = a0;
}

// 230242A8: Register word32 bl_rx_event_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
word32 bl_rx_event_register(word32 a0, word32 a1)
{
	g_dw4200ED7C = a1;
	g_dw4200ED80 = a0;
	return 0x4200E000;
}

// 230242BC: void bl_rx_e2a_handler(Register Eq_2 a0, Register word32 a2)
// Called from:
//      scan_send_cancel_cfm
void bl_rx_e2a_handler(Eq_2 a0, word32 a2)
{
	g_ptr4201D5D4();
}

// 230242F2: void bl_rx_pkt_cb(Register (ptr32 Eq_108275) a0)
// Called from:
//      tcpip_stack_input
void bl_rx_pkt_cb(struct Eq_108275 * a0)
{
	<anonymous> * t1_5 = g_ptr4200DD84;
	if (t1_5 == null)
		return;
	t1_5();
}

// 2302430E: Register (ptr32 Eq_108281) bl_tx_push(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_46930) a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_108294) a0Out, Register out (ptr32 (ptr32 Eq_99663)) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_108299 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_108281) s3Out)
// Called from:
//      bl_tx_resend
//      bl_tx_try_flush
struct Eq_108281 * bl_tx_push(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_46930 * a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_108294 & a0Out, struct Eq_99663 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_108299 & a5Out, union Eq_2 & s2Out, struct Eq_108281 & s3Out)
{
	struct Eq_99663 ** s4_21 = *((word32) a1 + 8);
	Eq_2 a3_26;
	word32 a4_156;
	word32 a5_157;
	word32 a0_25 = ipc_host_txdesc_get(a2, a4, a5, out a3_26, out a4_156, out a5_157);
	Eq_2 s2_17 = a0;
	struct Eq_108281 * s1_29 = a0_25 + 4;
	word32 s3_30 = a0_25;
	if (a0_25 == 0x04)
	{
		word32 a0_158;
		word32 a1_159;
		word32 a2_160;
		word32 a3_161;
		word32 a4_162;
		word32 a5_163;
		word32 a7_164;
		word32 s5_165;
		word32 s6_166;
		word32 s7_167;
		word32 s8_168;
		word32 s9_169;
		word32 s10_170;
		word32 s11_171;
		word32 t4_172;
		printf(ra, &g_t2307CB34, a3_26, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_29, out a0_158, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a7_164, out s2_17, out s3_30, out s4_21, out s5_165, out s6_166, out s7_167, out s8_168, out s9_169, out s10_170, out s11_171, out t4_172);
	}
	struct Eq_108323 * a1_57 = (word32) a1 + 0x0C;
	struct Eq_108281 * s3_59 = s3_30 + 84;
	do
	{
		++a1_57;
		ui32 a5_63 = (word32) a1_57->bFFFFFFFF;
		++s1_29;
		s1_29[0x0FFF] = (struct Eq_108281) (byte) a5_63;
	} while (s3_59 != s1_29);
	ptr32 a3_75;
	ptr32 a4_76;
	struct Eq_108294 * a0_74 = ipc_host_txdesc_push(s4_21, a5_63, out a3_75, out a4_76);
	Eq_2 a5_78 = *((word32) s2_17 + 56);
	*((word32) s2_17 + 56) = (word32) a5_78 + 1;
	a0Out = a0_74;
	a1Out = s4_21;
	a2Out = dwArg48;
	a3Out = a3_75;
	a4Out = a4_76;
	a5Out = (word32) a5_78 + 1;
	s2Out = s2_17;
	s3Out = s3_59;
	return s1_29;
}

// 2302437E: Register word32 bl_tx_resend(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_46930) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_99751) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      ipc_host_irq
word32 bl_tx_resend(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_46930 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, ptr32 & s1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_99751 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a5_140;
	Eq_2 a4_23 = vTaskEnterCritical(a4, mstatus, out a5_140);
	struct Eq_99751 * s3_24 = &g_t4200E000;
	ptr32 s1_128 = 0x4201E420;
	while (a4_23 != s3_24->tFFFFFDB0)
	{
		Eq_2 a4_40;
		word32 a5_141;
		if (ipc_host_txdesc_get(a2, a4_23, *((word32) a0 + 52), out a3, out a4_40, out a5_141) == 0x00)
			break;
		Eq_2 a0_43 = g_t4200D934;
		*((word32) a4_40 + 4) = 0x00;
		struct Eq_108428 * a5_57;
		word32 s2_142;
		s1_128 = bl_tx_push(ra, a0_43, a1, a2, a4_40, *a1, 0x4200D934, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out a0, out a1, out a2, out a3, out a4_23, out a5_57, out s2_142, out s3_24);
		a5_57->dw0001 = a5_57->dw0000;
	}
	ptr32 a4_86;
	word32 a5_143;
	Eq_2 a3_85 = vTaskExitCritical(a3, mstatus, out a4_86, out a5_143);
	s1Out = s1_128;
	a2Out = dwArg48;
	a3Out = a3_85;
	a4Out = a4_86;
	s3Out = s3_24;
	s4Out = dwArg04;
	s5Out = 0x4200E000;
	return s1;
}

// 230243F8: void bl_tx_try_flush(Register Eq_2 ra, Register (ptr32 Eq_101971) a0, Register (ptr32 Eq_46930) a2, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C)
// Called from:
//      bl_main_event_handle
void bl_tx_try_flush(Eq_2 ra, struct Eq_101971 * a0, struct Eq_46930 * a2, Eq_2 a4, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C)
{
	word32 a5_112;
	Eq_2 a4_16 = vTaskEnterCritical(a4, mstatus, out a5_112);
	Eq_2 s2_17 = 0x4201E000;
	while (true)
	{
		Eq_2 a3_26;
		Eq_2 a4_27;
		struct Eq_108479 * a5_28;
		if (ipc_host_txdesc_get(a2, a4_16, a0->t0034, out a3_26, out a4_27, out a5_28) == 0x00)
			break;
		Eq_2 a5_32;
		Eq_2 a0_31 = utils_list_pop_front(a4_27, a5_28, out a5_32);
		if (a0_31 == 0x00)
			break;
		word32 s3_116;
		word32 a5_115;
		word32 a3_114;
		word32 a1_113;
		bl_tx_push(ra, a0_31, a0_31, a2, a4_27, a5_32, s2_17, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out a0, out a1_113, out a2, out a3_114, out a4_16, out a5_115, out s2_17, out s3_116);
	}
	0x00 = dwArg38;
	word32 a5_118;
	word32 a4_117;
	vTaskExitCritical(a3_26, mstatus, out a4_117, out a5_118);
}

// 2302443E: void bl_txdatacfm(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 Eq_108521) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void bl_txdatacfm(Eq_2 ra, Eq_2 a3, struct Eq_108521 * a5, Eq_2 s4, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a1_5 = a5->t0004;
	Eq_2 s0_17 = a5->t0004;
	if (a5 == null)
	{
l230244A8:
		0x00 = dwArg38;
		return;
	}
	Eq_2 a4_19 = a5 << 0x0F;
	Eq_2 s1_20 = a1_5;
	if (a5 << 0x0F < 0x00)
	{
		if (((g_dw4200DDB0 + 0x01 ^ g_dw4200DDAC) & 0x07) != 0x00)
		{
			word32 a0_206;
			word32 a1_207;
			word32 a2_208;
			word32 a4_209;
			word32 a5_210;
			word32 s4_211;
			word32 s8_212;
			puts(587713356, out a0_206, out a1_207, out a2_208, out a4_209, out a5_210, out s4_211, out s8_212);
			int32 a4_90 = g_dw4200DDB0;
			*s0_17 = ((a4_90 & 7) << 2) + 0x4201E420;
			g_dw4200DDB0 = a4_90 + 0x01;
l230244A6:
			goto l230244A8;
		}
		word32 a0_201;
		word32 a1_202;
		word32 a2_203;
		word32 a5_204;
		word32 s8_205;
		s1_20 = puts(587713372, out a0_201, out a1_202, out a2_203, out a4_19, out a5_204, out s4, out s8_205);
	}
	word32 s0_185;
	word32 s1_186;
	word32 a0_187;
	word32 a1_188;
	word32 a2_189;
	word32 a3_190;
	word32 a4_191;
	word32 a5_192;
	word32 a7_193;
	word32 s2_194;
	word32 s3_195;
	word32 s4_196;
	word32 s5_197;
	word32 s6_198;
	word32 s8_199;
	word32 mstatus_200;
	pbuf_free(ra, s1_20, a3, a4_19, s4, mstatus, dwArg0118, out s0_185, out s1_186, out a0_187, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out a7_193, out s2_194, out s3_195, out s4_196, out s5_197, out s6_198, out s8_199, out mstatus_200);
	goto l230244A6;
}

