pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230244C8: Register Eq_2 bl_tx_notify(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_99841) s0Out, Register out Eq_99842 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_99844) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 int32) s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      ipc_host_irq
Eq_2 bl_tx_notify(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, struct Eq_99841 & s0Out, union Eq_99842 & s1Out, union Eq_2 & a0Out, struct Eq_99844 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, int32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = g_t4200DDA8;
	if (a0_5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0_5;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_12;
		struct Eq_99844 * a1_13;
		ptr32 a2_14;
		Eq_2 a4_15;
		struct Eq_99841 * s0_17;
		Eq_99842 s1_18;
		int32 * s3_20;
		ptr32 s4_21;
		ptr32 a3_25;
		ptr32 mstatus_26;
		word32 a5_73;
		word32 s2_74;
		Eq_2 ra_27 = xTaskGenericNotify(ra, a0_5, 0x00, 0x02, 0x00, a4, mstatus, dwArg14, dwArg38, dwArg58, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_17, out s1_18, out a0_12, out a1_13, out a2_14, out a3_25, out a4_15, out a5_73, out s2_74, out s3_20, out s4_21, out mstatus_26);
		s0Out = s0_17;
		s1Out = s1_18;
		a0Out = a0_12;
		a1Out = a1_13;
		a2Out = a2_14;
		a3Out = a3_25;
		a4Out = a4_15;
		s3Out = s3_20;
		s4Out = s4_21;
		mstatusOut = mstatus_26;
		return ra_27;
	}
}

// 230244DE: void bl_output(Register Eq_2 ra, Register (ptr32 Eq_108680) a0, Register (ptr32 Eq_108681) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack word32 dwArgA8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
// Called from:
//      wifi_tx
void bl_output(Eq_2 ra, struct Eq_108680 * a0, struct Eq_108681 * a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA4, word32 dwArgA8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	if (a0 != null)
	{
		ui32 a5_22 = (word32) a1->b0041;
		if ((a5_22 & 0x04) != 0x00)
		{
			word32 s0_25 = *(a5_22 & 0x04);
			if ((a5_22 & 0x04) == 0x00)
			{
				word32 a5_677;
				*xTaskGetCurrentTaskHandle(out a5_677) = s0_25;
			}
			g_ptr4200E934 = a0;
			Eq_2 s3_40 = *((word32) a2 + 4);
			word32 s4_41 = (word32) *((word32) a2 + 8);
			Eq_2 a3_46;
			struct Eq_108769 * a5_48;
			if (pbuf_header(a2, 0x0080, a2, out a3_46, out a5_48) != 0x00)
			{
				word32 a0_699;
				word32 s11_715;
				word32 t4_716;
				word32 s4_708;
				word32 s5_709;
				word32 s6_710;
				word32 s8_712;
				word32 s9_713;
				word32 s10_714;
				word32 s7_711;
				word32 a2_701;
				word32 a3_702;
				word32 a4_703;
				word32 a7_705;
				word32 s2_706;
				word32 s3_707;
				word32 a5_704;
				word32 s1_698;
				word32 a1_700;
				printf(ra, &g_t2307CAB0, a3_46, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_698, out a0_699, out a1_700, out a2_701, out a3_702, out a4_703, out a5_704, out a7_705, out s2_706, out s3_707, out s4_708, out s5_709, out s6_710, out s7_711, out s8_712, out s9_713, out s10_714, out s11_715, out t4_716);
			}
			else
			{
				word32 a5_109;
				Eq_2 s1_131 = a5_48->t0004;
				Eq_2 s0_130 = a5_48 + (0x00 - a5_48 & 0x03) / 8;
				word32 a1_680;
				word32 a2_681;
				word32 a0_679;
				word32 t1_678;
				word32 a4_683;
				word32 a3_682;
				word32 a5_684;
				Eq_2 ra_157 = memset(ra, s0_130, 0x00, 92, out t1_678, out a0_679, out a1_680, out a2_681, out a3_682, out a4_683, out a5_684);
				*((word32) s1_131 + 8) = s0_130;
				word32 a1_685;
				word32 a3_687;
				word32 a4_688;
				word32 a6_690;
				word32 a2_686;
				word32 a7_691;
				word32 a5_689;
				memcpy((word32) s0_130 + 28, s3_40, 0x06, out a1_685, out a2_686, out a3_687, out a4_688, out a5_689, out a6_690, out a7_691);
				word32 a1_692;
				word32 a2_693;
				word32 a4_694;
				word32 a5_695;
				word32 a6_696;
				word32 a7_697;
				Eq_2 a3_126;
				memcpy((word32) s0_130 + 0x0022, (word32) s3_40 + 6, 0x06, out a1_692, out a2_693, out a3_126, out a4_694, out a5_695, out a6_696, out a7_697);
				*((word32) s1_131 + 0x0C) = s0_130;
				ui32 a5_100 = (word32) *((word32) s3_40 + 0x0D);
				Eq_2 a4_101 = (word32) *((word32) s3_40 + 0x0C);
				((word32) s0_130 + 54)->u1 = 0x00;
				*((word32) s0_130 + 40) = (word16) (a5_100 << 8 | a4_101);
				if (a3 != 0x00)
					a5_109 = (word32) a0->bFFFE1C;
				else
					a5_109 = (word32) a0->bFFFE20;
				((word32) s0_130 + 55)->u1 = (byte) a5_109;
				*((word32) s0_130 + 58) = 0x00;
				*((word32) s0_130 + 20) = (word16) (s4_41 + ~0x0D);
				if (a3 != 0x00)
					*((word32) s0_130 + 56) = a0->tFFFE24;
				else
				{
					word32 a0_123;
					s0_130 = bl_utils_idx_lookup(a0, s3_40, out s1_131, out a0_123, out a3_126, out a4_101);
					*((word32) s0_130 + 56) = (byte) a0_123;
				}
				struct Eq_109069 * s4_143 = (word32) s0_130 + 60;
				Eq_2 s2_146 = s1_131;
				int32 s3_147 = 0x00;
				int32 s5_148 = 0x04;
				word32 s6_149 = 0x2307D000;
				do
				{
					if (s3_147 == 0x00)
					{
						*((word32) *((word32) s2_146 + 4) + 202) = s0_130;
						((Eq_2[]) -66)[(word32) *((word32) s2_146 + 0x0A) / 4] = s0_130;
					}
					else
					{
						if (s3_147 == s5_148)
						{
							word32 a5_739;
							word32 s8_742;
							word32 s7_741;
							word32 a7_740;
							word32 a2_738;
							word32 a1_737;
							word32 s10_744;
							word32 a0_736;
							word32 s11_745;
							word32 t4_746;
							word32 s9_743;
							ra_157 = printf(ra_157, s6_149 + -0x0528, a3_126, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_131, out a0_736, out a1_737, out a2_738, out a3_126, out a4_101, out a5_739, out a7_740, out s2_146, out s3_147, out s4_143, out s5_148, out s6_149, out s7_741, out s8_742, out s9_743, out s10_744, out s11_745, out t4_746);
						}
						s4_143->dw0000 = (word32) *((word32) s2_146 + 4);
						s4_143[4] = (struct Eq_109069) (word32) *((word32) s2_146 + 0x0A);
					}
					s2_146 = *s2_146;
					++s3_147;
					++s4_143;
				} while (s2_146 != 0x00);
				if (s3_147 > 0x02)
				{
					word32 s11_734;
					word32 s10_733;
					word32 s8_731;
					word32 s7_730;
					word32 s6_729;
					word32 t4_735;
					word32 s9_732;
					word32 a2_722;
					word32 a5_723;
					word32 a7_724;
					word32 s3_726;
					word32 s4_727;
					word32 s5_728;
					word32 s2_725;
					word32 a0_720;
					word32 a1_721;
					ra_157 = printf(ra_157, &g_t2307CB18, a3_126, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_131, out a0_720, out a1_721, out a2_722, out a3_126, out a4_101, out a5_723, out a7_724, out s2_725, out s3_726, out s4_727, out s5_728, out s6_729, out s7_730, out s8_731, out s9_732, out s10_733, out s11_734, out t4_735);
				}
				*(union Eq_2 *) 0x11111121 = s0_130;
				*((word32) s0_130 + 28) = s0_130;
				*((word32) s0_130 + 4) = 0x00;
				Eq_2 a3_268;
				Eq_2 a4_269;
				word32 a5_717;
				pbuf_ref(s1_131, a3_126, a4_101, mstatus, out a3_268, out a4_269, out a5_717);
				struct Eq_109009 * a5_271;
				vTaskEnterCritical(a4_269, mstatus, out a5_271);
				utils_list_push_back(s0_130, a5_271);
				word32 a5_719;
				word32 a4_718;
				vTaskExitCritical(a3_268, mstatus, out a4_718, out a5_719);
				bl_irq_handler(ra_157, mstatus, dwLoc08, dwArg18, dwArgA4, dwArgC0, dwArgC4, dwArgE8);
			}
l23024508:
			0x00 = dwArgA8;
			return;
		}
	}
	word32 a2_661;
	word32 a4_663;
	word32 a3_662;
	word32 a1_660;
	word32 a0_659;
	word32 s1_658;
	word32 a5_664;
	word32 a7_665;
	word32 s5_669;
	word32 s7_671;
	word32 s6_670;
	word32 s4_668;
	word32 s9_673;
	word32 s2_666;
	word32 s3_667;
	word32 s8_672;
	word32 s11_675;
	word32 s10_674;
	word32 t4_676;
	printf(ra, &g_t2307CA90, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_658, out a0_659, out a1_660, out a2_661, out a3_662, out a4_663, out a5_664, out a7_665, out s2_666, out s3_667, out s4_668, out s5_669, out s6_670, out s7_671, out s8_672, out s9_673, out s10_674, out s11_675, out t4_676);
	goto l23024508;
}

