pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23024684: void bl_radarind()
void bl_radarind()
{
}

// 23024688: void bl_msgackind(Register word32 ra, Register (ptr32 code) a5)
void bl_msgackind(word32 ra, <anonymous> * a5)
{
	a5();
}

// 2302469A: void bl_prim_tbtt_ind()
void bl_prim_tbtt_ind()
{
}

// 2302469C: void my_pbuf_free_custom(Register (ptr32 Eq_16412) s0, Register (ptr32 Eq_109148) a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24)
void my_pbuf_free_custom(struct Eq_16412 * s0, struct Eq_109148 * a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24)
{
	struct Eq_17428 * a0_5 = a0->ptr0014;
	bl60x_firmwre_mpdu_free(s0, a0_5, a1, a4, mstatus, dwArg08, dwArg24);
}

// 230246A2: void bl_dbgind()
void bl_dbgind()
{
}

// 230246A6: void bl_sec_tbtt_ind()
void bl_sec_tbtt_ind()
{
}

// 230246A8: void my_pbuf_free_custom_fake()
void my_pbuf_free_custom_fake()
{
}

// 230246AA: Register Eq_2 tcpip_stack_input(Register Eq_2 ra, Register ui32 a1, Register (ptr32 Eq_33762) a2, Register Eq_33712 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 s7, Register ptr32 s8, Register ptr32 s9, Register ptr32 s10, Register ptr32 s11, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg08, Stack word32 dwArgA8, Stack word32 dwArg0104, Stack word32 dwArg0124, Stack word32 dwArg0144, Stack word32 dwArg0164, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_33781 a1Out, Register out Eq_33712 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_33712 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_swdesc_upload_evt
Eq_2 tcpip_stack_input(Eq_2 ra, ui32 a1, struct Eq_33762 * a2, Eq_33712 a3, Eq_2 a4, Eq_2 s3, ptr32 s7, ptr32 s8, ptr32 s9, ptr32 s10, ptr32 s11, ptr32 fflags, ptr32 frm, Eq_2 dwArg08, word32 dwArgA8, word32 dwArg0104, word32 dwArg0124, word32 dwArg0144, word32 dwArg0164, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_33781 & a1Out, union Eq_33712 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_33712 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if ((a1 & 0x01) == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x00;
		a1Out = a1 & 0x01;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	Eq_102059 s2_102;
	struct Eq_109166 * sp_5 = fp + -144;
	struct Eq_109170 * a5_34 = (word32) a2->b0031;
	if (a5_34 == (struct Eq_109170 *) 0x00FF)
	{
		s2_102 = g_t4201D904;
		a5_34 = (struct Eq_109170 *) &g_t4201D904;
		while (s2_102 != 0x4201D904)
		{
			if ((word32) *((byte) s2_102.u0 + 111) != 0x00)
				goto l23024722;
			s2_102 = *s2_102;
		}
	}
	else
	{
		s2_102.u0 = 0x00;
		if (a5_34 > (struct Eq_109170 *) 0x01)
			goto l23024722;
		s2_102 = (char *) &a5_34->t0030 + 1107417504;
		a5_34 = (word32) a5_34->b4201DA3F;
		if (a5_34 != null)
		{
l23024722:
			Eq_33781 a1_398;
			Eq_2 a2_59 = a5_34->t0030;
			Eq_2 s4_104 = a4;
			Eq_33712 s6_106 = a3;
			Eq_2 s0_162 = a2_59;
			if ((a5_34 & 2) != 0x00)
			{
				word32 s1_601 = Mem72[a4 + 0x00:int32] + a3;
				bl_rx_pkt_cb(s1_601);
				a1_398 = (word32) s1_601->w0000;
				if ((a1_398 & 252) != 0x0080 && ((word32) ((word16) ((a1_398 & 252) + -0x00A0 & -33)) != 0x00 || (word32) ((word16) ((word32) s1_601->t0018 + ~0x05)) > 0x01) && (((a1_398 & 252) != 0x00D0 || (word32) s1_601->t0018 != 0x06) && ((a1_398 & 0x0C) != 0x08 && (a1_398 & 0x008C) == 0x0088)))
				{
					word32 s5_1072;
					word32 s9_1073;
					word32 t4_1074;
					word32 s2_1071;
					word32 a7_1070;
					word32 a4_1068;
					word32 a5_1069;
					word32 a0_1065;
					word32 a2_1066;
					word32 a3_1067;
					word32 s1_1064;
					printf(ra, &g_t2307CC64, (word32) s1_601->b0005, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1064, out a0_1065, out a1_398, out a2_1066, out a3_1067, out a4_1068, out a5_1069, out a7_1070, out s2_1071, out s3, out s4_104, out s5_1072, out s6_106, out s7, out s8, out s9_1073, out s10, out s11, out t4_1074);
				}
				goto l230247BC;
			}
			Eq_2 a3_274 = (word32) *((word32) a2_59 + 50);
			struct Eq_109221 * a4_112 = (struct Eq_109221 *) 0x00FF;
			if (a3_274 != 0x00FF && ((a5_34 & 0x04) != 0x00 && (word32) (*((word32) s2_102 + 112)) == 0x00))
			{
				word32 s5_1082;
				word32 t4_1083;
				word32 s3_1081;
				word32 a7_1080;
				word32 s1_1075;
				word32 a0_1076;
				word32 a5_1079;
				word32 a1_1077;
				word32 a2_1078;
				ra = printf(ra, &g_t2307CC98, a3_274, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1075, out a0_1076, out a1_1077, out a2_1078, out a3_274, out a4_112, out a5_1079, out a7_1080, out s2_102, out s3_1081, out s4_104, out s5_1082, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1083);
			}
			if (wifi_mgmr_ext_dump_needed(a4_112) != 0x00)
			{
				uint32 s1_135 = (word32) (word16) ((word32) (word16) (int32) *((word32) a2_59 + 26) << 8 | (int32) (*((word32) a2_59 + 25)));
				word32 a5_1084;
				if (xTaskGetTickCount(out a5_1084) - g_t4200DDBC > 0x00FFFFA0)
				{
					g_dw4200DDC0 = 0x00;
					g_dw4200DDB4 = 0x00;
				}
				struct Eq_274 * a0_321;
				++g_dw4200DDC0;
				word32 a5_1085;
				Eq_2 a0_148 = xTaskGetTickCount(out a5_1085);
				ui32 a4_151 = (word32) *((word32) a2_59 + 18);
				g_t4200DDBC = a0_148;
				Eq_2 s10_160 = (int32) *((word32) a2_59 + 23);
				if ((a4_151 & 0x07) > 0x01)
				{
					word32 * a4_323 = (word32) *((word32) a2_59 + 31);
					word32 * a4_335 = a4_323 + ((int32) ((word16) ((word32) (*((word32) a2_59 + 32)) << 8 | a4_323)) ^ 122);
					real32 fa0_333 = (real32) g_dw4200DDC0;
					*a4_335 = *a4_323;
					word32 a1_1109;
					__extendsfdf2(ra, (real32) a4_335 / fa0_333, fflags, frm, out a1_1109);
					a0_321 = (struct Eq_274 *) &g_t2307CCC0;
				}
				else
				{
					s0_162 = *(union Eq_2 *) 0x0D;
					ui32 a4_167 = (word32) *((word32) s0_162 + 31);
					int32 s3_168 = g_dw4200DDB4;
					real32 fs0_169 = (real32) g_dw4200DDC0;
					if (true)
					{
						word32 s7_1119;
						word32 s9_1121;
						word32 s5_1117;
						word32 s6_1118;
						Eq_64250 a1_181;
						word32 s2_1115;
						Eq_2 a0_201;
						Eq_64250 a1_202;
						word32 s3_222;
						word32 s4_1116;
						word32 a7_1114;
						word32 a5_1113;
						word32 a4_1112;
						word32 s1_1111;
						word32 s0_1110;
						word32 s8_1120;
						Eq_2 ra_218 = __muldf3(ra, __floatsidf((int32) (word16) (0x00 - (int32) ((byte) a4_167)), out a1_181), a1_181, g_t23076790, g_t23076794, fflags, frm, out s0_1110, out s1_1111, out a0_201, out a1_202, out a4_1112, out a5_1113, out a7_1114, out s2_1115, out s3_222, out s4_1116, out s5_1117, out s6_1118, out s7_1119, out s8_1120, out s9_1121, out fflags, out frm);
						word32 a1_1122;
						struct Eq_109728 * a3_232;
						word32 a4_1123;
						word32 a5_1124;
						Eq_2 a0_229 = __fixdfsi(ra_218, a0_201, a1_202, fflags, frm, out a1_1122, out a3_232, out a4_1123, out a5_1124);
						int32 s3_236 = (word32) a0_229 + s3_222;
						s0_162 = a3_232->t0024;
						g_dw4200DDB4 = s3_236;
						word32 a1_1125;
						Eq_2 a0_247 = __extendsfdf2(ra_218, (real32) s3_236 / fs0_169, fflags, frm, out a1_1125);
						dwArg08 = a0_229;
						dwLoc88 = a0_247;
						word32 a0_1127;
						word32 s1_1126;
						word32 a7_1132;
						word32 a2_1129;
						word32 a4_1130;
						word32 a5_1131;
						word32 a1_1128;
						word32 s5_1134;
						word32 t4_1135;
						word32 s3_1133;
						ra = printf(ra_218, &g_t2307CD98, a3_232 >> 8 & 0x01, a0_247, dwLoc68, dwLoc20, dwLoc1C, a0_229, s3, out s1_1126, out a0_1127, out a1_1128, out a2_1129, out a3_274, out a4_1130, out a5_1131, out a7_1132, out s2_102, out s3_1133, out s4_104, out s5_1134, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1135);
						goto l230248CA;
					}
					int32 s3_299 = s3_168 + ((int32) ((word16) ((word32) (*((word32) s0_162 + 32)) << 8 | a4_167)) ^ 122);
					g_dw4200DDB4 = s3_299;
					word32 a1_1136;
					__extendsfdf2(ra, (real32) s3_299 / fs0_169, fflags, frm, out a1_1136);
					a0_321 = (struct Eq_274 *) &g_t2307CD2C;
				}
				dwArg08 = s1_135 >> 0x09;
				word32 a2_1140;
				word32 a4_1141;
				word32 a0_1138;
				word32 s1_1137;
				word32 a1_1139;
				word32 a7_1143;
				word32 a5_1142;
				word32 s3_1144;
				word32 s5_1145;
				word32 t4_1146;
				ra = printf(ra, a0_321, s10_160, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, s1_135 >> 0x09, s3, out s1_1137, out a0_1138, out a1_1139, out a2_1140, out a3_274, out a4_1141, out a5_1142, out a7_1143, out s2_102, out s3_1144, out s4_104, out s5_1145, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1146);
			}
l230248CA:
			if (s2_102 != 0x00)
			{
				word32 a2_1100;
				word32 a5_1102;
				word32 a4_1101;
				word32 a1_1099;
				word32 a0_1098;
				word32 t1_1097;
				Eq_2 a3_427;
				Eq_2 ra_430 = memset(ra, *((word32) s4_104 + 16), 0x00, 0x18, out t1_1097, out a0_1098, out a1_1099, out a2_1100, out a3_427, out a4_1101, out a5_1102);
				g_t230246AC = a3_427;
				g_t230246B0 = a3_427;
				ptr32 a5_448 = (word32) (word16) ((word32) *((word32) s4_104 + 32) - s6_106);
				word32 a5_1103;
				Eq_2 a4_454;
				word32 a0_451 = pbuf_alloced_custom(0x00, a5_448, 65, a3_427, Mem440[s4_104 + 0x00:int32] + s6_106, a5_448, out a4_454, out a5_1103);
				s0_162 = (word32) s4_104 + 0x0022;
				ptr32 s1_456 = (word32) s4_104 + 4;
				s4_104 = (word32) s4_104 + 40;
				s3.u0 = 587351720;
				do
				{
					<anonymous> * a5_462 = (word32) *s0_162;
					if (a5_462 == null)
						break;
					struct Eq_109535 * a4_475;
					word32 a1_1106;
					word32 a2_1107;
					word32 a5_1108;
					word32 a0_1105;
					word32 t1_1104;
					ra_430 = memset(ra_430, a3_427, 0x00, 0x18, out t1_1104, out a0_1105, out a1_1106, out a2_1107, out a3_427, out a4_475, out a5_1108);
					*((word32) a3_427 + 16) = 587351720;
					ptr32 a5_485 = (word32) *s0_162;
					word32 s1_486 = a4_475->dw0000;
					pbuf_cat(a0_451, pbuf_alloced_custom(0x00, a5_485, 65, a3_427, a4_475, a5_485, out a4_454, out a5_462), a4_454);
					s0_162 = (word32) s0_162 + 2;
					s1_456 = s1_486 + 0x04;
				} while (s0_162 != s4_104);
				a1_398 = *((word32) s2_102 + 8);
				if (a1_398 != 0x00)
				{
					word32 a5_579;
					word32 a7_583;
					word32 a6_584;
					word32 t1_585;
					word32 t4_586;
					word32 t0_587;
					word32 fa0_588;
					word32 fa5_589;
					word32 fs0_590;
					word32 t3_591;
					word32 t2_594;
					word32 t5_595;
					word32 t6_596;
					a5_462();
l23024940:
					struct Eq_109323 * sp_676 = sp_5->ptr0048;
					Eq_2 a4_673 = sp_5->t0020;
					ptr32 a0_674 = sp_5->ptr0004;
					ptr32 s9_678 = sp_676->ptr0198;
					ptr32 s5_679 = sp_676->ptr01B8;
					Eq_2 ra_684 = sp_676->t015C;
					Eq_33712 a3_686 = sp_676->t0008;
					s0Out = s0_162;
					a0Out = a0_674;
					a1Out = a1_398;
					a3Out = a3_686;
					a4Out = a4_673;
					s3Out = s3;
					s4Out = s4_104;
					s5Out = s5_679;
					s6Out = s6_106;
					s7Out = s7;
					s8Out = s8;
					s9Out = s9_678;
					s10Out = s10;
					s11Out = s11;
					fflagsOut = fflags;
					frmOut = frm;
					return ra_684;
				}
			}
			else
			{
				word32 s9_1095;
				word32 t4_1096;
				word32 s5_1094;
				word32 s2_1093;
				word32 a7_1092;
				word32 a5_1091;
				word32 a4_1090;
				word32 a3_1089;
				word32 a2_1088;
				word32 a0_1087;
				word32 s1_1086;
				printf(ra, &g_t2307CE14, a3_274, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1086, out a0_1087, out a1_398, out a2_1088, out a3_1089, out a4_1090, out a5_1091, out a7_1092, out s2_1093, out s3, out s4_104, out s5_1094, out s6_106, out s7, out s8, out s9_1095, out s10, out s11, out t4_1096);
			}
l230247BC:
			goto l23024940;
		}
	}
	s2_102.u0 = 0x00;
	goto l23024722;
}

Eq_2 g_t230246AC = 
	{
		57753
	};
Eq_2 g_t230246B0 = 
	{
		0x8082
	};
// 23024A98: Register Eq_2 bl_utils_idx_lookup(Register (ptr32 Eq_108680) a0, Register Eq_2 a1, Register out (ptr32 Eq_108944) s1Out, Register out (ptr32 Eq_108944) a0Out, Register out ptr32 a3Out, Register out Eq_108947 a4Out)
// Called from:
//      bl_output
Eq_2 bl_utils_idx_lookup(struct Eq_108680 * a0, Eq_2 a1, struct Eq_108944 & s1Out, struct Eq_108944 & a0Out, ptr32 & a3Out, union Eq_108947 & a4Out)
{
	Eq_2 s0_19 = (char *) a0 + 0x00FFFC90;
	struct Eq_108944 * s1_20 = null;
	do
	{
		if ((word32) *((word32) s0_19 + 8) != 0x00)
		{
			word32 a1_103;
			word32 a2_104;
			word32 a5_105;
			if (memcmp(s0_19, a1, 0x06, out a1_103, out a2_104, out a3, out a4, out a5_105) == 0x00)
				goto l23024ADA;
		}
		s1_20 = (struct Eq_108944 *) ((char *) s1_20 + 1);
		s0_19 = (word32) s0_19 + 28;
	} while (s1_20 != (struct Eq_108944 *) 0x0C);
	s1_20 = g_ptr4201E3D4;
l23024ADA:
	s1Out = s1_20;
	a0Out = s1_20;
	a3Out = a3;
	a4Out = a4;
	return s0_19;
}

