pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23024AEA: Register Eq_2 bl_ipc_init(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_platform_on
Eq_2 bl_ipc_init(Eq_2 ra, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	word32 t1_153;
	word32 a0_154;
	word32 a1_155;
	word32 a2_156;
	word32 a5_157;
	Eq_2 ra_23 = memset(ra, fp + -48, 0x00, 32, out t1_153, out a0_154, out a1_155, out a2_156, out a3_20, out a4_21, out a5_157);
	Eq_2 a0_48;
	Eq_2 s2_57;
	word32 s1_158;
	word32 a1_159;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	word32 a6_164;
	word32 s3_165;
	word32 s4_166;
	word32 s8_167;
	*((word32) a0_48 + 52) = pvPortMalloc(ra_23, a1, 228, a3_20, a4_21, 587351718, mstatus, dwArg10, dwArg14, 587351718, dwArg0108, dwArg0148, out s1_158, out a0_48, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a6_164, out s2_57, out s3_165, out s4_166, out s8_167);
	g_t4200EDB8 = a0_48;
	Eq_2 a3_72;
	Eq_2 a4_73;
	word32 s0_78;
	Eq_2 ra_77 = ipc_host_init(ra_23, a0_48, s2_57, 587351688, dwArg18, dwArg20, dwArg24, dwArg48, dwArg6C, out s0_78, out a3_72, out a4_73);
	ptr32 a3_100;
	ptr32 s2_106;
	ptr32 s1_105 = bl_cmd_mgr_init(ra_77, s0_78 + 4, a3_72, a4_73, mstatus, 0x2302443E, 0x23024684, 0x00, dwArgC8, dwArg0108, dwArg0148, out a3_100, out s2_106);
	s0Out = dwArgE4;
	s1Out = s1_105;
	a0Out = 0x00;
	a3Out = a3_100;
	s2Out = s2_106;
	return ra_77;
}

// 23024B72: void bl_utils_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      bl60x_fw_dump_statistic
void bl_utils_dump(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	word32 a0_250;
	word32 a1_251;
	word32 a2_252;
	word32 a4_253;
	word32 a5_254;
	word32 s4_255;
	word32 s8_256;
	puts(0x2307CB7C, out a0_250, out a1_251, out a2_252, out a4_253, out a5_254, out s4_255, out s8_256);
	Eq_2 a3_41;
	Eq_2 a3_69;
	word32 s1_257;
	word32 a0_258;
	word32 a1_259;
	word32 a2_260;
	word32 a4_261;
	word32 a5_262;
	word32 a7_263;
	word32 s2_264;
	word32 s3_265;
	word32 s4_266;
	word32 s5_267;
	word32 s6_268;
	word32 s7_269;
	word32 s8_270;
	word32 s9_271;
	word32 s10_272;
	word32 s11_273;
	word32 t4_274;
	word32 s1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a4_279;
	word32 a5_280;
	word32 a7_281;
	word32 s2_282;
	word32 s3_283;
	word32 s4_284;
	word32 s5_285;
	word32 s6_286;
	word32 s7_287;
	word32 s8_288;
	word32 s9_289;
	word32 s10_290;
	word32 s11_291;
	word32 t4_292;
	word32 s1_293;
	word32 a0_294;
	word32 a1_295;
	word32 a2_296;
	word32 a4_297;
	word32 a5_298;
	word32 a7_299;
	word32 s2_300;
	word32 s4_301;
	word32 s5_302;
	word32 s6_303;
	word32 s7_304;
	word32 s8_305;
	word32 s9_306;
	word32 s10_307;
	word32 s11_308;
	word32 t4_309;
	word32 s3_107;
	Eq_2 a3_149;
	Eq_2 ra_102 = printf(printf(printf(ra, &g_t2307CBA4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_257, out a0_258, out a1_259, out a2_260, out a3_41, out a4_261, out a5_262, out a7_263, out s2_264, out s3_265, out s4_266, out s5_267, out s6_268, out s7_269, out s8_270, out s9_271, out s10_272, out s11_273, out t4_274), &g_t2307CBC0, a3_41, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_275, out a0_276, out a1_277, out a2_278, out a3_69, out a4_279, out a5_280, out a7_281, out s2_282, out s3_283, out s4_284, out s5_285, out s6_286, out s7_287, out s8_288, out s9_289, out s10_290, out s11_291, out t4_292), &g_t2307CBDC, a3_69, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_293, out a0_294, out a1_295, out a2_296, out a3_149, out a4_297, out a5_298, out a7_299, out s2_300, out s3_107, out s4_301, out s5_302, out s6_303, out s7_304, out s8_305, out s9_306, out s10_307, out s11_308, out t4_309);
	word32 a0_310;
	word32 a2_311;
	word32 a5_312;
	word32 s4_313;
	word32 s8_314;
	word32 a1_122;
	word32 a4_123;
	puts(587713532, out a0_310, out a1_122, out a2_311, out a4_123, out a5_312, out s4_313, out s8_314);
	word32 s0_135 = 0x00;
	while (a1_122 + s0_135 != a4_123)
	{
		++s0_135;
		word32 s2_165;
		word32 s1_315;
		word32 a0_316;
		word32 a2_317;
		word32 a5_318;
		word32 a7_319;
		word32 s4_320;
		word32 s5_321;
		word32 s6_322;
		word32 s7_323;
		word32 s8_324;
		word32 s9_325;
		word32 s10_326;
		word32 s11_327;
		word32 t4_328;
		ra_102 = printf(ra_102, s3_107 + -988, a3_149, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_315, out a0_316, out a1_122, out a2_317, out a3_149, out a4_123, out a5_318, out a7_319, out s2_165, out s3_107, out s4_320, out s5_321, out s6_322, out s7_323, out s8_324, out s9_325, out s10_326, out s11_327, out t4_328);
		if (s0_135 == s2_165)
			break;
	}
	word32 a0_329;
	word32 a1_330;
	word32 a2_331;
	word32 a4_332;
	word32 a5_333;
	word32 s4_334;
	word32 s8_335;
	puts(0x2307CC3C, out a0_329, out a1_330, out a2_331, out a4_332, out a5_333, out s4_334, out s8_335);
}

// 23024C34: void stateSnifferGuard()
void stateSnifferGuard()
{
}

// 23024C42: void stateConnectedIPYesGuard_ip_update()
void stateConnectedIPYesGuard_ip_update()
{
}

// 23024C50: void printErrMsg(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void printErrMsg(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t2307CF1C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

