pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23024C5C: void stateSnifferExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateSnifferExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D67C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23024C6A: void stateSnifferAction(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateSnifferAction(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23024C78: void stateConnectedIPNoAction_ipgot(Register Eq_2 ra, Register (ptr32 Eq_110342) a4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectedIPNoAction_ipgot(Eq_2 ra, struct Eq_110342 * a4, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_189;
	word32 a0_190;
	word32 a1_191;
	word32 a2_192;
	word32 a3_193;
	word32 a4_194;
	word32 a5_195;
	word32 a7_196;
	word32 s2_197;
	word32 s3_198;
	word32 s4_199;
	word32 s5_200;
	word32 s6_201;
	word32 s7_202;
	word32 s8_203;
	word32 s9_204;
	word32 s10_205;
	word32 s11_206;
	word32 t4_207;
	Eq_2 ra_117 = printf(ra, &g_t2307CF50, ((word32) a4->b000F << 16 | ((word32) a4->b000D | (word32) a4->b000E << 8)) >> 16, ((word32) a4->b0018 << 24 | (((word32) a4->b0016 << 8 | (word32) a4->b0015) | (word32) a4->b0017 << 16)) >> 0x18, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
	word32 s1_208;
	word32 a0_209;
	word32 a1_210;
	word32 a2_211;
	word32 a3_212;
	word32 a4_213;
	word32 a5_214;
	word32 a7_215;
	word32 s2_216;
	word32 s3_217;
	word32 s4_218;
	word32 s5_219;
	word32 s6_220;
	word32 s7_221;
	word32 s8_222;
	word32 s9_223;
	word32 s10_224;
	word32 s11_225;
	word32 t4_226;
	printf(ra_117, &g_t2307D648, dwLoc30, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_208, out a0_209, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214, out a7_215, out s2_216, out s3_217, out s4_218, out s5_219, out s6_220, out s7_221, out s8_222, out s9_223, out s10_224, out s11_225, out t4_226);
}

// 23024DCE: void stateGlobalEnter(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateGlobalEnter(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23024DDC: void stateGlobalAction(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateGlobalAction(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t2307D27C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 23024DE8: void stateConnectingEnter(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void stateConnectingEnter(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_604 * a4_17;
	word32 s1_57;
	word32 a0_58;
	word32 a1_59;
	word32 a2_60;
	word32 a3_61;
	word32 a5_62;
	word32 a7_63;
	word32 s2_64;
	word32 s3_65;
	word32 s4_66;
	word32 s5_67;
	word32 s6_68;
	word32 s7_69;
	word32 s8_70;
	word32 s9_71;
	word32 s10_72;
	word32 s11_73;
	word32 t4_74;
	Eq_2 ra_19 = printf(ra, &g_t2307D298, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_57, out a0_58, out a1_59, out a2_60, out a3_61, out a4_17, out a5_62, out a7_63, out s2_64, out s3_65, out s4_66, out s5_67, out s6_68, out s7_69, out s8_70, out s9_71, out s10_72, out s11_73, out t4_74);
	word32 s0_75;
	word32 a0_76;
	word32 a1_77;
	word32 a3_78;
	aos_post_event(ra_19, 0x02, a4_17, dwArg24, out s0_75, out a0_76, out a1_77, out a3_78);
}

// 23024E08: void stateSnifferGuard_ChannelSet(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack word32 dwArg34, Stack Eq_2 dwArg3C, Stack up32 dwArg54, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void stateSnifferGuard_ChannelSet(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a5, Eq_2 s3, ptr32 mstatus, word32 dwArg34, Eq_2 dwArg3C, up32 dwArg54, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	if (a0 != (word32) (*a5))
		return;
	bl_main_monitor_channel_set(ra, s1, (word32) *((word32) a5 + 8) << 24 | ((word32) (*((word32) a5 + 7)) << 16 | ((word32) (*((word32) a5 + 6)) << 8 | (word32) (*((word32) a5 + 5)))), (word32) *((word32) a5 + 3) << 16 | ((word32) (*((word32) a5 + 2)) << 8 | (word32) (*((word32) a5 + 1))), a5, s3, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg34, dwArg3C, dwArg54, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 23024E5E: void stateIdleGuard_sniffer(Register Eq_2 ra, Register word32 a0, Register (ptr32 byte) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void stateIdleGuard_sniffer(Eq_2 ra, word32 a0, byte * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg3C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	if (a0 != (word32) (*a5))
		return;
	bl_main_monitor(ra, s3, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg3C, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 23024E7C: void stateConnectedIPNoExit(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void stateConnectedIPNoExit(Eq_2 ra, word32 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a5_16;
	word32 s1_114;
	word32 a0_115;
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a7_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	word32 s9_128;
	word32 s10_129;
	word32 s11_130;
	word32 t4_131;
	printf(ra, &g_t2307D67C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_115, out a1_116, out a2_117, out a3_118, out a4_119, out a5_16, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131);
	Eq_2 a5_45;
	word32 s1_132;
	word32 a0_133;
	word32 a3_134;
	word32 a4_135;
	word32 s2_136;
	word32 s3_137;
	word32 s4_138;
	word32 s5_139;
	word32 s6_140;
	word32 s8_141;
	Eq_2 s0_47 = xTimerGenericCommand(a0 + 32, 0x03, null, 0x00, a5_16, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_132, out a0_133, out a3_134, out a4_135, out a5_45, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s8_141);
	word32 s1_142;
	word32 a0_143;
	word32 a3_144;
	word32 a4_145;
	word32 a5_146;
	word32 s2_147;
	word32 s3_148;
	word32 s4_149;
	word32 s5_150;
	word32 s6_151;
	word32 s8_152;
	xTimerGenericCommand(s0_47, 0x05, null, 0x00, a5_45, mstatus, dwArg64, dwArgD8, dwArgE8, dwArg0118, dwArg0158, out s1_142, out a0_143, out a3_144, out a4_145, out a5_146, out s2_147, out s3_148, out s4_149, out s5_150, out s6_151, out s8_152);
}

// 23024EB8: void stateDisconnect_action_idle(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateDisconnect_action_idle(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a3_16;
	Eq_2 a3_40;
	word32 s1_114;
	word32 a0_115;
	word32 a1_116;
	word32 a2_117;
	word32 a4_118;
	word32 a5_119;
	word32 a7_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	word32 s9_128;
	word32 s10_129;
	word32 s11_130;
	word32 t4_131;
	word32 s1_132;
	word32 a0_133;
	word32 a1_134;
	word32 a2_135;
	word32 a4_136;
	word32 a5_137;
	word32 a7_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	word32 s9_146;
	word32 s10_147;
	word32 s11_148;
	word32 t4_149;
	Eq_2 ra_43 = printf(printf(ra, &g_t2307D648, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_115, out a1_116, out a2_117, out a3_16, out a4_118, out a5_119, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131), &g_t2307D0A4, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_132, out a0_133, out a1_134, out a2_135, out a3_40, out a4_136, out a5_137, out a7_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
	word32 a3_150;
	word32 mstatus_151;
	bl_main_if_remove(ra_43, s0, a3_40, mstatus, dwArg00, dwArg04, dwArg18, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg60, dwArg64, dwArg6C, dwArg7C, dwArg88, dwArgAC, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a3_150, out mstatus_151);
}

// 23024EE6: void stateDisconnect_action_reconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void stateDisconnect_action_reconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	Eq_2 a3_25;
	Eq_2 a3_49;
	Eq_2 a3_75;
	Eq_2 a3_111;
	Eq_2 a3_136;
	Eq_2 a3_170;
	Eq_2 a3_195;
	Eq_2 s1_263;
	Eq_2 s2_266;
	word32 s1_375;
	word32 a0_376;
	word32 a1_377;
	word32 a2_378;
	word32 a4_379;
	word32 a5_380;
	word32 a7_381;
	word32 s2_382;
	word32 s3_383;
	word32 s4_384;
	word32 s5_385;
	word32 s6_386;
	word32 s7_387;
	word32 s8_388;
	word32 s9_389;
	word32 s10_390;
	word32 s11_391;
	word32 t4_392;
	word32 s1_393;
	word32 a0_394;
	word32 a1_395;
	word32 a2_396;
	word32 a4_397;
	word32 a5_398;
	word32 a7_399;
	word32 s2_400;
	word32 s3_401;
	word32 s4_402;
	word32 s5_403;
	word32 s6_404;
	word32 s7_405;
	word32 s8_406;
	word32 s9_407;
	word32 s10_408;
	word32 s11_409;
	word32 t4_410;
	word32 s1_411;
	word32 a0_412;
	word32 a1_413;
	word32 a2_414;
	word32 a4_415;
	word32 a5_416;
	word32 a7_417;
	word32 s2_418;
	word32 s3_419;
	word32 s4_420;
	word32 s5_421;
	word32 s6_422;
	word32 s7_423;
	word32 s8_424;
	word32 s9_425;
	word32 s10_426;
	word32 s11_427;
	word32 t4_428;
	word32 s1_429;
	word32 a0_430;
	word32 a1_431;
	word32 a2_432;
	word32 a4_433;
	word32 a5_434;
	word32 a7_435;
	word32 s2_436;
	word32 s3_437;
	word32 s4_438;
	word32 s5_439;
	word32 s6_440;
	word32 s7_441;
	word32 s8_442;
	word32 s9_443;
	word32 s10_444;
	word32 s11_445;
	word32 t4_446;
	word32 s1_447;
	word32 a0_448;
	word32 a1_449;
	word32 a2_450;
	word32 a4_451;
	word32 a5_452;
	word32 a7_453;
	word32 s2_454;
	word32 s3_455;
	word32 s4_456;
	word32 s5_457;
	word32 s6_458;
	word32 s7_459;
	word32 s8_460;
	word32 s9_461;
	word32 s10_462;
	word32 s11_463;
	word32 t4_464;
	word32 s1_465;
	word32 a0_466;
	word32 a1_467;
	word32 a2_468;
	word32 a4_469;
	word32 a5_470;
	word32 a7_471;
	word32 s2_472;
	word32 s3_473;
	word32 s4_474;
	word32 s5_475;
	word32 s6_476;
	word32 s7_477;
	word32 s8_478;
	word32 s9_479;
	word32 s10_480;
	word32 s11_481;
	word32 t4_482;
	word32 s1_483;
	word32 a0_484;
	word32 a1_485;
	word32 a2_486;
	word32 a4_487;
	word32 a5_488;
	word32 a7_489;
	word32 s2_490;
	word32 s3_491;
	word32 s4_492;
	word32 s5_493;
	word32 s6_494;
	word32 s7_495;
	word32 s8_496;
	word32 s9_497;
	word32 s10_498;
	word32 s11_499;
	word32 t4_500;
	word32 s1_501;
	word32 a0_502;
	word32 a1_503;
	word32 a2_504;
	word32 a3_505;
	word32 a4_506;
	word32 a5_507;
	word32 a7_508;
	word32 s2_509;
	word32 s3_510;
	word32 s4_511;
	word32 s5_512;
	word32 s6_513;
	word32 s7_514;
	word32 s8_515;
	word32 s9_516;
	word32 s10_517;
	word32 s11_518;
	word32 t4_519;
	word32 a0_520;
	word32 a1_521;
	word32 a2_522;
	word32 a3_523;
	word32 a4_524;
	word32 a5_525;
	word32 a7_526;
	word32 s3_527;
	word32 s4_528;
	word32 s5_529;
	word32 s6_530;
	word32 s7_531;
	word32 s8_532;
	word32 s9_533;
	word32 s10_534;
	word32 s11_535;
	word32 t4_536;
	Eq_2 ra_262 = printf(printf(printf(printf(printf(printf(printf(printf(printf(ra, &g_t2307D648, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_375, out a0_376, out a1_377, out a2_378, out a3_25, out a4_379, out a5_380, out a7_381, out s2_382, out s3_383, out s4_384, out s5_385, out s6_386, out s7_387, out s8_388, out s9_389, out s10_390, out s11_391, out t4_392), &g_t2307D0CC, a3_25, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_393, out a0_394, out a1_395, out a2_396, out a3_49, out a4_397, out a5_398, out a7_399, out s2_400, out s3_401, out s4_402, out s5_403, out s6_404, out s7_405, out s8_406, out s9_407, out s10_408, out s11_409, out t4_410), &g_t2307D0E8, a3_49, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_411, out a0_412, out a1_413, out a2_414, out a3_75, out a4_415, out a5_416, out a7_417, out s2_418, out s3_419, out s4_420, out s5_421, out s6_422, out s7_423, out s8_424, out s9_425, out s10_426, out s11_427, out t4_428), &g_t2307D100, a3_75, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_429, out a0_430, out a1_431, out a2_432, out a3_111, out a4_433, out a5_434, out a7_435, out s2_436, out s3_437, out s4_438, out s5_439, out s6_440, out s7_441, out s8_442, out s9_443, out s10_444, out s11_445, out t4_446), &g_t2307D11C, a3_111, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_447, out a0_448, out a1_449, out a2_450, out a3_136, out a4_451, out a5_452, out a7_453, out s2_454, out s3_455, out s4_456, out s5_457, out s6_458, out s7_459, out s8_460, out s9_461, out s10_462, out s11_463, out t4_464), &g_t2307D130, a3_136, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_465, out a0_466, out a1_467, out a2_468, out a3_170, out a4_469, out a5_470, out a7_471, out s2_472, out s3_473, out s4_474, out s5_475, out s6_476, out s7_477, out s8_478, out s9_479, out s10_480, out s11_481, out t4_482), &g_t2307D148, a3_170, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_483, out a0_484, out a1_485, out a2_486, out a3_195, out a4_487, out a5_488, out a7_489, out s2_490, out s3_491, out s4_492, out s5_493, out s6_494, out s7_495, out s8_496, out s9_497, out s10_498, out s11_499, out t4_500), &g_t2307D15C, a3_195, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_501, out a0_502, out a1_503, out a2_504, out a3_505, out a4_506, out a5_507, out a7_508, out s2_509, out s3_510, out s4_511, out s5_512, out s6_513, out s7_514, out s8_515, out s9_516, out s10_517, out s11_518, out t4_519), &g_t2307D174, (word32) *((word32) a0 + 0x00FF), dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_263, out a0_520, out a1_521, out a2_522, out a3_523, out a4_524, out a5_525, out a7_526, out s2_266, out s3_527, out s4_528, out s5_529, out s6_530, out s7_531, out s8_532, out s9_533, out s10_534, out s11_535, out t4_536);
	struct Eq_604 * a4_317 = bl_main_connect(ra_262, a0, s1_263, s2_266, (word32) a0 + 252, 0x00, mstatus, 0x00, dwLoc18);
	0x00 = dwArg0128;
	word32 s0_537;
	word32 a0_538;
	word32 a1_539;
	word32 a3_540;
	aos_post_event(ra_262, 0x02, a4_317, dwArg24, out s0_537, out a0_538, out a1_539, out a3_540);
}

// 2302505C: void ip_obtaining_timeout(Register Eq_2 ra, Register (ptr32 Eq_111400) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void ip_obtaining_timeout(Eq_2 ra, struct Eq_111400 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	pvTimerGetTimerID(a0, a3, a4, mstatus, out a3_12);
	Eq_2 s4_31;
	word32 s1_88;
	word32 a0_89;
	word32 a1_90;
	word32 a2_91;
	word32 a3_92;
	word32 a4_93;
	word32 a5_94;
	word32 a7_95;
	word32 s2_96;
	word32 s3_97;
	word32 s5_98;
	word32 s6_99;
	word32 s7_100;
	word32 s8_101;
	word32 s9_102;
	word32 s10_103;
	word32 s11_104;
	word32 t4_105;
	Eq_2 ra_25 = printf(ra, &g_t2307CEFC, a3_12, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_88, out a0_89, out a1_90, out a2_91, out a3_92, out a4_93, out a5_94, out a7_95, out s2_96, out s3_97, out s4_31, out s5_98, out s6_99, out s7_100, out s8_101, out s9_102, out s10_103, out s11_104, out t4_105);
	wifi_mgmr_api_fw_disconnect(ra_25, s4_31, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

