pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025078: void stateConnectedIPNoEnter(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118)
void stateConnectedIPNoEnter(Eq_2 ra, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118)
{
	struct Eq_604 * a4_145;
	Eq_2 ra_126;
	Eq_2 a3_29;
	int32 a7_31;
	word32 s1_344;
	word32 a0_345;
	word32 a1_346;
	word32 a2_347;
	word32 a4_348;
	word32 a5_349;
	word32 s2_350;
	word32 s3_351;
	word32 s4_352;
	word32 s5_353;
	word32 s6_354;
	word32 s7_355;
	word32 s8_356;
	word32 s9_357;
	word32 s10_358;
	word32 s11_359;
	word32 t4_360;
	Eq_2 ra_32 = printf(ra, &g_t2307D298, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_344, out a0_345, out a1_346, out a2_347, out a3_29, out a4_348, out a5_349, out a7_31, out s2_350, out s3_351, out s4_352, out s5_353, out s6_354, out s7_355, out s8_356, out s9_357, out s10_358, out s11_359, out t4_360);
	word32 s1_361;
	word32 a3_362;
	Eq_2 s0_61 = xTimerCreateStatic((struct Eq_111562 *) 0x03FFFA98, a3_29, 0x2302505C, (word32) a3_29 + 32, a7_31, mstatus, dwLoc38, dwArgA8, dwArgE8, out s1_361, out a3_362);
	Eq_2 a5_74;
	xTaskGetTickCount(out a5_74);
	word32 s1_85;
	Eq_2 a3_92;
	Eq_2 a4_93;
	word32 a0_363;
	word32 a5_364;
	word32 s2_365;
	word32 s3_366;
	word32 s4_367;
	word32 s5_368;
	word32 s6_369;
	word32 s8_370;
	xTimerGenericCommand(s0_61, 0x01, null, ~0x00, a5_74, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out s1_85, out a0_363, out a3_92, out a4_93, out a5_364, out s2_365, out s3_366, out s4_367, out s5_368, out s6_369, out s8_370);
	word32 a5_371;
	vTaskEnterCritical(a4_93, mstatus, out a5_371);
	word32 a4_372;
	word32 a5_373;
	Eq_2 a3_113 = vTaskExitCritical(a3_92, mstatus, out a4_372, out a5_373);
	if (s1_85 != 0x00)
	{
		Eq_2 a3_171;
		Eq_2 a4_172;
		Eq_2 s1_175;
		Eq_2 s2_178;
		word32 a0_389;
		word32 a1_390;
		word32 a2_391;
		word32 a5_392;
		word32 a7_393;
		word32 s3_394;
		word32 s4_395;
		word32 s5_396;
		word32 s6_397;
		word32 s7_398;
		word32 s8_399;
		word32 s9_400;
		word32 s10_401;
		word32 s11_402;
		word32 t4_403;
		ra_126 = printf(ra_32, &g_t2307CFD4, a3_113, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_175, out a0_389, out a1_390, out a2_391, out a3_171, out a4_172, out a5_392, out a7_393, out s2_178, out s3_394, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403);
		Eq_2 a4_193;
		word32 a5_404;
		dns_setserver(0x00, fp + -44, a4_172, out a4_193, out a5_404);
		Eq_2 a5_198;
		Eq_2 a4_200;
		dns_setserver(0x01, fp + -44, a4_193, out a4_200, out a5_198);
		Eq_2 a4_213;
		Eq_2 a5_214;
		Eq_2 s2_219;
		word32 a3_405;
		word32 s3_406;
		netifapi_netif_set_addr(ra_126, netifapi_netif_common(ra_126, 0x4201E000, a3_171, a4_200, a5_198, s2_178, mstatus, s1_175, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out a3_405, out a4_213, out a5_214, out s2_219), fp + -44, fp + -40, fp + -36, a4_213, a5_214, s2_219, mstatus, s1_175, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out a4_145, out s3_406);
	}
	else
	{
		Eq_2 a5_119;
		Eq_2 a3_123;
		Eq_2 a4_124;
		Eq_2 s2_130;
		word32 s1_374;
		word32 a0_375;
		word32 a1_376;
		word32 a2_377;
		word32 a7_378;
		word32 s3_379;
		word32 s4_380;
		word32 s5_381;
		word32 s6_382;
		word32 s7_383;
		word32 s8_384;
		word32 s9_385;
		word32 s10_386;
		word32 s11_387;
		word32 t4_388;
		ra_126 = printf(ra_32, &g_t2307CFF8, a3_113, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_374, out a0_375, out a1_376, out a2_377, out a3_123, out a4_124, out a5_119, out a7_378, out s2_130, out s3_379, out s4_380, out s5_381, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387, out t4_388);
		a4_145 = wifi_netif_dhcp_start(ra_126, 0x4201E000, a3_123, a4_124, a5_119, s2_130, mstatus, dwArg38, dwArg48, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8);
	}
	word32 s0_407;
	word32 a0_408;
	word32 a1_409;
	word32 a3_410;
	aos_post_event(ra_126, 0x02, a4_145, dwLoc1C, out s0_407, out a0_408, out a1_409, out a3_410);
}

// 23025172: void stateConnectedIPNoGuard_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 byte) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      stateConnectedIPYesGuard_disconnect
void stateConnectedIPNoGuard_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, byte * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a5_6 = (word32) *a5;
	if (a0 != a5_6)
		return;
	bl_main_disconnect(ra, a3, a4, a5_6, s3, mstatus, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

// 23025190: void stateConnectedIPYesGuard_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 byte) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateConnectedIPYesGuard_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, byte * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	stateConnectedIPNoGuard_disconnect(ra, a0, a3, a4, a5, s3, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

