pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025194: void stateConnectedIPYesGuard_rcconfig(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateConnectedIPYesGuard_rcconfig(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (a0 == (word32) (*s0))
	{
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_158;
		word32 a0_159;
		word32 a1_160;
		word32 a2_161;
		word32 a5_162;
		word32 a7_163;
		word32 s2_164;
		word32 s4_165;
		word32 s5_166;
		word32 s6_167;
		word32 s7_168;
		word32 s8_169;
		word32 s9_170;
		word32 s10_171;
		word32 s11_172;
		word32 t4_173;
		bl_main_rate_config(printf(ra, &g_t2307D034, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_158, out a0_159, out a1_160, out a2_161, out a3_29, out a4_30, out a5_162, out a7_163, out s2_164, out s3_37, out s4_165, out s5_166, out s6_167, out s7_168, out s8_169, out s9_170, out s10_171, out s11_172, out t4_173), a3_29, a4_30, (word32) *((word32) s0 + 2) << 8, s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 230251E8: void stateIdleAction_connect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void stateIdleAction_connect(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0128)
{
	((word32) s0 + 45)->u1 = 0x00;
	((word32) s0 + 114)->u1 = 0x00;
	Eq_2 a3_33;
	Eq_2 a3_59;
	Eq_2 a3_95;
	Eq_2 a3_120;
	Eq_2 a3_154;
	Eq_2 a3_179;
	Eq_2 a3_213;
	Eq_2 a3_238;
	Eq_2 a3_296;
	word32 s11_535;
	word32 s10_534;
	word32 s9_533;
	word32 s8_532;
	word32 s7_531;
	word32 s6_530;
	word32 s5_529;
	word32 s4_528;
	word32 s3_527;
	word32 s2_526;
	word32 a7_525;
	word32 a5_524;
	word32 a4_523;
	word32 a2_522;
	word32 a1_521;
	word32 a0_520;
	word32 s1_519;
	word32 t4_536;
	word32 s1_537;
	word32 a0_538;
	word32 a1_539;
	word32 a2_540;
	word32 a4_541;
	word32 a5_542;
	word32 a7_543;
	word32 s2_544;
	word32 s3_545;
	word32 s4_546;
	word32 s5_547;
	word32 s6_548;
	word32 s7_549;
	word32 s8_550;
	word32 s9_551;
	word32 s10_552;
	word32 s11_553;
	word32 t4_554;
	word32 s1_555;
	word32 a0_556;
	word32 a1_557;
	word32 a2_558;
	word32 a4_559;
	word32 a5_560;
	word32 a7_561;
	word32 s2_562;
	word32 s3_563;
	word32 s4_564;
	word32 s5_565;
	word32 s6_566;
	word32 s7_567;
	word32 s8_568;
	word32 s9_569;
	word32 s10_570;
	word32 s11_571;
	word32 t4_572;
	word32 s1_573;
	word32 a0_574;
	word32 a1_575;
	word32 a2_576;
	word32 a4_577;
	word32 a5_578;
	word32 a7_579;
	word32 s2_580;
	word32 s3_581;
	word32 s4_582;
	word32 s5_583;
	word32 s6_584;
	word32 s7_585;
	word32 s8_586;
	word32 s9_587;
	word32 s10_588;
	word32 s11_589;
	word32 t4_590;
	word32 s1_591;
	word32 a0_592;
	word32 a1_593;
	word32 a2_594;
	word32 a4_595;
	word32 a5_596;
	word32 a7_597;
	word32 s2_598;
	word32 s3_599;
	word32 s4_600;
	word32 s5_601;
	word32 s6_602;
	word32 s7_603;
	word32 s8_604;
	word32 s9_605;
	word32 s10_606;
	word32 s11_607;
	word32 t4_608;
	word32 s1_609;
	word32 a0_610;
	word32 a1_611;
	word32 a2_612;
	word32 a4_613;
	word32 a5_614;
	word32 a7_615;
	word32 s2_616;
	word32 s3_617;
	word32 s4_618;
	word32 s5_619;
	word32 s6_620;
	word32 s7_621;
	word32 s8_622;
	word32 s9_623;
	word32 s10_624;
	word32 s11_625;
	word32 t4_626;
	word32 s1_627;
	word32 a0_628;
	word32 a1_629;
	word32 a2_630;
	word32 a4_631;
	word32 a5_632;
	word32 a7_633;
	word32 s2_634;
	word32 s3_635;
	word32 s4_636;
	word32 s5_637;
	word32 s6_638;
	word32 s7_639;
	word32 s8_640;
	word32 s9_641;
	word32 s10_642;
	word32 s11_643;
	word32 t4_644;
	word32 s1_645;
	word32 a0_646;
	word32 a1_647;
	word32 a2_648;
	word32 a4_649;
	word32 a5_650;
	word32 a7_651;
	word32 s2_652;
	word32 s3_653;
	word32 s4_654;
	word32 s5_655;
	word32 s6_656;
	word32 s7_657;
	word32 s8_658;
	word32 s9_659;
	word32 s10_660;
	word32 s11_661;
	word32 t4_662;
	word32 s1_663;
	word32 a0_664;
	word32 a1_665;
	word32 a2_666;
	word32 a3_667;
	word32 a4_668;
	word32 a5_669;
	word32 a7_670;
	word32 s2_671;
	word32 s3_672;
	word32 s4_673;
	word32 s5_674;
	word32 s6_675;
	word32 s7_676;
	word32 s8_677;
	word32 s9_678;
	word32 s10_679;
	word32 s11_680;
	word32 t4_681;
	word32 s1_682;
	word32 a0_683;
	word32 a1_684;
	word32 a2_685;
	word32 a4_686;
	word32 a5_687;
	word32 a7_688;
	word32 s2_689;
	word32 s3_690;
	word32 s4_691;
	word32 s5_692;
	word32 s6_693;
	word32 s7_694;
	word32 s8_695;
	word32 s9_696;
	word32 s10_697;
	word32 s11_698;
	word32 t4_699;
	Eq_2 ra_299 = printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(ra, &g_t2307D554, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_519, out a0_520, out a1_521, out a2_522, out a3_33, out a4_523, out a5_524, out a7_525, out s2_526, out s3_527, out s4_528, out s5_529, out s6_530, out s7_531, out s8_532, out s9_533, out s10_534, out s11_535, out t4_536), &g_t2307D0E8, a3_33, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_537, out a0_538, out a1_539, out a2_540, out a3_59, out a4_541, out a5_542, out a7_543, out s2_544, out s3_545, out s4_546, out s5_547, out s6_548, out s7_549, out s8_550, out s9_551, out s10_552, out s11_553, out t4_554), &g_t2307D100, a3_59, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_555, out a0_556, out a1_557, out a2_558, out a3_95, out a4_559, out a5_560, out a7_561, out s2_562, out s3_563, out s4_564, out s5_565, out s6_566, out s7_567, out s8_568, out s9_569, out s10_570, out s11_571, out t4_572), &g_t2307D11C, a3_95, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_573, out a0_574, out a1_575, out a2_576, out a3_120, out a4_577, out a5_578, out a7_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590), &g_t2307D130, a3_120, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_591, out a0_592, out a1_593, out a2_594, out a3_154, out a4_595, out a5_596, out a7_597, out s2_598, out s3_599, out s4_600, out s5_601, out s6_602, out s7_603, out s8_604, out s9_605, out s10_606, out s11_607, out t4_608), &g_t2307D148, a3_154, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_609, out a0_610, out a1_611, out a2_612, out a3_179, out a4_613, out a5_614, out a7_615, out s2_616, out s3_617, out s4_618, out s5_619, out s6_620, out s7_621, out s8_622, out s9_623, out s10_624, out s11_625, out t4_626), &g_t2307D15C, a3_179, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_627, out a0_628, out a1_629, out a2_630, out a3_213, out a4_631, out a5_632, out a7_633, out s2_634, out s3_635, out s4_636, out s5_637, out s6_638, out s7_639, out s8_640, out s9_641, out s10_642, out s11_643, out t4_644), &g_t2307D570, a3_213, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_645, out a0_646, out a1_647, out a2_648, out a3_238, out a4_649, out a5_650, out a7_651, out s2_652, out s3_653, out s4_654, out s5_655, out s6_656, out s7_657, out s8_658, out s9_659, out s10_660, out s11_661, out t4_662), &g_t2307D590, a3_238, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_663, out a0_664, out a1_665, out a2_666, out a3_667, out a4_668, out a5_669, out a7_670, out s2_671, out s3_672, out s4_673, out s5_674, out s6_675, out s7_676, out s8_677, out s9_678, out s10_679, out s11_680, out t4_681), &g_t2307D174, (word32) *((word32) s0 + 191), dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_682, out a0_683, out a1_684, out a2_685, out a3_296, out a4_686, out a5_687, out a7_688, out s2_689, out s3_690, out s4_691, out s5_692, out s6_693, out s7_694, out s8_695, out s9_696, out s10_697, out s11_698, out t4_699);
	(word32) *((word32) s0 + 0x00C5) != 0x00;
	Eq_2 a3_329;
	Eq_2 s1_333;
	Eq_2 a3_353;
	Eq_2 s1_390;
	Eq_2 s2_393;
	word32 a0_700;
	word32 a1_701;
	word32 a2_702;
	word32 a4_703;
	word32 a5_704;
	word32 a7_705;
	word32 s2_706;
	word32 s3_707;
	word32 s4_708;
	word32 s5_709;
	word32 s6_710;
	word32 s7_711;
	word32 s8_712;
	word32 s9_713;
	word32 s10_714;
	word32 s11_715;
	word32 t4_716;
	word32 a0_717;
	word32 a1_718;
	word32 a2_719;
	word32 a3_720;
	word32 a4_721;
	word32 a5_722;
	word32 a7_723;
	word32 s3_724;
	word32 s4_725;
	word32 s5_726;
	word32 s6_727;
	word32 s7_728;
	word32 s8_729;
	word32 s9_730;
	word32 s10_731;
	word32 s11_732;
	word32 t4_733;
	bl_main_connect(printf(wifi_mgmr_profile_add(printf(ra_299, &g_t2307D5B0, a3_296, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_333, out a0_700, out a1_701, out a2_702, out a3_329, out a4_703, out a5_704, out a7_705, out s2_706, out s3_707, out s4_708, out s5_709, out s6_710, out s7_711, out s8_712, out s9_713, out s10_714, out s11_715, out t4_716), &g_b4201E448, s1_333, ~0x00, a3_329, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out a3_353), &g_t2307D648, a3_353, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_390, out a0_717, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722, out a7_723, out s2_393, out s3_724, out s4_725, out s5_726, out s6_727, out s7_728, out s8_729, out s9_730, out s10_731, out s11_732, out t4_733), s0, s1_390, s2_393, (word32) s0 + 188, (word32) *((word32) s0 + 0x00C2), mstatus, (uint16) ((word32) *((word32) s0 + 0x00C4) << 8 | (word32) (*((word32) s0 + 0x00C3))), dwLoc18);
	0x00 = dwArg0128;
}

// 230253D8: void stateGlobal_cfg_req(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_112497) a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobal_cfg_req(Eq_2 ra, Eq_2 s0, struct Eq_112497 * a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) a4->b0000 != 22)
		return;
	bl_main_cfg_task_req(ra, s0, (word32) a4->b0014 << 24 | ((word32) a4->b0013 << 16 | ((word32) a4->b0012 << 8 | (word32) a4->b0011)), (word32) a4->b0018 << 24 | ((word32) a4->b0017 << 16 | ((word32) a4->b0016 << 8 | (word32) a4->b0015)), (word32) a4->b001C << 24 | ((word32) a4->b001B << 16 | ((word32) a4->b001A << 8 | (word32) a4->b0019)), &a4->b001C + 5, s2, s3, mstatus, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgA4, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23025486: void stateGlobalGuard_fw_powersaving(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobalGuard_fw_powersaving(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) *s0 == 0x10)
	{
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a2_164;
		word32 a5_165;
		word32 a7_166;
		word32 s2_167;
		word32 s4_168;
		word32 s5_169;
		word32 s6_170;
		word32 s7_171;
		word32 s8_172;
		word32 s9_173;
		word32 s10_174;
		word32 s11_175;
		word32 t4_176;
		bl_main_powersaving(printf(ra, &g_t2307D3EC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_161, out a0_162, out a1_163, out a2_164, out a3_29, out a4_30, out a5_165, out a7_166, out s2_167, out s3_37, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175, out t4_176), a3_29, a4_30, (word32) *((word32) s0 + 3) << 16 | ((word32) (*((word32) s0 + 2)) << 8 | (word32) (*((word32) s0 + 1))), s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 230254EA: void stateGlobalGuard_conf_max_sta(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobalGuard_conf_max_sta(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) *s0 == 0x0A)
	{
		Eq_2 a5_25;
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_153;
		word32 a0_154;
		word32 a1_155;
		word32 a2_156;
		word32 a7_157;
		word32 s2_158;
		word32 s4_159;
		word32 s5_160;
		word32 s6_161;
		word32 s7_162;
		word32 s8_163;
		word32 s9_164;
		word32 s10_165;
		word32 s11_166;
		word32 t4_167;
		bl_main_conf_max_sta(printf(ra, &g_t2307D34C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_153, out a0_154, out a1_155, out a2_156, out a3_29, out a4_30, out a5_25, out a7_157, out s2_158, out s3_37, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163, out s9_164, out s10_165, out s11_166, out t4_167), a3_29, a4_30, a5_25, s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 23025536: void stateGlobalGuard_AP(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack ptr32 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack word32 dwArgB0, Stack word32 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void stateGlobalGuard_AP(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, ptr32 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, word32 dwArgB0, word32 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	if ((word32) *s0 == 0x08)
	{
		word32 a0_25;
		Eq_2 a3_28;
		Eq_2 a4_29;
		Eq_2 a5_30;
		ptr32 mstatus_33;
		Eq_2 s0_35;
		Eq_2 s2_39;
		Eq_2 ra_34 = bl_main_if_add(ra, s0, 0x00, a3, s2, s3, s4, mstatus, s2, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg48, ra, dwArg88, dwArg94, dwArgA8, dwArgB0, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s0_35, out a0_25, out a3_28, out a4_29, out a5_30, out s2_39, out mstatus_33);
		if (a0_25 != 0x00)
		{
			word32 s1_441;
			word32 a0_442;
			word32 a1_443;
			word32 a2_444;
			word32 a3_445;
			word32 a4_446;
			word32 a5_447;
			word32 a7_448;
			word32 s2_449;
			word32 s3_450;
			word32 s4_451;
			word32 s5_452;
			word32 s6_453;
			word32 s7_454;
			word32 s8_455;
			word32 s9_456;
			word32 s10_457;
			word32 s11_458;
			word32 t4_459;
			printf(ra_34, &g_t2307D2B8, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_441, out a0_442, out a1_443, out a2_444, out a3_445, out a4_446, out a5_447, out a7_448, out s2_449, out s3_450, out s4_451, out s5_452, out s6_453, out s7_454, out s8_455, out s9_456, out s10_457, out s11_458, out t4_459);
		}
		else
		{
			Eq_2 a3_61;
			Eq_2 a4_62;
			Eq_2 a5_63;
			Eq_2 s2_68;
			Eq_2 a3_88;
			Eq_2 a3_117;
			Eq_2 a3_143;
			Eq_2 s1_183;
			Eq_2 a0_210;
			Eq_2 a3_213;
			Eq_2 a4_214;
			ptr32 mstatus_218;
			Eq_2 s1_221;
			word32 a4_380;
			word32 a5_381;
			word32 s2_382;
			word32 s1_383;
			word32 a0_384;
			word32 a1_385;
			word32 a2_386;
			word32 a4_387;
			word32 a5_388;
			word32 a7_389;
			word32 s2_390;
			word32 s3_391;
			word32 s4_392;
			word32 s5_393;
			word32 s6_394;
			word32 s7_395;
			word32 s8_396;
			word32 s9_397;
			word32 s10_398;
			word32 s11_399;
			word32 t4_400;
			word32 s1_401;
			word32 a0_402;
			word32 a1_403;
			word32 a2_404;
			word32 a4_405;
			word32 a5_406;
			word32 a7_407;
			word32 s2_408;
			word32 s3_409;
			word32 s4_410;
			word32 s5_411;
			word32 s6_412;
			word32 s7_413;
			word32 s8_414;
			word32 s9_415;
			word32 s10_416;
			word32 s11_417;
			word32 t4_418;
			word32 a0_419;
			word32 a1_420;
			word32 a2_421;
			word32 a3_422;
			word32 a4_423;
			word32 a5_424;
			word32 a7_425;
			word32 s2_426;
			word32 s3_427;
			word32 s4_428;
			word32 s5_429;
			word32 s6_430;
			word32 s7_431;
			word32 s8_432;
			word32 s9_433;
			word32 s10_434;
			word32 s11_435;
			word32 t4_436;
			Eq_2 ra_219 = bl_main_apm_start(printf(printf(printf(ra_34, &g_t2307D2DC, a3_88, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_383, out a0_384, out a1_385, out a2_386, out a3_117, out a4_387, out a5_388, out a7_389, out s2_390, out s3_391, out s4_392, out s5_393, out s6_394, out s7_395, out s8_396, out s9_397, out s10_398, out s11_399, out t4_400), &g_t2307D300, a3_117, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_401, out a0_402, out a1_403, out a2_404, out a3_143, out a4_405, out a5_406, out a7_407, out s2_408, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out s9_415, out s10_416, out s11_417, out t4_418), &g_t2307D324, a3_143, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_183, out a0_419, out a1_420, out a2_421, out a3_422, out a4_423, out a5_424, out a7_425, out s2_426, out s3_427, out s4_428, out s5_429, out s6_430, out s7_431, out s8_432, out s9_433, out s10_434, out s11_435, out t4_436), netifapi_netif_common(ra_34, netifapi_netif_common(ra_34, s0_35, a3_28, a4_29, a5_30, s2_39, mstatus_33, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_61, out a4_62, out a5_63, out s2_68), a3_61, a4_62, a5_63, s2_68, mstatus_33, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_88, out a4_380, out a5_381, out s2_382), s1_183, mstatus_33, s0, dwArg10, dwArg14, dwArg44, dwArg5C, s1, dwArg88, dwArgA8, dwArgC8, out s1_221, out a0_210, out a3_213, out a4_214, out mstatus_218);
			*(union Eq_2 *) 0x09 = s1_221;
			struct Eq_604 * a4_244;
			word32 s0_437;
			word32 a0_438;
			word32 a1_439;
			word32 a3_440;
			aos_post_event(dns_server_init(ra_219, s1_221, a0_210, a3_213, a4_214, mstatus_218, dwArg10, dwArg14, dwArg5C, dwArg0108, dwArg0148, out a4_244), 0x02, a4_244, dwArg04, out s0_437, out a0_438, out a1_439, out a3_440);
		}
	}
}

