pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025642: void stateGlobalGuard_scan_beacon(Register Eq_2 ra, Register (ptr32 Eq_113070) s0, Register word32 a0, Stack word32 dwArg0198)
void stateGlobalGuard_scan_beacon(Eq_2 ra, struct Eq_113070 * s0, word32 a0, word32 dwArg0198)
{
	if (a0 == (word32) s0->b0000)
	{
		int32 a4_37 = (word32) s0->b003B;
		if (*(int32 *) 0x4301EC0C < a4_37 || (a4_37 == 0x00 || (word32) s0->b000D == 0x00 && (g_dw4201FC14 & 0x01) == 0x00))
			goto l230257F4;
		word32 a5_544;
		Eq_2 a0_45 = xTaskGetTickCount(out a5_544);
		struct Eq_113100 * s4_167 = &g_b4201E448;
		word32 s8_291 = 0x00;
		int32 s7_293 = ~0x00;
		int32 s1_173 = ~0x00;
		int32 s9_161 = ~0x00;
		int32 s3_163;
		for (s3_163 = 0x00; s3_163 != 50; ++s3_163)
		{
			if (g_dw4201FC0C < (word32) s4_167->b02AA)
			{
				word32 a5_551;
				word32 a0_546;
				word32 t1_545;
				word32 a1_547;
				word32 a3_549;
				word32 a4_550;
				word32 a2_548;
				ra = memset(ra, (char *) s4_167 + 636, 0x00, 60, out t1_545, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551);
				s4_167->b02B0 = 0x00;
				goto l230256D8;
			}
			if ((word32) s4_167->b02B0 != 0x00)
			{
				int32 a4_64 = s4_167->dw02B4;
				if (s8_291 == 0x00 || a4_64 - s7_293 < 0x00)
				{
					s7_293 = a4_64;
					s1_173 = s3_163;
				}
				s8_291 = 0x01;
				word32 a2_575;
				word32 a1_574;
				word32 a3_576;
				word32 a4_577;
				word32 a5_578;
				if (memcmp((char *) s4_167 + 676, &s0->b000D + 40, 0x06, out a1_574, out a2_575, out a3_576, out a4_577, out a5_578) == 0x00)
				{
					word32 a1_579;
					word32 a5_583;
					word32 a2_580;
					word32 a4_582;
					word32 a3_581;
					if (strcmp(&s0->b000D, (char *) s4_167 + 636, out a1_579, out a2_580, out a3_581, out a4_582, out a5_583) == 0x00)
					{
						struct Eq_113327 * s1_104 = s3_163 + 60;
						if ((int32) s0->b003C < (int32) s1_104->b4201E6F3)
						{
							word32 a5_584;
							if (xTaskGetTickCount(out a5_584) - s1_104->dw4201E6FC <= 0x00FFFBB7)
								goto l230257F4;
						}
						struct Eq_113349 * a0_124 = s3_163 + 60;
						a0_124->b4201E6F2 = (byte) (word32) s0->b003B;
						a0_124->b4201E6F3 = (byte) (int32) s0->b003C;
						a0_124->b4201E6F4 = (byte) (int32) s0->b003D;
						int32 a5_135 = (int32) s0->b003E;
						a0_124->t4201E6FC = a0_45;
						a0_124->b4201E6F5 = (byte) a5_135;
						a0_124->b4201E6F6 = (byte) (word32) s0->b003F;
						a0_124->b4201E6F7 = (byte) (word32) s0->b0040;
						goto l230257F4;
					}
				}
			}
			else
			{
l230256D8:
				s9_161 = s3_163;
			}
			++s4_167;
		}
		if (s9_161 == ~0x00)
		{
			if (s1_173 == s9_161)
				goto l230257F4;
		}
		else
			s1_173 = s9_161;
		struct Eq_113158 * s1_180 = s1_173 + 60;
		word32 a5_558;
		word32 a0_553;
		word32 t1_552;
		word32 a1_554;
		word32 a3_556;
		word32 a4_557;
		word32 a2_555;
		memset(ra, (char *) s1_180 + 1107420868, 0x00, 60, out t1_552, out a0_553, out a1_554, out a2_555, out a3_556, out a4_557, out a5_558);
		word32 a4_560;
		word32 a5_561;
		word32 a3_559;
		strncpy((char *) s1_180 + 1107420868, &s0->b000D, 32, out a3_559, out a4_560, out a5_561);
		s1_180->b4201E6E4 = 0x00;
		word32 a4_565;
		word32 a2_563;
		word32 a3_564;
		word32 a5_566;
		word32 a1_562;
		s1_180->t4201E6E8 = strlen((char *) s1_180 + 1107420868, out a1_562, out a2_563, out a3_564, out a4_565, out a5_566);
		word32 a4_570;
		word32 a2_568;
		word32 a3_569;
		word32 a1_567;
		word32 a5_571;
		word32 a6_572;
		word32 a7_573;
		memcpy((char *) &s1_180->t4201E6E8 + 4, &s0->b000D + 40, 0x06, out a1_567, out a2_568, out a3_569, out a4_570, out a5_571, out a6_572, out a7_573);
		s1_180->b4201E6F2 = (byte) (word32) s0->b003B;
		int32 a5_247 = (int32) s0->b003C;
		s1_180->t4201E6FC = a0_45;
		s1_180->b4201E6F3 = (byte) a5_247;
		s1_180->b4201E6F6 = (byte) (word32) s0->b003F;
		s1_180->b4201E6F7 = (byte) (word32) s0->b0040;
		s1_180->b4201E6F8 = 0x01;
	}
l230257F4:
	0x00 = dwArg0198;
}

// 2302582E: void __reload_tsen(Register Eq_2 ra, Register (ptr32 Eq_111400) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void __reload_tsen(Eq_2 ra, struct Eq_111400 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	word32 a3_60;
	pvTimerGetTimerID(a0, a3, a4, mstatus, out a3_60);
	wifi_mgmr_api_fw_tsen_reload(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 2302583E: void event_cb_wifi_event_mgmr(Register Eq_2 ra, Register (ptr32 Eq_113446) a0, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void event_cb_wifi_event_mgmr(Eq_2 ra, struct Eq_113446 * a0, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if ((word32) a0->w0006 != 0x14)
		return;
	aos_post_delayed_action(ra, 0x0055, 587356252, mstatus, dwArg20, dwArg24, dwArg0118, dwArg0158);
}

// 2302585C: void trigger_auto_denoise(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void trigger_auto_denoise(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (g_dw4200DDC4 == 0x00)
		return;
	ptr32 mstatus_19;
	Eq_2 ra_20 = wifi_mgmr_api_denoise_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out mstatus_19);
	aos_post_delayed_action(ra_20, 0x0055, 587356252, mstatus_19, dwArg20, dwArg24, dwArg0118, dwArg0158);
}

