pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025886: void stateDisconnect_exit(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_113523) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void stateDisconnect_exit(Eq_2 ra, Eq_2 s1, struct Eq_113523 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	Eq_2 a3_21;
	word32 s1_207;
	word32 a0_208;
	word32 a1_209;
	word32 a2_210;
	word32 a4_211;
	word32 a5_212;
	word32 a7_213;
	word32 s2_214;
	word32 s3_215;
	word32 s4_216;
	word32 s5_217;
	word32 s6_218;
	word32 s7_219;
	word32 s8_220;
	word32 s9_221;
	word32 s10_222;
	word32 s11_223;
	word32 t4_224;
	Eq_2 ra_24 = printf(ra, &g_t2307D67C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_207, out a0_208, out a1_209, out a2_210, out a3_21, out a4_211, out a5_212, out a7_213, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220, out s9_221, out s10_222, out s11_223, out t4_224);
	if ((word32) a0->b004C == 0x00)
	{
		word32 s1_263;
		word32 a0_264;
		word32 a1_265;
		word32 a2_266;
		word32 a3_267;
		word32 a4_268;
		word32 a5_269;
		word32 a7_270;
		word32 s2_271;
		word32 s3_272;
		word32 s4_273;
		word32 s5_274;
		word32 s6_275;
		word32 s7_276;
		word32 s8_277;
		word32 s9_278;
		word32 s10_279;
		word32 s11_280;
		word32 t4_281;
		printf(ra_24, &g_t2307D22C, a3_21, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a7_270, out s2_271, out s3_272, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out s9_278, out s10_279, out s11_280, out t4_281);
	}
	else
	{
		Eq_2 a5_70;
		word32 s1_225;
		word32 a0_226;
		word32 a1_227;
		word32 a2_228;
		word32 a3_229;
		word32 a4_230;
		word32 a7_231;
		word32 s2_232;
		word32 s3_233;
		word32 s4_234;
		word32 s5_235;
		word32 s6_236;
		word32 s7_237;
		word32 s8_238;
		word32 s9_239;
		word32 s10_240;
		word32 s11_241;
		word32 t4_242;
		printf(ra_24, &g_t2307D21C, a3_21, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_225, out a0_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_70, out a7_231, out s2_232, out s3_233, out s4_234, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241, out t4_242);
		Eq_2 a5_100;
		Eq_2 s1_103;
		word32 a0_243;
		word32 a3_244;
		word32 a4_245;
		word32 s2_246;
		word32 s3_247;
		word32 s4_248;
		word32 s5_249;
		word32 s6_250;
		word32 s8_251;
		xTimerGenericCommand((char *) a0 + 32, 0x03, null, 0x00, a5_70, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_103, out a0_243, out a3_244, out a4_245, out a5_100, out s2_246, out s3_247, out s4_248, out s5_249, out s6_250, out s8_251);
		word32 s1_252;
		word32 a0_253;
		word32 a3_254;
		word32 a4_255;
		word32 a5_256;
		word32 s2_257;
		word32 s3_258;
		word32 s4_259;
		word32 s5_260;
		word32 s6_261;
		word32 s8_262;
		((word32) xTimerGenericCommand(s1_103, 0x05, null, 0x00, a5_100, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_252, out a0_253, out a3_254, out a4_255, out a5_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s8_262) + 76)->u1 = 0x00;
	}
}

// 230258F2: void disconnect_retry(Register Eq_2 ra, Register (ptr32 Eq_111400) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void disconnect_retry(Eq_2 ra, struct Eq_111400 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	word32 a0_18;
	Eq_2 a3_21;
	Eq_2 ra_26 = wifi_mgmr_profile_get(ra, &g_b4201E448, pvTimerGetTimerID(a0, a3, a4, mstatus, out a3_12) + 77, a3_12, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, out a0_18, out a3_21);
	if (a0_18 == 0x00)
	{
		Eq_2 s4_61;
		word32 s1_182;
		word32 a0_183;
		word32 a1_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a7_189;
		word32 s2_190;
		word32 s3_191;
		word32 s5_192;
		word32 s6_193;
		word32 s7_194;
		word32 s8_195;
		word32 s9_196;
		word32 s10_197;
		word32 s11_198;
		word32 t4_199;
		Eq_2 ra_55 = printf(ra_26, &g_t2307CED0, a3_21, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_182, out a0_183, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a7_189, out s2_190, out s3_191, out s4_61, out s5_192, out s6_193, out s7_194, out s8_195, out s9_196, out s10_197, out s11_198, out t4_199);
		wifi_mgmr_api_reconnect(ra_55, s4_61, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_200;
		word32 a0_201;
		word32 a1_202;
		word32 a2_203;
		word32 a3_204;
		word32 a4_205;
		word32 a5_206;
		word32 a7_207;
		word32 s2_208;
		word32 s3_209;
		word32 s4_210;
		word32 s5_211;
		word32 s6_212;
		word32 s7_213;
		word32 s8_214;
		word32 s9_215;
		word32 s10_216;
		word32 s11_217;
		word32 t4_218;
		printf(ra_26, &g_t2307CE88, a3_21, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_200, out a0_201, out a1_202, out a2_203, out a3_204, out a4_205, out a5_206, out a7_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214, out s9_215, out s10_216, out s11_217, out t4_218);
	}
}

