pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025930: void stateGlobalGuard_fw_disconnect(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 byte) a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateGlobalGuard_fw_disconnect(Eq_2 ra, Eq_2 a3, byte * a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if ((word32) *a5 != 0x0F)
		return;
	Eq_2 a5_16;
	Eq_2 a3_20;
	Eq_2 a4_21;
	Eq_2 s3_28;
	word32 s1_140;
	word32 a0_141;
	word32 a1_142;
	word32 a2_143;
	word32 a7_144;
	word32 s2_145;
	word32 s4_146;
	word32 s5_147;
	word32 s6_148;
	word32 s7_149;
	word32 s8_150;
	word32 s9_151;
	word32 s10_152;
	word32 s11_153;
	word32 t4_154;
	bl_main_disconnect(printf(ra, &g_t2307D3D8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_140, out a0_141, out a1_142, out a2_143, out a3_20, out a4_21, out a5_16, out a7_144, out s2_145, out s3_28, out s4_146, out s5_147, out s6_148, out s7_149, out s8_150, out s9_151, out s10_152, out s11_153, out t4_154), a3_20, a4_21, a5_16, s3_28, mstatus, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

// 2302595C: void stateConnectedIPYes_exit(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateConnectedIPYes_exit(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a5_15;
	Eq_2 a3_19;
	Eq_2 a4_20;
	Eq_2 s2_26;
	word32 a0_190;
	word32 s1_189;
	word32 a1_191;
	word32 a2_192;
	word32 a7_193;
	word32 s3_194;
	word32 s4_195;
	word32 s5_196;
	word32 s6_197;
	word32 s7_198;
	word32 s8_199;
	word32 s9_200;
	word32 s10_201;
	word32 s11_202;
	word32 t4_203;
	Eq_2 ra_22 = printf(ra, &g_t2307D67C, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_19, out a4_20, out a5_15, out a7_193, out s2_26, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	Eq_2 a4_46;
	Eq_2 a5_47;
	Eq_2 s2_52;
	Eq_2 a4_73;
	Eq_2 s3_80;
	word32 a3_204;
	Eq_2 a3_72 = netifapi_netif_set_addr(ra_22, netifapi_netif_common(ra_22, 0x4201E000, a3_19, a4_20, a5_15, s2_26, mstatus, dwArg68, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_204, out a4_46, out a5_47, out s2_52), fp + ~0x13, fp + ~0x13, fp + ~0x13, a4_46, a5_47, s2_52, mstatus, dwArg68, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a4_73, out s3_80);
	Eq_2 a5_93 = *a4_73;
	if (a4_73 != 0x00)
	{
		*a5_93 = 0x00;
		word32 a4_205;
		bl_main_denoise(ra_22, a3_72, a4_73, a5_93, s3_80, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, ra, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a4_205);
	}
}

// 230259B4: void stateGlobalGuard_denoise(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobalGuard_denoise(Eq_2 ra, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) *a3 != 0x0C)
		return;
	Eq_2 a5_22;
	Eq_2 a4_18 = (word32) *((word32) a3 + 2) << 8 | (word32) (*((word32) a3 + 1)) | (word32) (*((word32) a3 + 3)) << 16;
	if (((word32) *((word32) a3 + 4) << 24 | a4_18) != 0x00)
	{
		a4_18 = g_t4201FB60;
		if (a4_18 != 587714584)
			return;
		a5_22 = *a4_18;
		if (a4_18 == 0x00)
		{
			*(union Eq_2 *) 0x01 = a5_22;
			struct Eq_604 * a4_77;
			word32 s0_234;
			word32 a0_235;
			word32 a1_236;
			word32 a3_237;
			aos_post_event(bl_main_denoise(ra, a3, 0x01, a5_22, s3, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a4_77), 0x02, a4_77, dwArg14, out s0_234, out a0_235, out a1_236, out a3_237);
			return;
		}
	}
	else
	{
		g_dw4200EDC4 = 0x00;
		a5_22.u0 = 0x4200E000;
	}
	word32 a4_233;
	bl_main_denoise(ra, a3, a4_18, a5_22, s3, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a4_233);
}

// 23025A38: void stateIdleGuard_connect(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register (ptr32 byte) a5, Register Eq_2 s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack ptr32 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack word32 dwArgC0, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void stateIdleGuard_connect(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, byte * a5, Eq_2 s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, ptr32 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgB8, word32 dwArgC0, word32 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	if (a0 != (word32) (*a5))
		return;
	word32 a0_24;
	Eq_2 a3_27;
	word32 mstatus_193;
	word32 s2_192;
	word32 a5_191;
	word32 a4_190;
	word32 s0_189;
	Eq_2 ra_33 = bl_main_if_add(ra, s0, 0x01, a3, s2, s3, s4, mstatus, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg98, dwArgA4, dwArgB8, dwArgC0, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s0_189, out a0_24, out a3_27, out a4_190, out a5_191, out s2_192, out mstatus_193);
	if (a0_24 != 0x00)
	{
		word32 a0_195;
		word32 s1_194;
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		word32 a7_201;
		word32 s2_202;
		word32 s3_203;
		word32 s4_204;
		word32 s5_205;
		word32 s6_206;
		word32 s7_207;
		word32 s8_208;
		word32 s9_209;
		word32 s10_210;
		word32 s11_211;
		word32 t4_212;
		printf(ra_33, &g_t2307D5D0, a3_27, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_194, out a0_195, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200, out a7_201, out s2_202, out s3_203, out s4_204, out s5_205, out s6_206, out s7_207, out s8_208, out s9_209, out s10_210, out s11_211, out t4_212);
	}
}

// 23025A84: void stateIfaceDownGuard_phyup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 byte) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateIfaceDownGuard_phyup(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, byte * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a5_8 = (word32) *a5;
	if (a0 != a5_8)
	{
		word32 s1_130;
		word32 a0_131;
		word32 a1_132;
		word32 a2_133;
		word32 a3_134;
		word32 a4_135;
		word32 a5_136;
		word32 a7_137;
		word32 s2_138;
		word32 s3_139;
		word32 s4_140;
		word32 s5_141;
		word32 s6_142;
		word32 s7_143;
		word32 s8_144;
		word32 s9_145;
		word32 s10_146;
		word32 s11_147;
		word32 t4_148;
		printf(ra, &g_t2307D610, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_130, out a0_131, out a1_132, out a2_133, out a3_134, out a4_135, out a5_136, out a7_137, out s2_138, out s3_139, out s4_140, out s5_141, out s6_142, out s7_143, out s8_144, out s9_145, out s10_146, out s11_147, out t4_148);
	}
	else
		bl_main_phy_up(ra, s0, a3, a4, a5_8, s3, mstatus, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

// 23025AB0: void stateSnifferGuard_raw_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118, Stack Eq_2 dwArg0128)
void stateSnifferGuard_raw_send(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0118, Eq_2 dwArg0128)
{
	Eq_2 a4_6 = g_t4201FB60;
	if (a4_6 == 587715896 || (a4_6 == 587716084 || (word32) g_b2307D5F4 != 0x15))
		return;
	Eq_2 a4_31 = (word32) g_b2307D5F7 << 16 | ((word32) g_b2307D5F6 << 8 | (word32) g_b2307D5F5);
	bl_main_raw_send(ra, s0, (word32) g_b2307D5F8 << 24 | a4_31, (word32) g_b2307D5FB << 16 | ((word32) g_b2307D5FA << 8 | (word32) g_b2307D5F9), a4_31, 587716084, s2, s3, mstatus, dwArg00, dwArg04, dwArg28, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128);
}

