pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025B2C: void stateGlobalGuard_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register (ptr32 byte) a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateGlobalGuard_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, byte * a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if ((word32) *a5 != 0x09)
		return;
	Eq_2 a3_26;
	Eq_2 a3_48;
	ptr32 mstatus_53;
	Eq_2 a3_78;
	Eq_2 s2_85;
	Eq_2 s4_87;
	word32 s1_365;
	word32 a0_366;
	word32 a1_367;
	word32 a2_368;
	word32 a4_369;
	word32 a5_370;
	word32 a7_371;
	word32 s2_372;
	word32 s3_373;
	word32 s4_374;
	word32 s5_375;
	word32 s6_376;
	word32 s7_377;
	word32 s8_378;
	word32 s9_379;
	word32 s10_380;
	word32 s11_381;
	word32 t4_382;
	word32 s1_383;
	word32 a0_384;
	word32 a1_385;
	word32 a2_386;
	word32 a4_387;
	word32 a5_388;
	word32 a7_389;
	word32 s3_390;
	word32 s5_391;
	word32 s6_392;
	word32 s7_393;
	word32 s8_394;
	word32 s9_395;
	word32 s10_396;
	word32 s11_397;
	word32 t4_398;
	Eq_2 ra_81 = printf(bl_main_apm_stop(printf(ra, &g_t2307D468, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_365, out a0_366, out a1_367, out a2_368, out a3_26, out a4_369, out a5_370, out a7_371, out s2_372, out s3_373, out s4_374, out s5_375, out s6_376, out s7_377, out s8_378, out s9_379, out s10_380, out s11_381, out t4_382), 0x4201E448, a3_26, mstatus, dwLoc10, s0, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg50, dwArg54, dwArg5C, dwArg6C, dwArg78, dwArg9C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a3_48, out mstatus_53), &g_t2307D48C, a3_48, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_383, out a0_384, out a1_385, out a2_386, out a3_78, out a4_387, out a5_388, out a7_389, out s2_85, out s3_390, out s4_87, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
	Eq_2 s0_99 = bl_main_apm_remove_all_sta(ra_81, s2_85, s4_87, mstatus_53, dwArg00, dwArg04, dwArg1C, dwArg4C, dwArg78, dwArg98, dwArgB8, dwArgD8, dwArgF8);
	Eq_2 a3_113;
	Eq_2 a3_134;
	ptr32 mstatus_139;
	Eq_2 a5_160;
	Eq_2 a3_164;
	Eq_2 a4_165;
	Eq_2 s2_171;
	word32 s1_399;
	word32 a0_400;
	word32 a1_401;
	word32 a2_402;
	word32 a4_403;
	word32 a5_404;
	word32 a7_405;
	word32 s2_406;
	word32 s3_407;
	word32 s4_408;
	word32 s5_409;
	word32 s6_410;
	word32 s7_411;
	word32 s8_412;
	word32 s9_413;
	word32 s10_414;
	word32 s11_415;
	word32 t4_416;
	word32 s1_417;
	word32 a0_418;
	word32 a1_419;
	word32 a2_420;
	word32 a7_421;
	word32 s3_422;
	word32 s4_423;
	word32 s5_424;
	word32 s6_425;
	word32 s7_426;
	word32 s8_427;
	word32 s9_428;
	word32 s10_429;
	word32 s11_430;
	word32 t4_431;
	Eq_2 ra_167 = printf(bl_main_if_remove(printf(ra_81, &g_t2307D4C0, a3_78, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_399, out a0_400, out a1_401, out a2_402, out a3_113, out a4_403, out a5_404, out a7_405, out s2_406, out s3_407, out s4_408, out s5_409, out s6_410, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415, out t4_416), s0_99, a3_113, mstatus_53, dwLoc10, s0, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg50, dwArg54, dwArg5C, dwArg6C, dwArg78, dwArg9C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a3_134, out mstatus_139), &g_t2307D4E4, a3_134, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_417, out a0_418, out a1_419, out a2_420, out a3_164, out a4_165, out a5_160, out a7_421, out s2_171, out s3_422, out s4_423, out s5_424, out s6_425, out s7_426, out s8_427, out s9_428, out s10_429, out s11_430, out t4_431);
	Eq_2 a3_188;
	word32 a4_432;
	word32 a5_433;
	word32 s2_434;
	Eq_2 s0_193 = netifapi_netif_common(ra_167, s0_99, a3_164, a4_165, a5_160, s2_171, mstatus_139, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a3_188, out a4_432, out a5_433, out s2_434);
	Eq_2 a5_211;
	Eq_2 a3_215;
	Eq_2 a4_216;
	Eq_2 s2_222;
	word32 s1_435;
	word32 a0_436;
	word32 a1_437;
	word32 a2_438;
	word32 a7_439;
	word32 s3_440;
	word32 s4_441;
	word32 s5_442;
	word32 s6_443;
	word32 s7_444;
	word32 s8_445;
	word32 s9_446;
	word32 s10_447;
	word32 s11_448;
	word32 t4_449;
	Eq_2 ra_218 = printf(ra_167, &g_t2307D510, a3_188, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_435, out a0_436, out a1_437, out a2_438, out a3_215, out a4_216, out a5_211, out a7_439, out s2_222, out s3_440, out s4_441, out s5_442, out s6_443, out s7_444, out s8_445, out s9_446, out s10_447, out s11_448, out t4_449);
	struct Eq_604 * a4_240;
	word32 a3_450;
	word32 a5_451;
	word32 s2_452;
	*((word32) netifapi_netif_common(ra_218, s0_193, a3_215, a4_216, a5_211, s2_222, mstatus_139, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a3_450, out a4_240, out a5_451, out s2_452) + 8) = 0x00;
	word32 s0_453;
	word32 a0_454;
	word32 a1_455;
	word32 a3_456;
	aos_post_event(ra_218, 0x02, a4_240, dwArg14, out s0_453, out a0_454, out a1_455, out a3_456);
}

// 23025BDE: void stateGlobalGuard_enable_autoreconnect(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register (ptr32 byte) a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void stateGlobalGuard_enable_autoreconnect(Eq_2 ra, word32 a0, Eq_2 a3, byte * a5, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if (a0 != (word32) (*a5))
		return;
	word32 s1_93;
	word32 a0_94;
	word32 a1_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 a5_99;
	word32 a7_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s8_107;
	word32 s9_108;
	word32 s10_109;
	word32 s11_110;
	word32 t4_111;
	printf(ra, &g_t2307D3C0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_93, out a0_94, out a1_95, out a2_96, out a3_97, out a4_98, out a5_99, out a7_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s8_107, out s9_108, out s10_109, out s11_110, out t4_111);
	wifi_mgmr_profile_autoreconnect_enable(&g_b4201E448);
}

// 23025C12: void stateGlobalGuard_disable_autoreconnect(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register (ptr32 byte) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateGlobalGuard_disable_autoreconnect(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, byte * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 != (word32) (*a5))
		return;
	if (*(int32 *) 1124199264 == 0x2307D088)
	{
		Eq_2 a3_60;
		Eq_2 a3_84;
		word32 s1_259;
		word32 a0_260;
		word32 a1_261;
		word32 a2_262;
		word32 a4_263;
		word32 a5_264;
		word32 a7_265;
		word32 s2_266;
		word32 s3_267;
		word32 s4_268;
		word32 s5_269;
		word32 s6_270;
		word32 s7_271;
		word32 s8_272;
		word32 s9_273;
		word32 s10_274;
		word32 s11_275;
		word32 t4_276;
		word32 s1_277;
		word32 a0_278;
		word32 a1_279;
		word32 a2_280;
		word32 a4_281;
		word32 a5_282;
		word32 a7_283;
		word32 s2_284;
		word32 s3_285;
		word32 s4_286;
		word32 s5_287;
		word32 s6_288;
		word32 s7_289;
		word32 s8_290;
		word32 s9_291;
		word32 s10_292;
		word32 s11_293;
		word32 t4_294;
		word32 a3_295;
		word32 mstatus_296;
		bl_main_if_remove(printf(printf(ra, &g_t2307D378, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_259, out a0_260, out a1_261, out a2_262, out a3_60, out a4_263, out a5_264, out a7_265, out s2_266, out s3_267, out s4_268, out s5_269, out s6_270, out s7_271, out s8_272, out s9_273, out s10_274, out s11_275, out t4_276), &g_t2307D0A4, a3_60, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_277, out a0_278, out a1_279, out a2_280, out a3_84, out a4_281, out a5_282, out a7_283, out s2_284, out s3_285, out s4_286, out s5_287, out s6_288, out s7_289, out s8_290, out s9_291, out s10_292, out s11_293, out t4_294), 0x4201E000, a3_84, mstatus, dwLoc10, s0, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg50, dwArg54, dwArg5C, dwArg6C, dwArg78, dwArg9C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a3_295, out mstatus_296);
	}
	else
	{
		word32 s1_240;
		word32 a0_241;
		word32 a1_242;
		word32 a2_243;
		word32 a3_244;
		word32 a4_245;
		word32 a5_246;
		word32 a7_247;
		word32 s2_248;
		word32 s3_249;
		word32 s4_250;
		word32 s5_251;
		word32 s6_252;
		word32 s7_253;
		word32 s8_254;
		word32 s9_255;
		word32 s10_256;
		word32 s11_257;
		word32 t4_258;
		printf(ra, &g_t2307D3A4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_240, out a0_241, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a7_247, out s2_248, out s3_249, out s4_250, out s5_251, out s6_252, out s7_253, out s8_254, out s9_255, out s10_256, out s11_257, out t4_258);
		wifi_mgmr_profile_autoreconnect_disable(&g_b4201E448);
	}
}

// 23025C8A: void stateDisconnect_enter(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void stateDisconnect_enter(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 s6_149;
	struct Eq_604 * a4_140;
	Eq_2 ra_106;
	Eq_2 a3_25;
	int32 a7_27;
	Eq_2 s1_29;
	word32 a0_443;
	word32 a4_446;
	word32 a2_445;
	word32 a1_444;
	word32 a5_447;
	word32 s2_448;
	word32 s3_449;
	word32 s4_450;
	word32 s5_451;
	word32 s6_452;
	word32 s7_453;
	word32 s8_454;
	word32 s9_455;
	word32 s10_456;
	word32 s11_457;
	word32 t4_458;
	Eq_2 ra_28 = printf(ra, &g_t2307D298, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_29, out a0_443, out a1_444, out a2_445, out a3_25, out a4_446, out a5_447, out a7_27, out s2_448, out s3_449, out s4_450, out s5_451, out s6_452, out s7_453, out s8_454, out s9_455, out s10_456, out s11_457, out t4_458);
	if (wifi_mgmr_profile_autoreconnect_is_enabled(&g_b4201E448) != 0x00)
	{
		Eq_2 a3_94;
		word32 s1_476;
		xTimerCreateStatic((struct Eq_111562 *) 2000, s1_29, 0x230258F2, (word32) s1_29 + 32, a7_27, mstatus, s2, dwArgC8, dwArg0108, out s1_476, out a3_94);
		Eq_2 s2_110;
		word32 s1_477;
		word32 a0_478;
		word32 a1_479;
		word32 a2_480;
		word32 a3_481;
		word32 a4_482;
		word32 a5_483;
		word32 a7_484;
		word32 s3_485;
		word32 s4_486;
		word32 s5_487;
		word32 s6_488;
		word32 s7_489;
		word32 s8_490;
		word32 s9_491;
		word32 s10_492;
		word32 s11_493;
		word32 t4_494;
		ra_106 = printf(ra_28, &g_t2307D1B4, a3_94, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_477, out a0_478, out a1_479, out a2_480, out a3_481, out a4_482, out a5_483, out a7_484, out s2_110, out s3_485, out s4_486, out s5_487, out s6_488, out s7_489, out s8_490, out s9_491, out s10_492, out s11_493, out t4_494);
		Eq_2 a5_121;
		xTaskGetTickCount(out a5_121);
		struct Eq_115140 * s1_132;
		word32 a0_495;
		word32 a3_496;
		word32 a5_497;
		word32 s2_498;
		word32 s3_499;
		word32 s4_500;
		word32 s5_501;
		word32 s8_502;
		xTimerGenericCommand(s2_110, 0x01, null, ~0x00, a5_121, mstatus, dwArg44, dwArgB8, dwArgC8, dwArgF8, dwArg0138, out s1_132, out a0_495, out a3_496, out a4_140, out a5_497, out s2_498, out s3_499, out s4_500, out s5_501, out s6_149, out s8_502);
		s1_132->b004C = 0x01;
	}
	else
	{
		word32 s1_459;
		word32 a0_460;
		word32 a1_461;
		word32 a2_462;
		word32 a3_463;
		word32 a5_464;
		word32 a7_465;
		word32 s2_466;
		word32 s3_467;
		word32 s4_468;
		word32 s5_469;
		word32 s7_470;
		word32 s8_471;
		word32 s9_472;
		word32 s10_473;
		word32 s11_474;
		word32 t4_475;
		ra_106 = printf(ra_28, &g_t2307D1D8, a3_25, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_459, out a0_460, out a1_461, out a2_462, out a3_463, out a4_140, out a5_464, out a7_465, out s2_466, out s3_467, out s4_468, out s5_469, out s6_149, out s7_470, out s8_471, out s9_472, out s10_473, out s11_474, out t4_475);
	}
	word32 s0_506;
	word32 a0_507;
	word32 a1_508;
	word32 a3_509;
	Eq_2 ra_169 = aos_post_event(ra_106, 0x02, a4_140, dwArg04, out s0_506, out a0_507, out a1_508, out a3_509);
	struct Eq_115169 * s0_182 = &g_t4201F448;
	struct Eq_604 * a4_178;
	ui32 a5_179;
	Eq_2 a3_177;
	if ((bl60x_check_mac_status(fp + ~0x13, out a3_177, out a4_178, out a5_179) | a5_179) == 0x00)
	{
		Eq_2 a3_190;
		word32 s0_503;
		word32 a0_504;
		word32 a1_505;
		ra_169 = helper_record_dump(aos_post_event(ra_169, 0x02, a4_178, dwArg04, out s0_503, out a0_504, out a1_505, out a3_190), a3_190, s6_149, s2, dwArg08, dwArg20, dwArg24, dwArg48, dwArg50, dwArg54, ra, dwArg78, dwArg9C, dwArg0108, out s0_182, out a3_177);
	}
	if ((s0_182->dw07C8 & 0x01) != 0x00)
	{
		Eq_2 a5_233;
		Eq_2 a3_237;
		Eq_2 a4_238;
		Eq_2 s3_245;
		word32 s1_510;
		word32 a0_511;
		word32 a1_512;
		word32 a2_513;
		word32 a7_514;
		word32 s2_515;
		word32 s4_516;
		word32 s5_517;
		word32 s6_518;
		word32 s7_519;
		word32 s8_520;
		word32 s9_521;
		word32 s10_522;
		word32 s11_523;
		word32 t4_524;
		struct Eq_115240 * s0_266 = bl_main_scan(printf(ra_169, &g_t2307D1FC, a3_177, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_510, out a0_511, out a1_512, out a2_513, out a3_237, out a4_238, out a5_233, out a7_514, out s2_515, out s3_245, out s4_516, out s5_517, out s6_518, out s7_519, out s8_520, out s9_521, out s10_522, out s11_523, out t4_524), a3_237, a4_238, a5_233, s3_245, mstatus, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg4C, dwArg5C, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138);
		s0_266->dw07C8 &= ~0x01;
	}
}

// 23025D6E: void stateGlobalGuard_fw_scan(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register (ptr32 byte) a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateGlobalGuard_fw_scan(Eq_2 ra, Eq_2 s0, Eq_2 a3, byte * a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if ((word32) *a5 != 0x12)
		return;
	Eq_2 a5_16 = g_t4201FB60;
	if (a5_16 != 587714668 && (a5_16 != 587714356 && a5_16 != 0x2307D088))
	{
		if (a5_16 != 587715896 && (a5_16 != 587714584 && a5_16 != 0x2307D62C))
		{
			struct Eq_604 * a4_97;
			word32 s1_330;
			word32 a0_331;
			word32 a1_332;
			word32 a2_333;
			word32 a3_334;
			word32 a5_335;
			word32 a7_336;
			word32 s2_337;
			word32 s3_338;
			word32 s4_339;
			word32 s5_340;
			word32 s6_341;
			word32 s7_342;
			word32 s8_343;
			word32 s9_344;
			word32 s10_345;
			word32 s11_346;
			word32 t4_347;
			word32 s0_348;
			word32 a0_349;
			word32 a1_350;
			word32 a3_351;
			aos_post_event(printf(ra, &g_t2307D438, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_330, out a0_331, out a1_332, out a2_333, out a3_334, out a4_97, out a5_335, out a7_336, out s2_337, out s3_338, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out s9_344, out s10_345, out s11_346, out t4_347), 0x02, a4_97, dwArg14, out s0_348, out a0_349, out a1_350, out a3_351);
		}
		else
		{
			Eq_2 a5_39;
			Eq_2 a3_43;
			Eq_2 a4_44;
			Eq_2 s3_51;
			word32 s1_315;
			word32 a0_316;
			word32 a1_317;
			word32 a2_318;
			word32 a7_319;
			word32 s2_320;
			word32 s4_321;
			word32 s5_322;
			word32 s6_323;
			word32 s7_324;
			word32 s8_325;
			word32 s9_326;
			word32 s10_327;
			word32 s11_328;
			word32 t4_329;
			bl_main_scan(printf(ra, &g_t2307D450, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_315, out a0_316, out a1_317, out a2_318, out a3_43, out a4_44, out a5_39, out a7_319, out s2_320, out s3_51, out s4_321, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out s10_327, out s11_328, out t4_329), a3_43, a4_44, a5_39, s3_51, mstatus, dwLoc10, s0, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
		}
	}
	else
	{
		word32 a1_298;
		word32 a2_299;
		word32 a0_297;
		word32 s1_296;
		word32 a3_300;
		word32 a4_301;
		word32 a5_302;
		word32 a7_303;
		word32 s2_304;
		word32 s3_305;
		word32 s4_306;
		word32 s5_307;
		word32 s6_308;
		word32 s7_309;
		word32 s8_310;
		word32 s9_311;
		word32 s10_312;
		word32 s11_313;
		word32 t4_314;
		printf(ra, &g_t2307D418, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_296, out a0_297, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a7_303, out s2_304, out s3_305, out s4_306, out s5_307, out s6_308, out s7_309, out s8_310, out s9_311, out s10_312, out s11_313, out t4_314);
		g_dw4201FC10 |= 1;
	}
}

// 23025E2C: void stateDisconnect_guard()
void stateDisconnect_guard()
{
}

