pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025E3A: void stateGlobalExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateGlobalExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E48: void stateSnifferEnter(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateSnifferEnter(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E56: void stateConnectingGuard()
void stateConnectingGuard()
{
}

// 23025E64: void stateConnectingAction_connected(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectingAction_connected(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E72: void stateConnectingAction_disconnect(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectingAction_disconnect(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E80: void stateConnectingExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectingExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D67C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E8E: void stateIdleAction_sniffer(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIdleAction_sniffer(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025E9C: void stateIdleEnter(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIdleEnter(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025EAA: void stateIdleExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIdleExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025EB8: void stateIfaceDownAction_phyup(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIfaceDownAction_phyup(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

