pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23025EC6: void stateIfaceDownEnter(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIfaceDownEnter(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025ED4: void stateIfaceDownExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateIfaceDownExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D67C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025EE2: void stateConnectedIPNoGuard()
void stateConnectedIPNoGuard()
{
}

// 23025EF0: void stateConnectedIPNoAction_disconnect(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectedIPNoAction_disconnect(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025EFE: void stateConnectedIPYesGuard()
void stateConnectedIPYesGuard()
{
}

// 23025F0C: void stateConnectedIPYes_action(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectedIPYes_action(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t2307D648, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 23025F1A: void stateConnectedIPYes_enter(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateConnectedIPYes_enter(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	struct Eq_604 * a4_19;
	Eq_2 a3_42;
	struct Eq_116129 * s0_46;
	word32 s1_165;
	word32 a0_166;
	word32 a1_167;
	word32 a2_168;
	word32 a3_169;
	word32 a5_170;
	word32 a7_171;
	word32 s2_172;
	word32 s3_173;
	word32 s4_174;
	word32 s5_175;
	word32 s6_176;
	word32 s7_177;
	word32 s8_178;
	word32 s9_179;
	word32 s10_180;
	word32 s11_181;
	word32 t4_182;
	word32 a0_183;
	word32 a1_184;
	Eq_2 ra_45 = aos_post_event(printf(ra, &g_t2307D298, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_165, out a0_166, out a1_167, out a2_168, out a3_169, out a4_19, out a5_170, out a7_171, out s2_172, out s3_173, out s4_174, out s5_175, out s6_176, out s7_177, out s8_178, out s9_179, out s10_180, out s11_181, out t4_182), 0x02, a4_19, dwArg14, out s0_46, out a0_183, out a1_184, out a3_42);
	if ((s0_46->dw0C10 & 0x01) != 0x00)
	{
		Eq_2 a5_55;
		Eq_2 a3_59;
		Eq_2 a4_60;
		Eq_2 s3_67;
		word32 s1_185;
		word32 a0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a7_189;
		word32 s2_190;
		word32 s4_191;
		word32 s5_192;
		word32 s6_193;
		word32 s7_194;
		word32 s8_195;
		word32 s9_196;
		word32 s10_197;
		word32 s11_198;
		word32 t4_199;
		struct Eq_115240 * s0_87 = bl_main_scan(printf(ra_45, &g_t2307D1FC, a3_42, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_185, out a0_186, out a1_187, out a2_188, out a3_59, out a4_60, out a5_55, out a7_189, out s2_190, out s3_67, out s4_191, out s5_192, out s6_193, out s7_194, out s8_195, out s9_196, out s10_197, out s11_198, out t4_199), a3_59, a4_60, a5_55, s3_67, mstatus, dwLoc10, s0, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
		s0_87->dw07C8 &= ~0x01;
	}
}

// 23025F6A: Register up32 wifi_mgmr_auth_to_str(Register up32 a0)
// Called from:
//      wifi_mgmr_cli_scanlist
up32 wifi_mgmr_auth_to_str(up32 a0)
{
	if (a0 > 0x05)
		return 0x2307D6E4;
	up32 a0_14;
	g_t2307CE44();
	return a0_14;
}

// 23025FC6: void wifi_mgmr_cipher_to_str(Register word32 a0)
// Called from:
//      wifi_mgmr_cli_scanlist
void wifi_mgmr_cipher_to_str(word32 a0)
{
	if (a0 == 0x00)
		return;
	if (a0 == 0x01)
		return;
	if (a0 == 0x02)
		return;
	if (a0 == 0x03)
		return;
	if (a0 == 0x04)
		;
}

// 2302601C: Register Eq_2 wifi_mgmr_event_notify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_api_ip_update
//      wifi_mgmr_api_reconnect
//      wifi_mgmr_api_disable_autoreconnect
//      wifi_mgmr_api_enable_autoreconnect
//      wifi_mgmr_api_disconnect
//      wifi_mgmr_api_ifaceup
//      wifi_mgmr_api_sniffer_enable
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_fw_disconnect
//      wifi_mgmr_api_fw_tsen_reload
//      wifi_mgmr_api_fw_scan
//      wifi_mgmr_api_fw_powersaving
//      wifi_mgmr_api_ap_start
//      wifi_mgmr_api_ap_stop
//      wifi_mgmr_api_idle
//      wifi_mgmr_api_raw_send
//      wifi_denoise_disable_cmd
//      wifi_denoise_enable_cmd
//      wifi_mgmr_sta_connect
//      wifi_mgmr_rate_config
//      wifi_mgmr_conf_max_sta
//      wifi_mgmr_cfg_req
//      cb_disconnect_ind
//      cb_connect_ind
//      netif_status_callback
Eq_2 wifi_mgmr_event_notify(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 s0_13 = a0;
	struct Eq_116288 * s1_14 = &g_t4201E000;
	Eq_2 s2_15 = 0x2307D000;
	while ((word32) s1_14->b0448 == 0x00)
	{
		Eq_2 a5_25;
		Eq_2 a2_28;
		Eq_2 a3_29;
		Eq_2 a4_30;
		word32 s1_239;
		word32 a0_240;
		word32 a1_241;
		word32 a7_242;
		word32 s2_243;
		word32 s3_244;
		word32 s4_245;
		word32 s5_246;
		word32 s6_247;
		word32 s7_248;
		word32 s8_249;
		word32 s9_250;
		word32 s10_251;
		word32 s11_252;
		word32 t4_253;
		ra = printf(ra, (word32) s2_15 + 1868, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_239, out a0_240, out a1_241, out a2_28, out a3_29, out a4_30, out a5_25, out a7_242, out s2_243, out s3_244, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253);
		word32 a0_254;
		word32 a1_255;
		word32 a2_256;
		word32 a5_257;
		word32 s3_258;
		word32 s8_259;
		s0_13 = vTaskDelay(0x14, a2_28, a3_29, a4_30, a5_25, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_14, out a0_254, out a1_255, out a2_256, out a3, out a4, out a5_257, out s2_15, out s3_258, out s4, out s8_259);
	}
	word32 a0_102;
	ptr32 mstatus_103;
	ptr32 s1_129;
	ptr32 a4_126;
	Eq_2 a3_125;
	ptr32 a1_123;
	ptr32 s3_133;
	Eq_2 ra_104 = xStreamBufferSend(ra, 0x4201F27C, s0_13, (word32) *((word32) s0_13 + 0x0C) << 24 | ((word32) (*((word32) s0_13 + 11)) << 16 | ((word32) (*((word32) s0_13 + 0x0A)) << 8 | (word32) (*((word32) s0_13 + 9)))), ~0x00, a4, s2_15, s4, mstatus, dwArg08, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArg0108, dwArg0148, out s1_129, out a0_102, out a1_123, out a3_125, out a4_126, out s3_133, out mstatus_103);
	ptr32 a5_106 = 0x00;
	if (a0_102 == 0x00)
	{
		word32 a0_260;
		word32 a2_261;
		word32 a5_262;
		word32 a7_263;
		word32 s2_264;
		word32 s4_265;
		word32 s5_266;
		word32 s6_267;
		word32 s7_268;
		word32 s8_269;
		word32 s9_270;
		word32 s10_271;
		word32 s11_272;
		word32 t4_273;
		ra_104 = printf(ra_104, &g_t2307D76C, a3_125, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_129, out a0_260, out a1_123, out a2_261, out a3_125, out a4_126, out a5_262, out a7_263, out s2_264, out s3_133, out s4_265, out s5_266, out s6_267, out s7_268, out s8_269, out s9_270, out s10_271, out s11_272, out t4_273);
		a5_106 = ~0x00;
	}
	0x00 = (uint16) dwArg38;
	s1Out = s1_129;
	a1Out = a1_123;
	a3Out = a3_125;
	a4Out = a4_126;
	a5Out = a5_106;
	s3Out = s3_133;
	mstatusOut = mstatus_103;
	return ra_104;
}

// 230260B0: void wifi_mgmr_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48)
// Called from:
//      _wifi_mgmr_entry
void wifi_mgmr_start(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_116475 fs1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48)
{
	stateM_init(&g_t4201FB60, &g_b2307D5F4, &g_t2307D244);
	int32 s2_47;
	int32 s3_48;
	Eq_2 a3_71;
	int32 a7_91;
	word32 s9_439;
	word32 s5_435;
	word32 a5_431;
	word32 a2_428;
	word32 a0_426;
	word32 s1_424;
	word32 a1_422;
	word32 s0_420;
	word32 s10_440;
	word32 t4_442;
	word32 s11_441;
	word32 s6_436;
	word32 s8_438;
	word32 s7_437;
	word32 s2_432;
	word32 s4_434;
	word32 s3_433;
	word32 a4_430;
	word32 a3_429;
	word32 a1_427;
	word32 s1_425;
	word32 a3_423;
	word32 a0_421;
	Eq_2 ra_177 = printf(hal_sys_capcode_update(aos_post_event(ra, 0x02, aos_register_event_filter(ra, 587356222, 0x00, a3, a4, wifi_mgmr_event_init(), mstatus, dwLocF0, dwLocEC, dwLocE8, dwLocA4, dwArg08, dwArg48, out s2_47, out s3_48), dwLocFC, out s0_420, out a0_421, out a1_422, out a3_423), 0x00FF, 0x00FF, s2_47, s3_48, dwLoc0120, dwLoc011C, dwLocF8, dwLocD8, out s1_424, out a3_71), &g_t2307D794, a3_71, 0x01, dwLocF8, dwLocB0, dwLocAC, dwLoc88, dwLoc64, out s1_425, out a0_426, out a1_427, out a2_428, out a3_429, out a4_430, out a5_431, out a7_91, out s2_432, out s3_433, out s4_434, out s5_435, out s6_436, out s7_437, out s8_438, out s9_439, out s10_440, out s11_441, out t4_442);
	Eq_2 s1_123;
	word32 a3_443;
	xTimerCreateStatic((struct Eq_111562 *) 0x02000710, 0x4200D418, 0x2302582E, &g_t4200D438, a7_91, mstatus, 0x01, dwLoc38, dwArg08, out s1_123, out a3_443);
	Eq_2 a5_135;
	xTaskGetTickCount(out a5_135);
	Eq_2 dwLoc0118_334 = 0x01;
	word32 s5_449;
	word32 a0_445;
	word32 s6_450;
	word32 s8_451;
	word32 a3_446;
	word32 s3_448;
	word32 s2_447;
	word32 s1_444;
	Eq_2 s4_152;
	Eq_2 a4_157;
	Eq_2 a5_146;
	Eq_2 s0_148 = xTimerGenericCommand(s1_123, 0x01, null, ~0x00, a5_135, mstatus, dwLocBC, dwLoc48, dwLoc38, s0, dwArg38, out s1_444, out a0_445, out a3_446, out a4_157, out a5_146, out s2_447, out s3_448, out s4_152, out s5_449, out s6_450, out s8_451);
	do
	{
l23026182:
		while (true)
		{
			word32 s5_170 = 0x4201F000;
			do
			{
				word32 a0_184;
				word32 a2_186;
				struct Eq_116639 * s1_193;
				Eq_2 s2_194;
				Eq_2 s3_195;
				word32 s8_453;
				word32 a1_452;
				ra_177 = xStreamBufferReceive(ra_177, s0_148, s5_170 + 636, s4_152, 224, ~0x00, a4_157, a5_146, mstatus, dwLoc0118_334, dwLocF8, dwLoc6C, dwLoc50, dwLoc4C, dwLoc28, dwArg08, dwArg48, out s0_148, out s1_193, out a0_184, out a1_452, out a2_186, out a4_157, out a5_146, out s2_194, out s3_195, out s4_152, out s5_170, out s8_453, out mstatus);
			} while (a0_184 == 0x00);
			up32 a4_208 = (word32) bLoc0107;
			if (a4_208 == 0x0D)
				break;
			Eq_2 a5_210 = 0x01;
			if (a4_208 > 0x0D)
				a5_210 = (word32) (a4_208 > 22) << 1;
			dwLoc0118_334 = a5_210;
			ra_177 = stateM_handleEvent(ra_177, s1_193, (word32) s0_148 - 1184, fp + -272, a2_186, a5_210, out s0_148, out a4_157, out a5_146, out s4_152);
		}
		a5_146 = s1_193->t0718;
		if (a5_146 == s2_194 || (a5_146 == s3_195 || (a5_146 == 587714584 || a5_146 == 0x2307D62C)))
			break;
		a4_157.u0 = 587714356;
	} while (a5_146 != 587714356);
	word32 * a1_264;
	word32 * a3_266;
	struct Eq_62695 * s0_279;
	ra_177 = bl_tsen_adc_get(ra_177, s0_148, fp + -0x0112, 0x00, fs1, fflags, frm, dwLoc0100, dwLocFC, dwLocD8, dwLocB4, out s0_279, out a1_264, out a3_266, out fs1, out fflags, out frm);
	s0_148 = phy_tcal_callback(s0_279, 0, a1_264, a3_266, mstatus, out a4_157, out a5_146, out s4_152);
	goto l23026182;
}

// 23026206: void _wifi_mgmr_entry(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38)
void _wifi_mgmr_entry(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_116475 fs1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38)
{
	wifi_mgmr_start(ra, s0, a3, a4, fs1, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg38);
}

// 2302620E: void wifi_mgmr_start_background(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      event_cb_wifi_event
//      _wifi_mgmr_entry
void wifi_mgmr_start_background(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	ptr32 mstatus_18;
	Eq_2 s1_20;
	Eq_2 s3_24;
	word32 a2_107;
	word32 a3_108;
	word32 a4_109;
	word32 a5_110;
	xTaskCreate(wifi_mgmr_drv_init(ra, s0, a0, a3, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg5C, dwArg60, dwArg64, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_20, out s3_24, out mstatus_18), s1_20, 0x0300, 0x00, 0x1C, fp + ~0x13, s3_24, mstatus_18, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a2_107, out a3_108, out a4_109, out a5_110);
}

// 2302623C: Register Eq_2 wifi_mgmr_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg0118, ptr32 & s4Out)
{
	struct Eq_116880 * s0_20;
	ptr32 s4_24;
	word32 a0_52;
	Eq_2 ra_32 = xStreamBufferGenericCreateStatic(ra, 0x00FFF8C0, 0x00, 0x01, 0x4201F2A0, 0x4201F27C, mstatus, dwArg0118, out s0_20, out a0_52, out s4_24);
	g_b4201E448 = 0x01;
	s0_20->dw4201EC18 = 0x03FFFA98;
	s4Out = s4_24;
	return ra_32;
}

// 23026286: Register word32 wifi_mgmr_state_get_internal(Register (ptr32 word32) a0, Register out (ptr32 (ptr32 word32)) a5Out)
// Called from:
//      wifi_mgmr_state_get
word32 wifi_mgmr_state_get_internal(word32 * a0, word32 & a5Out)
{
	word32 ** a5_23;
	word32 ** a5_29;
	int32 a4_8 = *(int32 *) 1124199264;
	word32 a3_11 = (word32) *(uint16 *) 1124199320;
	if (a4_8 != 587715896)
	{
		if (a4_8 == 587714668)
		{
			if (g_dw4201E450 == 0x00)
			{
				a5_29 = (word32 **) 0x02;
				goto l230262B4;
			}
			a5_23 = (word32 **) 0x12;
		}
		else if (a4_8 == 587714356)
		{
			if (g_dw4201E450 != 0x00)
				a5_23 = (word32 **) 0x13;
			else
				a5_23 = (word32 **) 0x03;
		}
		else if (a4_8 == 587714584)
		{
			if (g_dw4201E450 != 0x00)
				a5_23 = (word32 **) 0x14;
			else
				a5_23 = (word32 **) 0x04;
		}
		else if (a4_8 == 0x2307D088)
		{
			if (g_dw4201E450 == 0x00)
			{
				a5_29 = (word32 **) 0x05;
				goto l230262B4;
			}
			a5_23 = (word32 **) 0x15;
		}
		else if (a4_8 == 587716084)
			a5_23 = (word32 **) 0x06;
		else
		{
			a5_23 = &g_ptr2307D62C;
			if (a4_8 != 0x2307D62C)
			{
				*a0 = 0x00;
				goto l230262AE;
			}
			a5_23 = (word32 **) 0x07;
		}
l230262AC:
		*a5_23 = a0;
		goto l230262AE;
	}
	else
	{
		if (g_dw4201E450 != 0x00)
		{
			a5_23 = (word32 **) 0x11;
			goto l230262AC;
		}
		a5_29 = (word32 **) 0x01;
l230262B4:
		*a5_29 = a0;
		if (a3_11 == 0x08)
		{
			a5_23 = (word32 **) 0x08;
			goto l230262AC;
		}
		a5_23 = (word32 **) 0x0C;
		if (a3_11 == 0x0C)
		{
			a5_23 = (word32 **) 0x09;
			goto l230262AC;
		}
l230262AE:
		a5Out = a5_23;
		return a3_11;
	}
}

