pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23026350: Register (ptr32 byte) wifi_mgmr_set_connect_stat_info(Register (ptr32 Eq_116990) a0, Register word32 a1, Register out ptr32 a4Out)
// Called from:
//      cb_connect_ind
byte * wifi_mgmr_set_connect_stat_info(struct Eq_116990 * a0, word32 a1, ptr32 & a4Out)
{
	g_w4201FB98 = (word16) (word32) a0->w0000;
	byte * a3_11 = &a0->w0000 + 1;
	struct Eq_117003 * a4_12 = &g_t4201FBFC;
	do
	{
		++a4_12;
		a4_12[0x0FFF] = (struct Eq_117003) (byte) (word32) *a3_11;
		++a3_11;
	} while (a3_11 != &a0->w0000 + 4);
	g_w4201FC02 = (word16) (word32) a0->w0014;
	ptr32 a4_27 = (word32) a0->b0012;
	g_b4201FB9A = (byte) a1;
	g_b4201FC04 = (byte) a4_27;
	a4Out = a4_27;
	return a3_11;
}

// 2302639E: Register Eq_2 wifi_mgmr_set_country_code_internal(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_api_set_country_code
Eq_2 wifi_mgmr_set_country_code_internal(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & mstatusOut)
{
	Eq_2 a1_12;
	ptr32 mstatus_19;
	Eq_2 ra_20 = bl_main_set_country_code(ra, a0, mstatus, dwLoc20, dwLoc1C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg40, dwArg44, dwArg4C, dwArg5C, dwArg68, dwArg8C, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a1_12, out mstatus_19);
	word32 a3_90;
	word32 a4_91;
	word32 a5_92;
	strncpy(0x4201FC06, a1_12, 0x03, out a3_90, out a4_91, out a5_92);
	g_b4201FC08 = 0x00;
	g_dw4201FC0C = bl_main_get_channel_nums();
	mstatusOut = mstatus_19;
	return ra_20;
}

// 230263D8: void wifi_mgmr_ap_sta_cnt_get_internal(Register (ptr32 byte) a0)
// Called from:
//      wifi_mgmr_ap_sta_cnt_get
void wifi_mgmr_ap_sta_cnt_get_internal(byte * a0)
{
	bl_main_apm_sta_cnt_get(a0);
}

// 230263E8: Register Eq_2 wifi_mgmr_ap_sta_info_get_internal(Register Eq_2 ra, Register (ptr32 Eq_117095) a0, Register Eq_2 a1, Register out ptr32 s0Out, Register out Eq_2 s1Out)
// Called from:
//      wifi_mgmr_ap_sta_info_get
Eq_2 wifi_mgmr_ap_sta_info_get_internal(Eq_2 ra, struct Eq_117095 * a0, Eq_2 a1, ptr32 & s0Out, union Eq_2 & s1Out)
{
	word32 t1_84;
	word32 a0_85;
	word32 a1_86;
	word32 a2_87;
	word32 a3_88;
	word32 a4_89;
	word32 a5_90;
	Eq_2 ra_23 = memset(ra, fp + -40, 0x00, 0x18, out t1_84, out a0_85, out a1_86, out a2_87, out a3_88, out a4_89, out a5_90);
	bl_main_apm_sta_info_get(fp + -40, a1);
	struct Eq_117126 * a5_42 = (word32) wLoc28;
	a0->w0000 = (word16) a5_42;
	a5_42->ptr0010 = a0;
	a5_42->ptr000C = a0;
	a5_42->ptr0008 = a0;
	a0->b0014 = (byte) (word32) bLoc14;
	word32 a1_91;
	word32 a2_92;
	word32 a3_93;
	word32 a4_94;
	word32 a5_95;
	word32 a6_96;
	word32 a7_97;
	memcpy(&a0->w0000 + 1, fp + -38, 0x06, out a1_91, out a2_92, out a3_93, out a4_94, out a5_95, out a6_96, out a7_97);
	s0Out = dwArgE4;
	s1Out = a1;
	return ra_23;
}

// 2302643C: void wifi_mgmr_ap_sta_delete_internal(Register Eq_2 ra, Register (ptr32 Eq_101482) s0, Register Eq_2 s1, Register (ptr32 Eq_101482) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_mgmr_ap_sta_delete
void wifi_mgmr_ap_sta_delete_internal(Eq_2 ra, struct Eq_101482 * s0, Eq_2 s1, struct Eq_101482 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg3C, Eq_2 dwArg6C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	word32 s0_55;
	word32 s1_56;
	word32 s2_57;
	word32 s3_58;
	word32 s4_59;
	word32 mstatus_60;
	bl_main_apm_sta_delete(ra, s0, s1, a0, s4, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg20, dwArg24, dwArg3C, dwArg6C, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_55, out s1_56, out s2_57, out s3_58, out s4_59, out mstatus_60);
}

// 2302644C: Register Eq_2 wifi_mgmr_scan_complete_notify(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Register out ptr32 a4Out)
// Called from:
//      cb_event_ind
Eq_2 wifi_mgmr_scan_complete_notify(Eq_2 ra, Eq_2 a3, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, ptr32 & a4Out)
{
	ptr32 a4_11;
	Eq_2 ra_14 = wifi_mgmr_scan_complete_callback(ra, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out a4_11);
	a4Out = a4_11;
	return ra_14;
}

// 2302645C: void wifi_mgmr_api_connect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78)
// Called from:
//      wifi_mgmr_sta_connect
void wifi_mgmr_api_connect(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78)
{
	word32 a0_511;
	word32 t1_510;
	word32 a2_513;
	word32 a4_515;
	word32 a1_512;
	word32 a3_514;
	word32 a5_516;
	Eq_2 ra_197 = memset(ra, fp + -232, 0x00, 0x00C6, out t1_510, out a0_511, out a1_512, out a2_513, out a3_514, out a4_515, out a5_516);
	word32 a1_517;
	word32 a4_520;
	word32 a2_518;
	word32 a3_519;
	word32 a5_521;
	Eq_2 a0_66 = strlen(a0, out a1_517, out a2_518, out a3_519, out a4_520, out a5_521);
	word32 a1_522;
	word32 a2_523;
	word32 a6_525;
	word32 a7_526;
	word32 a5_524;
	Eq_2 a4_104;
	Eq_2 a3_109;
	memcpy(fp + -0x00DB, a0, a0_66, out a1_522, out a2_523, out a3_109, out a4_104, out a5_524, out a6_525, out a7_526);
	Eq_2 s4_203 = a4;
	Eq_2 dwLocB8_359 = SEQ(wLocB6, (word16) (a0_66 >> 0x10));
	Eq_2 dwLocDC_388 = SEQ(nLocDB, 0x00);
	if (a1 != 0x00)
	{
		word32 a5_565;
		word32 a1_563;
		word32 a2_564;
		Eq_2 a0_93 = strlen(a1, out a1_563, out a2_564, out a3_109, out a4_104, out a5_565);
		if (a0_93 > 64)
			return;
		if (a0_93 != 0x00)
		{
			word32 a5_568;
			word32 a6_569;
			word32 a7_570;
			word32 a1_566;
			word32 a2_567;
			memcpy(fp + -0x00B6, a1, a0_93, out a1_566, out a2_567, out a3_109, out a4_104, out a5_568, out a6_569, out a7_570);
		}
	}
	Eq_2 dwLoc90_294;
	if (a2 == 0x00)
		dwLoc90_294.u0 = 0x00;
	else
	{
		word32 a1_555;
		word32 a2_556;
		word32 a5_557;
		Eq_2 a0_122 = strlen(a2, out a1_555, out a2_556, out a3_109, out a4_104, out a5_557);
		dwLoc90_294 = a0_122;
		if (a0_122 != 0x00)
		{
			if (a0_122 != 64)
				return;
			word32 a7_562;
			word32 a1_558;
			word32 a2_559;
			word32 a5_560;
			word32 a6_561;
			memcpy(fp + -117, a2, 64, out a1_558, out a2_559, out a3_109, out a4_104, out a5_560, out a6_561, out a7_562);
		}
	}
	if (a3 != 0x00)
	{
		word32 a7_531;
		word32 a5_529;
		word32 a2_528;
		word32 a6_530;
		word32 a1_527;
		memcpy(fp + -44, a3, 0x06, out a1_527, out a2_528, out a3_109, out a4_104, out a5_529, out a6_530, out a7_531);
	}
	if (a5 != 0x00)
	{
		word32 s11_546;
		word32 t4_547;
		word32 s10_545;
		word32 s6_541;
		word32 s7_542;
		word32 s8_543;
		word32 s9_544;
		word32 a7_537;
		word32 s2_538;
		word32 s3_539;
		word32 s5_540;
		word32 a0_533;
		word32 a1_534;
		word32 a2_535;
		word32 a5_536;
		word32 s1_532;
		ra_197 = printf(ra_197, &g_t2307D7CC, a3_109, 0x22334401, dwLocC8, s2, s0, dwLoc58, dwLoc34, out s1_532, out a0_533, out a1_534, out a2_535, out a3_109, out a4_104, out a5_536, out a7_537, out s2_538, out s3_539, out s4_203, out s5_540, out s6_541, out s7_542, out s8_543, out s9_544, out s10_545, out s11_546, out t4_547);
	}
	word32 mstatus_554;
	word32 a3_550;
	word32 a4_551;
	word32 a5_552;
	word32 s3_553;
	word32 s1_548;
	word32 a1_549;
	wifi_mgmr_event_notify(ra_197, fp + -232, a3_109, a4_104, s4_203, mstatus, 0x22334401, dwLocDC_388, dwLocD8, dwLocB8_359, dwLoc90_294, dwLoc8C, dwLoc68, dwLoc5C, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg18, dwArg38, dwArg58, dwArg78, out s1_548, out a1_549, out a3_550, out a4_551, out a5_552, out s3_553, out mstatus_554);
}

// 230265A6: void wifi_mgmr_api_cfg_req(Register Eq_2 ra, Register Eq_2 s1, Register uint32 a0, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
// Called from:
//      wifi_mgmr_cfg_req
void wifi_mgmr_api_cfg_req(Eq_2 ra, Eq_2 s1, uint32 a0, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	if (a4 > 32)
		return;
	Eq_2 a4_108 = (word32) a4 + 0x00C6 >> 24;
	word32 t1_292;
	word32 a0_293;
	word32 a1_294;
	word32 a2_295;
	word32 a4_296;
	word32 a5_297;
	Eq_2 a3_113;
	Eq_2 ra_41 = memset(ra, fp + -100, 0x00, 65, out t1_292, out a0_293, out a1_294, out a2_295, out a3_113, out a4_296, out a5_297);
	Eq_2 dwLoc58_228 = SEQ((byte) (a0 >> 0x10), (byte) (a0 >> 0x08), (byte) a0, (byte) a4_108);
	Eq_2 dwLoc5C_231 = SEQ((byte) ((word32) a4 + 0x00C6 >> 0x10), (byte) ((word32) a4 + 0x00C6 >> 0x08), (byte) ((word32) a4 + 0x00C6), 0x55);
	if (a4 != 0x00)
	{
		word32 a1_298;
		word32 a2_299;
		word32 a5_300;
		word32 a6_301;
		word32 a7_302;
		memcpy(fp + -67, a5, a4, out a1_298, out a2_299, out a3_113, out a4_108, out a5_300, out a6_301, out a7_302);
	}
	word32 s1_303;
	word32 a1_304;
	word32 a3_305;
	word32 a4_306;
	word32 a5_307;
	word32 s3_308;
	word32 mstatus_309;
	wifi_mgmr_event_notify(ra_41, fp + -100, a3_113, a4_108, a0 >> 0x18, mstatus, dwLoc68, dwLoc5C_231, dwLoc58_228, dwLoc38, dwLoc10, dwLoc0C, dwArg18, dwArg24, s3, s1, ra, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgF8, out s1_303, out a1_304, out a3_305, out a4_306, out a5_307, out s3_308, out mstatus_309);
}

// 230266EE: void wifi_mgmr_api_ip_got(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      netif_status_callback
void wifi_mgmr_api_ip_got(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	uint32 a3_28;
	uint32 a4_29;
	word32 t1_190;
	word32 a0_191;
	word32 a1_192;
	word32 a2_193;
	word32 a5_194;
	word32 s1_195;
	word32 a1_196;
	word32 a3_197;
	word32 a4_198;
	word32 a5_199;
	word32 s3_200;
	word32 mstatus_201;
	wifi_mgmr_event_notify(memset(ra, fp + -52, 0x00, 33, out t1_190, out a0_191, out a1_192, out a2_193, out a3_28, out a4_29, out a5_194), fp + -52, a3_28 >> 24, a4_29 >> 24, s4, mstatus, dwLoc48, dwLoc3C, dwLoc38, SEQ((byte) (a4_29 >> 0x10), (byte) (a4_29 >> 0x08), (byte) a4_29, (byte) (a3_28 >> 24)), dwArg10, dwArg14, dwArg38, dwArg44, dwArg5C, dwArg60, dwArg64, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s1_195, out a1_196, out a3_197, out a4_198, out a5_199, out s3_200, out mstatus_201);
}

