pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23026802: Register Eq_2 wifi_mgmr_api_ip_update(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_ip_unset
//      netif_status_callback
Eq_2 wifi_mgmr_api_ip_update(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a1Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a1_45;
	ptr32 a3_47;
	ptr32 mstatus_52;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 s1_114;
	word32 a4_115;
	word32 a5_116;
	word32 s3_117;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_12, out a4_13, out a5_113), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_114, out a1_45, out a3_47, out a4_115, out a5_116, out s3_117, out mstatus_52);
	a1Out = a1_45;
	a3Out = a3_47;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026874: void wifi_mgmr_api_reconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      disconnect_retry
void wifi_mgmr_api_reconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 230268E6: void wifi_mgmr_api_disable_autoreconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sta_autoconnect_disable
void wifi_mgmr_api_disable_autoreconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 23026958: void wifi_mgmr_api_enable_autoreconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sta_autoconnect_enable
void wifi_mgmr_api_enable_autoreconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 230269CA: Register Eq_2 wifi_mgmr_api_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_disconnect
Eq_2 wifi_mgmr_api_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a3_47;
	ptr32 a4_48;
	ptr32 a5_49;
	ptr32 mstatus_52;
	word32 t1_110;
	word32 a0_111;
	word32 a1_112;
	word32 a2_113;
	word32 a5_114;
	word32 s1_115;
	word32 a1_116;
	word32 s3_117;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_110, out a0_111, out a1_112, out a2_113, out a3_12, out a4_13, out a5_114), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_115, out a1_116, out a3_47, out a4_48, out a5_49, out s3_117, out mstatus_52);
	a3Out = a3_47;
	a4Out = a4_48;
	a5Out = a5_49;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026A3C: void wifi_mgmr_api_rate_config(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_rate_config
void wifi_mgmr_api_rate_config(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_110;
	word32 a0_111;
	word32 a1_112;
	word32 a2_113;
	word32 a5_114;
	word32 s1_115;
	word32 a1_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s3_120;
	word32 mstatus_121;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_110, out a0_111, out a1_112, out a2_113, out a3_16, out a4_17, out a5_114), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_115, out a1_116, out a3_117, out a4_118, out a5_119, out s3_120, out mstatus_121);
}

// 23026AA8: void wifi_mgmr_api_conf_max_sta(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_conf_max_sta
void wifi_mgmr_api_conf_max_sta(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 s1_114;
	word32 a1_115;
	word32 a3_116;
	word32 a4_117;
	word32 a5_118;
	word32 s3_119;
	word32 mstatus_120;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_16, out a4_17, out a5_113), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_114, out a1_115, out a3_116, out a4_117, out a5_118, out s3_119, out mstatus_120);
}

