pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23026B12: Register Eq_2 wifi_mgmr_api_ifaceup(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_api_ifaceup(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_52;
	ptr32 s1_54;
	ptr32 s3_58;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 a1_114;
	word32 a3_115;
	word32 a4_116;
	word32 a5_117;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_12, out a4_13, out a5_113), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_54, out a1_114, out a3_115, out a4_116, out a5_117, out s3_58, out mstatus_52);
	s1Out = s1_54;
	s3Out = s3_58;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026B84: void wifi_mgmr_api_sniffer_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sniffer_enable
void wifi_mgmr_api_sniffer_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 23026BF6: void wifi_mgmr_api_scan_item_beacon(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8)
// Called from:
//      cb_beacon_ind
void wifi_mgmr_api_scan_item_beacon(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8)
{
	Eq_2 a4_37;
	word32 t1_209;
	word32 a0_210;
	word32 a1_211;
	word32 a2_212;
	word32 a3_213;
	word32 a5_214;
	Eq_2 ra_39 = memset(ra, fp + -0x006C, 0x00, 73, out t1_209, out a0_210, out a1_211, out a2_212, out a3_213, out a4_37, out a5_214);
	Eq_2 a3_74;
	word32 a1_215;
	word32 a2_216;
	word32 a4_217;
	word32 a5_218;
	word32 a6_219;
	word32 a7_220;
	memcpy(fp + -95, a4_37, dwArg44, out a1_215, out a2_216, out a3_74, out a4_217, out a5_218, out a6_219, out a7_220);
	Eq_2 a4_94;
	Eq_2 a3_99;
	word32 a1_221;
	word32 a2_222;
	word32 a5_223;
	word32 a6_224;
	word32 a7_225;
	memcpy(fp + -55, a3_74, 0x06, out a1_221, out a2_222, out a3_99, out a4_94, out a5_223, out a6_224, out a7_225);
	0x00 = dwLoc58;
	word32 s1_226;
	word32 a1_227;
	word32 a3_228;
	word32 a4_229;
	word32 a5_230;
	word32 s3_231;
	word32 mstatus_232;
	wifi_mgmr_event_notify(ra_39, fp + -0x006C, a3_99, a4_94, s4, mstatus, dwLoc78, 0x22334418, 0x66778811, s2, dwLoc20, dwLoc1C, dwArg08, dwArg14, dwArg2C, dwArg30, s3, dwArg58, dwArg88, dwArgA8, dwArgC8, dwArgE8, out s1_226, out a1_227, out a3_228, out a4_229, out a5_230, out s3_231, out mstatus_232);
}

// 23026CE6: void wifi_mgmr_api_fw_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      ip_obtaining_timeout
void wifi_mgmr_api_fw_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

