pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23026D58: void wifi_mgmr_api_fw_tsen_reload(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      __reload_tsen
void wifi_mgmr_api_fw_tsen_reload(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	word32 t1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a2_108;
	word32 a4_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_105, out a0_106, out a1_107, out a2_108, out a3_12, out a4_109, out a5_110), fp + ~0x1F, a3_12, 0x0055, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 23026DC8: void wifi_mgmr_api_fw_scan(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_scan
void wifi_mgmr_api_fw_scan(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a3_113, out a4_114, out a5_115, out s3_116, out mstatus_117);
}

// 23026E3A: void wifi_mgmr_api_fw_powersaving(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sta_powersaving
void wifi_mgmr_api_fw_powersaving(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_112;
	word32 a0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a5_116;
	word32 s1_117;
	word32 a1_118;
	word32 a3_119;
	word32 a4_120;
	word32 a5_121;
	word32 s3_122;
	word32 mstatus_123;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_112, out a0_113, out a1_114, out a2_115, out a3_16, out a4_17, out a5_116), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_117, out a1_118, out a3_119, out a4_120, out a5_121, out s3_122, out mstatus_123);
}

// 23026EAE: void wifi_mgmr_api_ap_start(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
// Called from:
//      wifi_mgmr_ap_start
void wifi_mgmr_api_ap_start(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	if (a0 == 0x00)
		return;
	word32 a5_397;
	word32 a4_396;
	word32 a3_395;
	word32 a2_394;
	word32 a1_393;
	word32 a0_392;
	word32 t1_391;
	Eq_2 ra_33 = memset(ra, fp + -0x009C, 0x00, 0x007C, out t1_391, out a0_392, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397);
	word32 a3_400;
	word32 a4_401;
	word32 a5_402;
	word32 a2_399;
	word32 a1_398;
	Eq_2 a0_37 = strlen(a0, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402);
	byte bLoc69_195 = (byte) a0_37;
	Eq_2 dwLoc68_245 = SEQ(bLoc65, (byte) (a0_37 >> 0x18), (byte) (a0_37 >> 0x10), (byte) (a0_37 >> 0x08));
	if (a0_37 > 32)
		return;
	if (a1 != 0x00)
	{
		word32 a1_403;
		word32 a2_404;
		word32 a3_405;
		word32 a4_406;
		word32 a5_407;
		if (strlen(a1, out a1_403, out a2_404, out a3_405, out a4_406, out a5_407) > 32)
			return;
	}
	Eq_2 a2_95;
	word32 a1_408;
	word32 a5_409;
	word32 a6_410;
	word32 a7_411;
	Eq_2 a4_108;
	Eq_2 a3_113;
	memcpy(fp + -0x008B, a0, (word32) bLoc69_195 | 0x7C00, out a1_408, out a2_95, out a3_113, out a4_108, out a5_409, out a6_410, out a7_411);
	if (a1 != 0x00)
	{
		word32 a1_412;
		word32 a2_413;
		word32 a5_414;
		word32 a6_415;
		word32 a7_416;
		memcpy(fp + -101, a1, a2_95, out a1_412, out a2_413, out a3_113, out a4_108, out a5_414, out a6_415, out a7_416);
	}
	word32 s1_417;
	word32 a1_418;
	word32 a3_419;
	word32 a4_420;
	word32 a5_421;
	word32 s3_422;
	word32 mstatus_423;
	wifi_mgmr_event_notify(ra_33, fp + -0x009C, a3_113, a4_108, 32, mstatus, 0x66778811, SEQ(nLoc8B, (byte) (a2 >> 24)), dwLoc88, dwLoc68_245, dwLoc40, dwLoc3C, dwLoc18, dwLoc0C, dwArg0C, dwArg10, dwArg14, dwArg38, dwArg68, dwArg88, dwArgA8, dwArgC8, out s1_417, out a1_418, out a3_419, out a4_420, out a5_421, out s3_422, out mstatus_423);
}

// 23026FCA: Register Eq_2 wifi_mgmr_api_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a3Out)
// Called from:
//      wifi_mgmr_ap_stop
Eq_2 wifi_mgmr_api_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a3Out)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a3_47;
	word32 t1_107;
	word32 a0_108;
	word32 a1_109;
	word32 a2_110;
	word32 a5_111;
	word32 s1_112;
	word32 a1_113;
	word32 a4_114;
	word32 a5_115;
	word32 s3_116;
	word32 mstatus_117;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_107, out a0_108, out a1_109, out a2_110, out a3_12, out a4_13, out a5_111), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_112, out a1_113, out a3_47, out a4_114, out a5_115, out s3_116, out mstatus_117);
	a3Out = a3_47;
	return ra_53;
}

