pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302703C: void wifi_mgmr_api_idle(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sta_disable
//      wifi_mgmr_sniffer_disable
void wifi_mgmr_api_idle(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a2_108;
	word32 a5_109;
	word32 s1_110;
	word32 a1_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	word32 s3_115;
	word32 mstatus_116;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_105, out a0_106, out a1_107, out a2_108, out a3_12, out a4_13, out a5_109), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_110, out a1_111, out a3_112, out a4_113, out a5_114, out s3_115, out mstatus_116);
}

// 230270AC: Register Eq_2 wifi_mgmr_api_denoise_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 mstatusOut)
// Called from:
//      trigger_auto_denoise
//      wifi_denoise_enable_cmd
Eq_2 wifi_mgmr_api_denoise_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_49;
	word32 t1_104;
	word32 a0_105;
	word32 a1_106;
	word32 a2_107;
	word32 a5_108;
	word32 s1_109;
	word32 a1_110;
	word32 a3_111;
	word32 a4_112;
	word32 a5_113;
	word32 s3_114;
	Eq_2 ra_50 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_104, out a0_105, out a1_106, out a2_107, out a3_12, out a4_13, out a5_108), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_109, out a1_110, out a3_111, out a4_112, out a5_113, out s3_114, out mstatus_49);
	mstatusOut = mstatus_49;
	return ra_50;
}

// 23027112: void wifi_mgmr_api_denoise_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_denoise_disable_cmd
void wifi_mgmr_api_denoise_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_102;
	word32 a0_103;
	word32 a1_104;
	word32 a2_105;
	word32 a5_106;
	word32 s1_107;
	word32 a1_108;
	word32 a3_109;
	word32 a4_110;
	word32 a5_111;
	word32 s3_112;
	word32 mstatus_113;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_102, out a0_103, out a1_104, out a2_105, out a3_12, out a4_13, out a5_106), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_107, out a1_108, out a3_109, out a4_110, out a5_111, out s3_112, out mstatus_113);
}

// 23027176: void wifi_mgmr_api_raw_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_118815 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_raw_80211_send
void wifi_mgmr_api_raw_send(Eq_2 ra, Eq_2 s1, Eq_118815 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	word32 t1_117;
	word32 a0_118;
	word32 a1_119;
	word32 a2_120;
	word32 a5_121;
	word32 s1_122;
	word32 a1_123;
	word32 a3_124;
	word32 a4_125;
	word32 a5_126;
	word32 s3_127;
	word32 mstatus_128;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_117, out a0_118, out a1_119, out a2_120, out a3_20, out a4_21, out a5_121), fp + ~0x1F, a3_20, a4_21, s4, mstatus, SEQ(0x00, 0x00, 0x0D, (byte) (a1 >> 24)), dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_122, out a1_123, out a3_124, out a4_125, out a5_126, out s3_127, out mstatus_128);
}

// 230271EA: Register Eq_2 wifi_mgmr_api_set_country_code(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_api_set_country_code(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & mstatusOut)
{
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_set_country_code_internal(ra, a0, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg18, dwArg28, dwArg30, dwArg34, dwArg3C, dwArg4C, dwArg58, dwArg7C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out mstatus_16);
	mstatusOut = mstatus_16;
	return ra_17;
}

