pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230271FA: void cmd_rf_dump()
void cmd_rf_dump()
{
}

// 230271FC: void cmd_dump_reset()
void cmd_dump_reset()
{
	g_dw4200EDCC = 0x0A;
}

// 23027208: void cmd_wifi_power_table_update()
void cmd_wifi_power_table_update()
{
	word32 a1_39;
	word32 a2_40;
	word32 a3_41;
	word32 a4_42;
	word32 a5_43;
	word32 a6_44;
	word32 a7_45;
	memcpy(fp + -56, 587716676, 38, out a1_39, out a2_40, out a3_41, out a4_42, out a5_43, out a6_44, out a7_45);
	bl_tpc_update_power_table(fp + -56);
}

// 2302722A: void cmd_wifi_state_get(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cmd_wifi_state_get(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	uint32 a5_12;
	Eq_2 a3_10 = wifi_mgmr_state_get(fp + ~0x13, out a5_12);
	if (a5_12 <= 0x15)
	{
		struct Eq_274 * a0_21;
		switch (g_a2307D7EC[a5_12 * 0x04])
		{
		case 0x00:
			a0_21 = (struct Eq_274 *) &g_t2307DA08;
			break;
		case 0x01:
			a0_21 = (struct Eq_274 *) &g_t2307DA20;
			break;
		}
		word32 s1_109;
		word32 a0_110;
		word32 a1_111;
		word32 a2_112;
		word32 a3_113;
		word32 a4_114;
		word32 a5_115;
		word32 a7_116;
		word32 s2_117;
		word32 s3_118;
		word32 s4_119;
		word32 s5_120;
		word32 s6_121;
		word32 s7_122;
		word32 s8_123;
		word32 s9_124;
		word32 s10_125;
		word32 s11_126;
		word32 t4_127;
		printf(ra, a0_21, a3_10, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_109, out a0_110, out a1_111, out a2_112, out a3_113, out a4_114, out a5_115, out a7_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s7_122, out s8_123, out s9_124, out s10_125, out s11_126, out t4_127);
	}
}

// 230272EC: void wifi_sta_get_state_cmd(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void wifi_sta_get_state_cmd(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_274 * a0_56;
	word32 a5_19;
	Eq_2 a3_23;
	word32 a7_139;
	word32 a4_138;
	word32 a2_137;
	word32 a1_136;
	word32 a0_135;
	word32 s1_134;
	word32 a5_133;
	word32 s2_140;
	word32 s3_141;
	word32 s4_142;
	word32 s5_143;
	word32 s6_144;
	word32 s7_145;
	word32 s8_146;
	word32 s9_147;
	word32 s10_148;
	word32 s11_149;
	word32 t4_150;
	Eq_2 ra_26 = printf(ra, &g_t2307E87C, wifi_mgmr_state_get(fp + ~0x13, out a5_133), dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_134, out a0_135, out a1_136, out a2_137, out a3_23, out a4_138, out a5_19, out a7_139, out s2_140, out s3_141, out s4_142, out s5_143, out s6_144, out s7_145, out s8_146, out s9_147, out s10_148, out s11_149, out t4_150);
	if (a5_19 == 0x00)
		a0_56 = (struct Eq_274 *) &g_t2307E894;
	else if (a5_19 == 0x01)
		a0_56 = (struct Eq_274 *) &g_t2307E8C0;
	else if (a5_19 == 0x02)
		a0_56 = (struct Eq_274 *) &g_t2307E8E8;
	else if (a5_19 == 0x03)
		a0_56 = (struct Eq_274 *) &g_t2307E914;
	else if (a5_19 == 0x04)
		a0_56 = (struct Eq_274 *) &g_t2307E94C;
	else if (a5_19 == 0x05)
		a0_56 = (struct Eq_274 *) &g_t2307E980;
	else if (a5_19 == 0x11)
		a0_56 = (struct Eq_274 *) &g_t2307E9AC;
	else if (a5_19 == 0x12)
		a0_56 = (struct Eq_274 *) &g_t2307E9DC;
	else if (a5_19 == 0x13)
		a0_56 = (struct Eq_274 *) &g_t2307EA10;
	else if (a5_19 == 0x14)
		a0_56 = (struct Eq_274 *) &g_t2307EA50;
	else if (a5_19 == 0x15)
		a0_56 = (struct Eq_274 *) &g_t2307EA8C;
	else if (a5_19 == 0x06)
		a0_56 = (struct Eq_274 *) &g_t2307EAC0;
	else if (a5_19 == 0x07)
		a0_56 = (struct Eq_274 *) &g_t2307EAE8;
	else if (a5_19 == 0x08)
		a0_56 = (struct Eq_274 *) &g_t2307EB14;
	else if (a5_19 == 0x09)
		a0_56 = (struct Eq_274 *) &g_t2307EB40;
	else
		a0_56 = (struct Eq_274 *) &g_t2307EB70;
	word32 s1_151;
	word32 a0_152;
	word32 a1_153;
	word32 a2_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	word32 a7_158;
	word32 s2_159;
	word32 s3_160;
	word32 s4_161;
	word32 s5_162;
	word32 s6_163;
	word32 s7_164;
	word32 s8_165;
	word32 s9_166;
	word32 s10_167;
	word32 s11_168;
	word32 t4_169;
	printf(ra_26, a0_56, a3_23, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_151, out a0_152, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157, out a7_158, out s2_159, out s3_160, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168, out t4_169);
}

// 2302740E: void wifi_edca_dump_cmd(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void wifi_edca_dump_cmd(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	word32 a0_235;
	word32 a1_236;
	word32 a2_237;
	word32 a4_238;
	word32 a5_239;
	word32 s4_240;
	word32 s8_241;
	puts(587720228, out a0_235, out a1_236, out a2_237, out a4_238, out a5_239, out s4_240, out s8_241);
	bl60x_edca_get(0x00, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_242;
	word32 a1_243;
	word32 a2_244;
	word32 a4_245;
	word32 a5_246;
	word32 s4_247;
	word32 s8_248;
	puts(587720248, out a0_242, out a1_243, out a2_244, out a4_245, out a5_246, out s4_247, out s8_248);
	Eq_2 dwLoc18_230 = (uint32) nLoc18;
	word32 s1_249;
	word32 a0_250;
	word32 a1_251;
	word32 a2_252;
	word32 a3_253;
	word32 a4_254;
	word32 a5_255;
	word32 a7_256;
	word32 s2_257;
	word32 s3_258;
	word32 s4_259;
	word32 s5_260;
	word32 s6_261;
	word32 s7_262;
	word32 s8_263;
	word32 s9_264;
	word32 s10_265;
	word32 s11_266;
	word32 t4_267;
	Eq_2 ra_59 = printf(ra, &g_t2307E644, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_249, out a0_250, out a1_251, out a2_252, out a3_253, out a4_254, out a5_255, out a7_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s7_262, out s8_263, out s9_264, out s10_265, out s11_266, out t4_267);
	bl60x_edca_get(0x01, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_268;
	word32 a1_269;
	word32 a2_270;
	word32 a4_271;
	word32 a5_272;
	word32 s4_273;
	word32 s8_274;
	puts(0x2307E670, out a0_268, out a1_269, out a2_270, out a4_271, out a5_272, out s4_273, out s8_274);
	word32 s1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a3_279;
	word32 a4_280;
	word32 a5_281;
	word32 a7_282;
	word32 s2_283;
	word32 s3_284;
	word32 s4_285;
	word32 s5_286;
	word32 s6_287;
	word32 s7_288;
	word32 s8_289;
	word32 s9_290;
	word32 s10_291;
	word32 s11_292;
	word32 t4_293;
	Eq_2 ra_107 = printf(ra_59, &g_t2307E644, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a7_282, out s2_283, out s3_284, out s4_285, out s5_286, out s6_287, out s7_288, out s8_289, out s9_290, out s10_291, out s11_292, out t4_293);
	bl60x_edca_get(0x02, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_294;
	word32 a1_295;
	word32 a2_296;
	word32 a4_297;
	word32 a5_298;
	word32 s4_299;
	word32 s8_300;
	puts(0x2307E67C, out a0_294, out a1_295, out a2_296, out a4_297, out a5_298, out s4_299, out s8_300);
	word32 s1_301;
	word32 a0_302;
	word32 a1_303;
	word32 a2_304;
	word32 a3_305;
	word32 a4_306;
	word32 a5_307;
	word32 a7_308;
	word32 s2_309;
	word32 s3_310;
	word32 s4_311;
	word32 s5_312;
	word32 s6_313;
	word32 s7_314;
	word32 s8_315;
	word32 s9_316;
	word32 s10_317;
	word32 s11_318;
	word32 t4_319;
	Eq_2 ra_155 = printf(ra_107, &g_t2307E644, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_309, out s3_310, out s4_311, out s5_312, out s6_313, out s7_314, out s8_315, out s9_316, out s10_317, out s11_318, out t4_319);
	bl60x_edca_get(0x03, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_320;
	word32 a1_321;
	word32 a2_322;
	word32 a4_323;
	word32 a5_324;
	word32 s4_325;
	word32 s8_326;
	puts(587720328, out a0_320, out a1_321, out a2_322, out a4_323, out a5_324, out s4_325, out s8_326);
	word32 s1_327;
	word32 a0_328;
	word32 a1_329;
	word32 a2_330;
	word32 a3_331;
	word32 a4_332;
	word32 a5_333;
	word32 a7_334;
	word32 s2_335;
	word32 s3_336;
	word32 s4_337;
	word32 s5_338;
	word32 s6_339;
	word32 s7_340;
	word32 s8_341;
	word32 s9_342;
	word32 s10_343;
	word32 s11_344;
	word32 t4_345;
	printf(ra_155, &g_t2307E644, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_327, out a0_328, out a1_329, out a2_330, out a3_331, out a4_332, out a5_333, out a7_334, out s2_335, out s3_336, out s4_337, out s5_338, out s6_339, out s7_340, out s8_341, out s9_342, out s10_343, out s11_344, out t4_345);
}

