pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302751C: void wifi_ap_sta_list_get_cmd(Register Eq_2 ra, Register ui32 a1, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C)
void wifi_ap_sta_list_get_cmd(Eq_2 ra, ui32 a1, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C)
{
	struct Eq_274 * a0_262;
	byte bLoc47_447 = SLICE(s6, byte, 8);
	byte bLoc48_450 = (byte) s6;
	byte bLoc46_475 = SLICE(s6, byte, 16);
	word32 a5_551;
	Eq_2 a3_27 = wifi_mgmr_state_get(fp + -76, out a5_551);
	if ((a1 & 16) == 0x00)
		a0_262 = (struct Eq_274 *) &g_t2307E458;
	else
	{
		wifi_mgmr_ap_sta_cnt_get(fp + -77);
		if (false)
		{
			Eq_2 a3_44;
			Eq_2 a3_57;
			Eq_2 a3_81;
			Eq_2 a3_105;
			word32 a3_616;
			word32 a4_617;
			word32 a1_614;
			word32 a2_615;
			word32 s1_612;
			word32 a0_613;
			word32 s11_610;
			word32 t4_611;
			word32 s5_568;
			word32 s9_608;
			word32 s10_609;
			word32 s7_606;
			word32 s8_607;
			word32 s5_604;
			word32 s6_605;
			word32 s3_602;
			word32 s4_603;
			word32 a7_600;
			word32 s2_601;
			word32 a4_598;
			word32 a5_599;
			word32 a1_596;
			word32 a2_597;
			word32 s1_594;
			word32 a0_595;
			word32 t4_593;
			word32 s11_592;
			word32 s10_591;
			word32 s9_590;
			word32 s8_589;
			word32 s7_588;
			word32 a7_582;
			word32 s6_587;
			word32 s2_583;
			word32 s3_584;
			word32 s4_585;
			word32 s5_586;
			word32 s1_576;
			word32 a5_581;
			word32 a0_577;
			word32 a1_578;
			word32 a2_579;
			word32 a4_580;
			word32 s7_570;
			word32 t4_575;
			word32 s8_571;
			word32 s9_572;
			word32 s10_573;
			word32 s11_574;
			word32 a1_554;
			word32 s6_569;
			word32 t1_552;
			word32 a0_553;
			word32 a2_555;
			word32 a4_556;
			word32 a5_557;
			word32 s1_558;
			word32 a0_559;
			word32 a1_560;
			word32 a2_561;
			word32 s2_565;
			word32 a4_562;
			word32 a7_564;
			word32 s3_566;
			word32 a5_563;
			word32 s4_567;
			word32 a5_618;
			word32 a7_619;
			word32 s2_620;
			word32 s4_621;
			word32 s5_622;
			word32 s6_623;
			word32 s7_624;
			word32 s8_625;
			word32 s9_626;
			word32 s10_627;
			word32 s11_628;
			word32 t4_629;
			word32 s3_137;
			Eq_2 ra_132 = printf(printf(printf(printf(memset(ra, fp + -72, 0x00, 0x18, out t1_552, out a0_553, out a1_554, out a2_555, out a3_44, out a4_556, out a5_557), &g_t2307E4AC, a3_44, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_558, out a0_559, out a1_560, out a2_561, out a3_57, out a4_562, out a5_563, out a7_564, out s2_565, out s3_566, out s4_567, out s5_568, out s6_569, out s7_570, out s8_571, out s9_572, out s10_573, out s11_574, out t4_575), &g_t2307E4B8, a3_57, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_576, out a0_577, out a1_578, out a2_579, out a3_81, out a4_580, out a5_581, out a7_582, out s2_583, out s3_584, out s4_585, out s5_586, out s6_587, out s7_588, out s8_589, out s9_590, out s10_591, out s11_592, out t4_593), &g_t2307E510, a3_81, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_594, out a0_595, out a1_596, out a2_597, out a3_105, out a4_598, out a5_599, out a7_600, out s2_601, out s3_602, out s4_603, out s5_604, out s6_605, out s7_606, out s8_607, out s9_608, out s10_609, out s11_610, out t4_611), &g_t2307E4B8, a3_105, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_612, out a0_613, out a1_614, out a2_615, out a3_616, out a4_617, out a5_618, out a7_619, out s2_620, out s3_137, out s4_621, out s5_622, out s6_623, out s7_624, out s8_625, out s9_626, out s10_627, out s11_628, out t4_629);
			Eq_2 s1_147 = 0x00;
			ui32 s6_150 = 0x0C;
			word32 s7_151 = 0x2307E000;
			while (s1_147 < 0x00)
			{
				Eq_2 a3_162;
				word32 s4_170;
				word32 s0_649;
				word32 s1_169;
				ra_132 = wifi_mgmr_ap_sta_info_get(ra_132, s1_147, out s0_649, out s1_169, out a3_162, out s4_170);
				if ((word32) bLoc47_447 != 0x00 && (word32) bLoc48_450 != s4_170)
				{
					word32 a1_183 = (word32) bLoc34;
					struct Eq_119752 * a5_185 = s3_137 + -0x0448;
					ui32 s0_186 = 0x00;
					while ((word32) a5_185->b0000 != a1_183)
					{
						ui32 s0_192 = s0_186 + 0x01;
						s0_186 = s0_192 & 0x00FF;
						++a5_185;
						if ((s0_192 & 0x00FF) == s6_150)
							break;
					}
					word32 a0_650;
					word32 a1_651;
					word32 a2_652;
					word32 a3_653;
					word32 a4_654;
					word32 a5_655;
					word32 a7_656;
					word32 s2_657;
					word32 s4_658;
					word32 s5_659;
					word32 s8_660;
					word32 s9_661;
					word32 s10_662;
					word32 s11_663;
					word32 t4_664;
					ra_132 = printf(ra_132, s7_151 + 0x0568, (word32) bLoc46_475, a3_162, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_169, out a0_650, out a1_651, out a2_652, out a3_653, out a4_654, out a5_655, out a7_656, out s2_657, out s3_137, out s4_658, out s5_659, out s6_150, out s7_151, out s8_660, out s9_661, out s10_662, out s11_663, out t4_664);
				}
				s1_147 = s1_169 + 0x01 & 0x00FF;
			}
			return;
		}
		a0_262 = (struct Eq_274 *) &g_t2307E480;
	}
	word32 s1_630;
	word32 a0_631;
	word32 a1_632;
	word32 a2_633;
	word32 a3_634;
	word32 a4_635;
	word32 a5_636;
	word32 a7_637;
	word32 s2_638;
	word32 s3_639;
	word32 s4_640;
	word32 s5_641;
	word32 s6_642;
	word32 s7_643;
	word32 s8_644;
	word32 s9_645;
	word32 s10_646;
	word32 s11_647;
	word32 t4_648;
	printf(ra, a0_262, a3_27, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_630, out a0_631, out a1_632, out a2_633, out a3_634, out a4_635, out a5_636, out a7_637, out s2_638, out s3_639, out s4_640, out s5_641, out s6_642, out s7_643, out s8_644, out s9_645, out s10_646, out s11_647, out t4_648);
}

// 2302764E: void wifi_ap_sta_delete_cmd(Register Eq_2 ra, Register (ptr32 Eq_2) a1, Register word32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
void wifi_ap_sta_delete_cmd(Eq_2 ra, union Eq_2 * a1, word32 a2, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	byte bLoc27_368 = SLICE(dwLoc28, byte, 8);
	byte bLoc28_369 = (byte) dwLoc28;
	byte bLoc26_388 = SLICE(dwLoc28, byte, 16);
	struct Eq_274 * a0_276;
	Eq_2 a3_148;
	if (a2 != 0x02)
	{
		a3_148 = *a1;
		a0_276 = (struct Eq_274 *) &g_t2307E350;
	}
	else
	{
		word32 a5_524;
		a3_148 = wifi_mgmr_state_get(fp + -44, out a5_524);
		if ((a1 & 16) == 0x00)
			a0_276 = (struct Eq_274 *) &g_t2307E458;
		else
		{
			Eq_2 a4_32;
			word32 a0_526;
			word32 s1_525;
			word32 a1_527;
			word32 s2_532;
			word32 a2_528;
			word32 a3_529;
			word32 a5_530;
			word32 a7_531;
			word32 s6_536;
			word32 s7_537;
			word32 s3_533;
			word32 s4_534;
			word32 s5_535;
			word32 s9_539;
			word32 s8_538;
			word32 s10_540;
			word32 t4_542;
			word32 s11_541;
			Eq_2 ra_34 = printf(ra, &g_t2307E368, a3_148, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_525, out a0_526, out a1_527, out a2_528, out a3_529, out a4_32, out a5_530, out a7_531, out s2_532, out s3_533, out s4_534, out s5_535, out s6_536, out s7_537, out s8_538, out s9_539, out s10_540, out s11_541, out t4_542);
			word32 a4_54;
			word32 a5_546;
			word32 a1_543;
			word32 a3_545;
			word32 a2_544;
			Eq_2 a0_52 = strlen(a4_32, out a1_543, out a2_544, out a3_545, out a4_54, out a5_546);
			struct Eq_119908 * a0_61 = (word32) a0_52 + a4_54;
			a0_61->b0000 = 0x00;
			ui32 s0_49 = 0x00;
			word32 a6_103 = 0x01;
			struct Eq_119908 * a1_63 = a0_61;
			while (a0_61 - a1_63 < a0_52)
			{
				word32 a3_72 = (word32) a1_63->bFFFFFFFF;
				uint32 a5_74 = a3_72 + -48 & 0x00FF;
				if (a5_74 > 0x09)
				{
					ui32 a5_82;
					if ((a3_72 + -97 & 0x00FF) <= 0x05)
					{
						a5_82 = a3_72 + -87;
						goto l23027724;
					}
					a5_74 = 0x00;
					if ((a3_72 + -65 & 0x00FF) <= 0x05)
					{
						a5_82 = a3_72 + -55;
l23027724:
						a5_74 = a5_82 & 0x00FF;
					}
				}
				a1_63 = (struct Eq_119908 *) &a1_63->bFFFFFFFF;
				s0_49 = (word32) (word16) (s0_49 + (a5_74 + a6_103));
				a6_103 += 0x0A;
			}
			Eq_2 s0_104 = s0_49 & 0x00FF;
			word32 a2_569;
			Eq_2 a3_123;
			word32 a1_568;
			word32 a0_567;
			word32 s1_566;
			word32 a4_570;
			word32 a5_571;
			word32 a7_572;
			word32 s2_573;
			word32 s3_574;
			word32 s4_575;
			word32 s5_576;
			word32 s6_577;
			word32 s7_578;
			word32 s8_579;
			word32 s9_580;
			word32 s10_581;
			word32 s11_582;
			word32 t4_583;
			word32 s1_584;
			word32 a0_585;
			word32 a1_586;
			word32 a2_587;
			word32 a4_588;
			word32 a5_589;
			word32 a7_590;
			word32 s2_591;
			word32 s3_592;
			word32 s4_593;
			word32 s5_594;
			word32 s6_595;
			word32 s7_596;
			word32 s8_597;
			word32 s9_598;
			word32 s10_599;
			word32 s11_600;
			word32 t4_601;
			ra = printf(printf(ra_34, &g_t2307E37C, s0_104, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_566, out a0_567, out a1_568, out a2_569, out a3_123, out a4_570, out a5_571, out a7_572, out s2_573, out s3_574, out s4_575, out s5_576, out s6_577, out s7_578, out s8_579, out s9_580, out s10_581, out s11_582, out t4_583), &g_t2307E3AC, a3_123, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_584, out a0_585, out a1_586, out a2_587, out a3_148, out a4_588, out a5_589, out a7_590, out s2_591, out s3_592, out s4_593, out s5_594, out s6_595, out s7_596, out s8_597, out s9_598, out s10_599, out s11_600, out t4_601);
			wifi_mgmr_ap_sta_cnt_get(fp + -45);
			if (false && s0_104 <= 0x00)
			{
				struct Eq_101482 * s0_193;
				word32 t1_602;
				word32 a0_603;
				word32 a1_604;
				word32 a2_605;
				word32 a3_606;
				word32 a4_607;
				word32 a5_608;
				word32 s1_609;
				word32 s4_610;
				ra = wifi_mgmr_ap_sta_info_get(memset(ra, fp + -40, 0x00, 0x18, out t1_602, out a0_603, out a1_604, out a2_605, out a3_606, out a4_607, out a5_608), s0_104, out s0_193, out s1_609, out a3_148, out s4_610);
				if ((word32) bLoc27_368 != 0x00)
				{
					byte bLoc28_396 = (byte) (word16) dwLoc28;
					if ((word32) bLoc28_369 != 0x00EF)
					{
						Eq_2 s1_228;
						Eq_2 s4_233;
						word32 a0_611;
						word32 a1_612;
						word32 a2_613;
						word32 a3_614;
						word32 a4_615;
						word32 a5_616;
						word32 a7_617;
						word32 s2_618;
						word32 s3_619;
						word32 s5_620;
						word32 s6_621;
						word32 s7_622;
						word32 s8_623;
						word32 s9_624;
						word32 s10_625;
						word32 s11_626;
						word32 t4_627;
						wifi_mgmr_ap_sta_delete(printf(ra, &g_t2307E408, (word32) bLoc26_388, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_228, out a0_611, out a1_612, out a2_613, out a3_614, out a4_615, out a5_616, out a7_617, out s2_618, out s3_619, out s4_233, out s5_620, out s6_621, out s7_622, out s8_623, out s9_624, out s10_625, out s11_626, out t4_627), s0_193, s1_228, (word32) bLoc28_396, s4_233, mstatus, dwLoc40, dwLoc3C, dwLoc24, dwArg0C, dwArg38, dwArg58, dwArg78, dwArg98, dwArgB8);
						return;
					}
				}
				a0_276 = (struct Eq_274 *) &g_t2307E3F0;
			}
			else
				a0_276 = (struct Eq_274 *) &g_t2307E3BC;
		}
	}
	word32 s1_547;
	word32 a2_550;
	word32 a0_548;
	word32 a1_549;
	word32 a5_553;
	word32 s3_556;
	word32 a3_551;
	word32 a4_552;
	word32 s6_559;
	word32 a7_554;
	word32 s2_555;
	word32 s5_558;
	word32 s4_557;
	word32 s9_562;
	word32 s8_561;
	word32 s7_560;
	word32 s10_563;
	word32 t4_565;
	word32 s11_564;
	printf(ra, a0_276, a3_148, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_547, out a0_548, out a1_549, out a2_550, out a3_551, out a4_552, out a5_553, out a7_554, out s2_555, out s3_556, out s4_557, out s5_558, out s6_559, out s7_560, out s8_561, out s9_562, out s10_563, out s11_564, out t4_565);
}

