pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230277B4: void cmd_wifi_coex_pta_force_off(Register (ptr32 word32) a3, Register ptr32 mstatus)
void cmd_wifi_coex_pta_force_off(word32 * a3, ptr32 mstatus)
{
	word32 s0_23;
	word32 a0_24;
	word32 a2_25;
	word32 a3_26;
	word32 s2_27;
	word32 s3_28;
	word32 mstatus_29;
	coex_wifi_pta_forece_enable(0x00, a3, mstatus, out s0_23, out a0_24, out a2_25, out a3_26, out s2_27, out s3_28, out mstatus_29);
}

// 230277BA: void cmd_wifi_coex_pta_force_on(Register (ptr32 word32) a3, Register ptr32 mstatus)
void cmd_wifi_coex_pta_force_on(word32 * a3, ptr32 mstatus)
{
	word32 s0_23;
	word32 a0_24;
	word32 a2_25;
	word32 a3_26;
	word32 s2_27;
	word32 s3_28;
	word32 mstatus_29;
	coex_wifi_pta_forece_enable(0x01, a3, mstatus, out s0_23, out a0_24, out a2_25, out a3_26, out s2_27, out s3_28, out mstatus_29);
}

// 230277C0: void cmd_wifi_coex_pti_force_off()
void cmd_wifi_coex_pti_force_off()
{
	coex_wifi_pti_forece_enable(0x00);
}

// 230277C6: void cmd_wifi_coex_pti_force_on()
void cmd_wifi_coex_pti_force_on()
{
	coex_wifi_pti_forece_enable(0x01);
}

// 230277CC: void cmd_wifi_coex_rf_force_off()
void cmd_wifi_coex_rf_force_off()
{
	coex_wifi_rf_forece_enable(0x00);
}

// 230277D2: void cmd_wifi_coex_rf_force_on()
void cmd_wifi_coex_rf_force_on()
{
	coex_wifi_rf_forece_enable(0x01);
}

// 230277D8: void cmd_wifi_mib(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0198)
void cmd_wifi_mib(Eq_2 ra, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0198)
{
	union Eq_2 * a0_8;
	Eq_2 s1_16;
	Eq_2 s10_17;
	Eq_2 ra_15 = hal_mib_dump(ra, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_16, out a0_8, out s10_17);
	Eq_2 a3_34 = *a0_8;
	word32 s0_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 s2_77;
	utils_hexdump(ra_15, s1_16, 0x1E, a3_34, s10_17, dwArg30, dwArg34, dwArg7C, dwArg0198, out s0_73, out a2_74, out a3_75, out a4_76, out s2_77);
}

// 230277F0: void cmd_wifi_cfg(Register Eq_2 ra, Register (ptr32 Eq_120302) a2, Register (ptr32 (arr (ptr32 Eq_250642))) a3, Register (ptr32 Eq_120302) a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack up32 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98)
void cmd_wifi_cfg(Eq_2 ra, struct Eq_120302 * a2, struct Eq_250642 * (* a3)[], struct Eq_120302 * a4, Eq_2 s2, Eq_2 s4, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg5C, up32 dwArg64, Eq_2 dwArg78, Eq_2 dwArg98)
{
	utils_getopt_init(fp + -84, null);
	struct Eq_120302 * s6_33 = a2;
	struct Eq_250642 * (* s4_35)[] = a3;
	word32 s7_42 = 0x2307E000;
	ra_57 = ra;
	while (true)
	{
		Eq_2 ra_57;
		Eq_2 a0_59;
		Eq_2 a1_66;
		word32 s10_71;
		word32 s11_72;
		Eq_2 s3_74;
		Eq_2 s5_76;
		word32 s8_79;
		word32 s9_80;
		word32 a3_714;
		ra_57 = utils_getopt(ra_57, fp + -84, s6_33, s4_35, s7_42 + -0x06E4, a4, s10, dwArg00, dwArg04, dwArg28, ra, out a0_59, out a1_66, out a3_714, out s3_74, out s4_35, out s5_76, out s6_33, out s7_42, out s8_79, out s9_80, out s10_71, out s11_72);
		a4 = (struct Eq_120302 *) 118;
		if (a0_59 == ~0x00)
			break;
		if (a0_59 != s5_76)
		{
			if (s5_76 < a0_59)
			{
				if (a0_59 != 116)
				{
					if (a0_59 != 118)
					{
						if (a0_59 == 101)
						{
							word32 a1_727;
							word32 a2_728;
							word32 a3_729;
							word32 a5_730;
							atoi(a0_59, out a1_727, out a2_728, out a3_729, out a4, out a5_730);
						}
					}
					else
					{
						word32 a1_723;
						word32 a2_724;
						word32 a3_725;
						word32 a5_726;
						atoi(a0_59, out a1_723, out a2_724, out a3_725, out a4, out a5_726);
					}
				}
				else
				{
					word32 a1_719;
					word32 a2_720;
					word32 a3_721;
					word32 a5_722;
					atoi(a0_59, out a1_719, out a2_720, out a3_721, out a4, out a5_722);
				}
				continue;
			}
			if (a0_59 == 63)
			{
				word32 s1_695;
				word32 a0_696;
				word32 a1_697;
				word32 a2_698;
				word32 a3_699;
				word32 a4_700;
				word32 a5_701;
				word32 a7_702;
				word32 s2_703;
				word32 s3_704;
				word32 s4_705;
				word32 s5_706;
				word32 s6_707;
				word32 s7_708;
				word32 s8_709;
				word32 s9_710;
				word32 s10_711;
				word32 s11_712;
				word32 t4_713;
				printf(ra_57, &g_t2307D904, ~0x00, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_695, out a0_696, out a1_697, out a2_698, out a3_699, out a4_700, out a5_701, out a7_702, out s2_703, out s3_704, out s4_705, out s5_706, out s6_707, out s7_708, out s8_709, out s9_710, out s10_711, out s11_712, out t4_713);
				return;
			}
			else
			{
				if (a0_59 == 84)
				{
					word32 a1_715;
					word32 a2_716;
					word32 a3_717;
					word32 a5_718;
					atoi(a0_59, out a1_715, out a2_716, out a3_717, out a4, out a5_718);
				}
				continue;
			}
		}
		Eq_2 a1_92;
		word32 a2_692;
		word32 a3_693;
		word32 a5_694;
		if (strcmp(s8_79 + 0x0780, a1_66, out a1_92, out a2_692, out a3_693, out a4, out a5_694) != 0x00)
		{
			Eq_2 a1_104;
			word32 a2_731;
			word32 a3_732;
			word32 a5_733;
			if (strcmp(s9_80 + 0x0744, a1_92, out a1_104, out a2_731, out a3_732, out a4, out a5_733) != 0x00)
			{
				Eq_2 a1_116;
				word32 a2_734;
				word32 a3_735;
				word32 a5_736;
				if (strcmp(s10_71 + 1900, a1_104, out a1_116, out a2_734, out a3_735, out a4, out a5_736) != 0x00)
				{
					word32 a1_737;
					word32 a2_738;
					word32 a3_739;
					word32 a5_740;
					strcmp(s11_72 + -0x0704, a1_116, out a1_737, out a2_738, out a3_739, out a4, out a5_740) != 0x00;
				}
			}
		}
	}
	Eq_2 a5_286;
	Eq_2 ra_272;
	Eq_2 s1_273;
	uint32 a0_291;
	Eq_2 s3_277;
	Eq_2 a4_287;
	Eq_2 a3_242;
	word32 t4_640;
	word32 s8_636;
	word32 s11_639;
	word32 s9_637;
	word32 s10_638;
	word32 s4_632;
	word32 s7_635;
	word32 s5_633;
	word32 s6_634;
	word32 a5_628;
	word32 s3_631;
	word32 a7_629;
	word32 s2_630;
	word32 a4_627;
	word32 s1_623;
	word32 a1_625;
	word32 a2_626;
	word32 a0_624;
	Eq_2 ra_245 = printf(ra_57, &g_t2307D928, s3_74, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_623, out a0_624, out a1_625, out a2_626, out a3_242, out a4_627, out a5_628, out a7_629, out s2_630, out s3_631, out s4_632, out s5_633, out s6_634, out s7_635, out s8_636, out s9_637, out s10_638, out s11_639, out t4_640);
	if (dwArg64 == 0x02)
	{
		word32 s11_656;
		word32 t4_657;
		word32 s7_652;
		word32 s10_655;
		word32 s8_653;
		word32 s9_654;
		word32 s4_649;
		word32 s5_650;
		word32 s6_651;
		word32 s2_648;
		word32 a3_644;
		word32 a7_647;
		word32 a4_645;
		word32 a5_646;
		word32 a2_643;
		word32 a0_641;
		word32 a1_642;
		ra_272 = printf(ra_245, &g_t2307D970, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_641, out a1_642, out a2_643, out a3_644, out a4_645, out a5_646, out a7_647, out s2_648, out s3_277, out s4_649, out s5_650, out s6_651, out s7_652, out s8_653, out s9_654, out s10_655, out s11_656, out t4_657);
		a5_286.u0 = 0x00;
		a4_287.u0 = 0x00;
		a0_291 = 0x02;
		goto l230278A4;
	}
	if (dwArg64 <= 0x02)
	{
		if (dwArg64 == 0x01)
		{
			word32 t4_674;
			word32 s9_671;
			word32 s10_672;
			word32 s11_673;
			word32 s6_668;
			word32 s7_669;
			word32 s8_670;
			word32 s5_667;
			word32 a7_664;
			word32 s2_665;
			word32 s4_666;
			word32 a4_662;
			word32 a5_663;
			word32 a1_659;
			word32 a2_660;
			word32 a3_661;
			word32 a0_658;
			ra_272 = printf(ra_245, &g_t2307D970, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_658, out a1_659, out a2_660, out a3_661, out a4_662, out a5_663, out a7_664, out s2_665, out s3_277, out s4_666, out s5_667, out s6_668, out s7_669, out s8_670, out s9_671, out s10_672, out s11_673, out t4_674);
			a5_286 = fp + -88;
			a4_287.u0 = 0x04;
			a0_291 = 0x01;
			goto l230278A4;
		}
	}
	else
	{
		if (dwArg64 == 0x03)
		{
			word32 a0_741;
			word32 a1_742;
			word32 a2_743;
			word32 a3_744;
			word32 a4_745;
			word32 a5_746;
			word32 a7_747;
			word32 s2_748;
			word32 s4_749;
			word32 s5_750;
			word32 s6_751;
			word32 s7_752;
			word32 s8_753;
			word32 s9_754;
			word32 s10_755;
			word32 s11_756;
			word32 t4_757;
			ra_272 = printf(ra_245, &g_t2307D970, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_741, out a1_742, out a2_743, out a3_744, out a4_745, out a5_746, out a7_747, out s2_748, out s3_277, out s4_749, out s5_750, out s6_751, out s7_752, out s8_753, out s9_754, out s10_755, out s11_756, out t4_757);
			a5_286.u0 = 0x00;
			a4_287.u0 = 0x00;
			a0_291 = 0x03;
l230278A4:
			wifi_mgmr_cfg_req(ra_272, s1_273, a0_291, a4_287, a5_286, s3_277, mstatus, s10, s4, dwArg08, s9, dwArg58, dwArg78, dwArg98);
			return;
		}
		if (dwArg64 == 0x04)
		{
			word32 s1_758;
			word32 a0_759;
			word32 a1_760;
			word32 a2_761;
			word32 a3_762;
			word32 a4_763;
			word32 a5_764;
			word32 a7_765;
			word32 s2_766;
			word32 s3_767;
			word32 s4_768;
			word32 s5_769;
			word32 s6_770;
			word32 s7_771;
			word32 s8_772;
			word32 s9_773;
			word32 s10_774;
			word32 s11_775;
			word32 t4_776;
			printf(ra_245, &g_t2307D980, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_758, out a0_759, out a1_760, out a2_761, out a3_762, out a4_763, out a5_764, out a7_765, out s2_766, out s3_767, out s4_768, out s5_769, out s6_770, out s7_771, out s8_772, out s9_773, out s10_774, out s11_775, out t4_776);
			return;
		}
	}
	word32 a5_680;
	word32 a4_679;
	word32 a3_678;
	word32 a2_677;
	word32 a1_676;
	word32 a0_675;
	word32 a7_681;
	word32 s2_682;
	word32 s4_683;
	word32 s5_684;
	word32 s6_685;
	word32 s7_686;
	word32 s8_687;
	word32 s9_688;
	word32 s10_689;
	word32 s11_690;
	word32 t4_691;
	ra_272 = printf(ra_245, &g_t2307D970, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_675, out a1_676, out a2_677, out a3_678, out a4_679, out a5_680, out a7_681, out s2_682, out s3_277, out s4_683, out s5_684, out s6_685, out s7_686, out s8_687, out s9_688, out s10_689, out s11_690, out t4_691);
	a5_286 = fp + -88;
	a4_287.u0 = 0x04;
	a0_291 = 0x00;
	goto l230278A4;
}

