pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230279DE: void cmd_wifi_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void cmd_wifi_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_12;
	Eq_2 ra_18 = wifi_mgmr_ap_stop(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a3_12);
	word32 s1_80;
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a5_86;
	word32 a7_87;
	word32 s2_88;
	word32 s3_89;
	word32 s4_90;
	word32 s5_91;
	word32 s6_92;
	word32 s7_93;
	word32 s8_94;
	word32 s9_95;
	word32 s10_96;
	word32 s11_97;
	word32 t4_98;
	printf(ra_18, &g_t2307D8E0, a3_12, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_80, out a0_81, out a1_82, out a2_83, out a3_84, out a4_85, out a5_86, out a7_87, out s2_88, out s3_89, out s4_90, out s5_91, out s6_92, out s7_93, out s8_94, out s9_95, out s10_96, out s11_97, out t4_98);
}

// 230279F8: void cmd_wifi_ap_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128)
void cmd_wifi_ap_start(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0128)
{
	Eq_2 a4_134;
	Eq_2 a3_137;
	word32 a0_266;
	word32 t1_265;
	word32 a1_267;
	word32 a2_268;
	word32 a3_269;
	word32 a4_270;
	word32 a5_271;
	Eq_2 ra_25 = memset(ra, fp + -56, 0x00, 0x06, out t1_265, out a0_266, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271);
	bl_wifi_mac_addr_get(fp + -56);
	Eq_2 s1_71;
	Eq_2 s2_74;
	ptr32 mstatus_95;
	word32 s0_97;
	struct Eq_120972 * s2_99;
	word32 t1_272;
	word32 a0_273;
	word32 a1_274;
	word32 a2_275;
	word32 a3_276;
	word32 a4_277;
	word32 a5_278;
	word32 s0_279;
	word32 a0_280;
	word32 a1_281;
	word32 a2_282;
	word32 a3_283;
	word32 a4_284;
	word32 a5_285;
	word32 a7_286;
	word32 s3_287;
	word32 s4_288;
	word32 s5_289;
	word32 s6_290;
	word32 s7_291;
	word32 s8_292;
	word32 s9_293;
	word32 s10_294;
	word32 s11_295;
	Eq_2 ra_96 = wifi_mgmr_ap_enable(snprintf(memset(ra_25, fp + -48, 0x00, 32, out t1_272, out a0_273, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278), fp + -48, 32, &g_t2307D8BC, s2, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_279, out s1_71, out a0_280, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a7_286, out s2_74, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295), s1_71, s2_74, mstatus, dwLoc3C, dwLoc08, dwArg08, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArg0128, out s0_97, out s2_99, out mstatus_95);
	if (s0_97 == 0x01)
	{
		a4_134.u0 = 0x01;
		a3_137.u0 = 0x00;
	}
	else
	{
		word32 a1_296;
		word32 a2_297;
		word32 a3_298;
		word32 a4_299;
		word32 a5_300;
		Eq_2 a0_117 = atoi(s2_99->t0004, out a1_296, out a2_297, out a3_298, out a4_299, out a5_300);
		a4_134 = a0_117;
		if (a0_117 > ~0x0A)
			return;
		a3_137.u0 = 587716820;
	}
	wifi_mgmr_ap_start(ra_96, fp + -48, a3_137, a4_134, mstatus_95, dwLoc40, dwLoc3C, dwLoc18, dwArg18, dwArg38, s1, dwArg78);
}

// 23027A92: void wifi_sniffer_off_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void wifi_sniffer_off_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	wifi_mgmr_sniffer_disable(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
	wifi_mgmr_sniffer_unregister();
}

// 23027AA4: void wifi_sniffer_on_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void wifi_sniffer_on_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	wifi_mgmr_sniffer_enable(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
	wifi_mgmr_sniffer_register(0x00, 587365516);
}

// 23027ABE: void wifi_denoise_disable_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_denoise_disable_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_denoise_disable(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

