pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23027AFC: void wifi_sta_ip_unset_cmd(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_121535) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void wifi_sta_ip_unset_cmd(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_121535 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	wifi_mgmr_sta_ip_unset(ra, mstatus, dwArg10, dwArg14, dwArg38, dwArg44, dwArg60, dwArg88, dwArg94, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 23027B00: void wifi_sta_ip_info(Register Eq_2 ra, Register (ptr32 Eq_121557) a4, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C)
void wifi_sta_ip_info(Eq_2 ra, struct Eq_121557 * a4, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C)
{
	int8 bLoc36_411 = SLICE(dwLoc38, int8, 16);
	wifi_mgmr_sta_ip_get(fp + -80, fp + -76, fp + -72, a4);
	wifi_mgmr_sta_dns_get(fp + -0x0044, fp + -64);
	wifi_mgmr_rssi_get(fp + -60);
	word32 s1_434;
	word32 a0_435;
	word32 a1_436;
	word32 a2_437;
	word32 a3_438;
	word32 a4_439;
	word32 a5_440;
	word32 a7_441;
	word32 s2_442;
	word32 s3_443;
	word32 s4_444;
	word32 s5_445;
	word32 s6_446;
	word32 s7_447;
	word32 s8_448;
	word32 s9_449;
	word32 s10_450;
	word32 s11_451;
	word32 t4_452;
	Eq_2 ra_50 = printf(ra, &g_t2307EB90, bl_tpc_power_table_get(fp + -56), dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_434, out a0_435, out a1_436, out a2_437, out a3_438, out a4_439, out a5_440, out a7_441, out s2_442, out s3_443, out s4_444, out s5_445, out s6_446, out s7_447, out s8_448, out s9_449, out s10_450, out s11_451, out t4_452);
	Eq_2 a3_68;
	word32 a4_453;
	word32 a5_454;
	ip4addr_ntoa(out a3_68, out a4_453, out a5_454);
	word32 s1_455;
	word32 a0_456;
	word32 a1_457;
	word32 a2_458;
	word32 a3_459;
	word32 a4_460;
	word32 a5_461;
	word32 a7_462;
	word32 s2_463;
	word32 s3_464;
	word32 s4_465;
	word32 s5_466;
	word32 s6_467;
	word32 s7_468;
	word32 s8_469;
	word32 s9_470;
	word32 s10_471;
	word32 s11_472;
	word32 t4_473;
	Eq_2 ra_91 = printf(ra_50, &g_t2307EBA0, a3_68, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_455, out a0_456, out a1_457, out a2_458, out a3_459, out a4_460, out a5_461, out a7_462, out s2_463, out s3_464, out s4_465, out s5_466, out s6_467, out s7_468, out s8_469, out s9_470, out s10_471, out s11_472, out t4_473);
	Eq_2 a3_109;
	word32 a4_474;
	word32 a5_475;
	ip4addr_ntoa(out a3_109, out a4_474, out a5_475);
	word32 s1_476;
	word32 a0_477;
	word32 a1_478;
	word32 a2_479;
	word32 a3_480;
	word32 a4_481;
	word32 a5_482;
	word32 a7_483;
	word32 s2_484;
	word32 s3_485;
	word32 s4_486;
	word32 s5_487;
	word32 s6_488;
	word32 s7_489;
	word32 s8_490;
	word32 s9_491;
	word32 s10_492;
	word32 s11_493;
	word32 t4_494;
	Eq_2 ra_132 = printf(ra_91, &g_t2307EBB0, a3_109, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_476, out a0_477, out a1_478, out a2_479, out a3_480, out a4_481, out a5_482, out a7_483, out s2_484, out s3_485, out s4_486, out s5_487, out s6_488, out s7_489, out s8_490, out s9_491, out s10_492, out s11_493, out t4_494);
	Eq_2 a3_150;
	word32 a4_495;
	word32 a5_496;
	ip4addr_ntoa(out a3_150, out a4_495, out a5_496);
	word32 s1_497;
	word32 a0_498;
	word32 a1_499;
	word32 a2_500;
	word32 a3_501;
	word32 a4_502;
	word32 a5_503;
	word32 a7_504;
	word32 s2_505;
	word32 s3_506;
	word32 s4_507;
	word32 s5_508;
	word32 s6_509;
	word32 s7_510;
	word32 s8_511;
	word32 s9_512;
	word32 s10_513;
	word32 s11_514;
	word32 t4_515;
	Eq_2 ra_173 = printf(ra_132, &g_t2307EBC0, a3_150, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_497, out a0_498, out a1_499, out a2_500, out a3_501, out a4_502, out a5_503, out a7_504, out s2_505, out s3_506, out s4_507, out s5_508, out s6_509, out s7_510, out s8_511, out s9_512, out s10_513, out s11_514, out t4_515);
	Eq_2 a3_191;
	word32 a4_516;
	word32 a5_517;
	ip4addr_ntoa(out a3_191, out a4_516, out a5_517);
	word32 s1_518;
	word32 a0_519;
	word32 a1_520;
	word32 a2_521;
	word32 a3_522;
	word32 a4_523;
	word32 a5_524;
	word32 a7_525;
	word32 s2_526;
	word32 s3_527;
	word32 s4_528;
	word32 s5_529;
	word32 s6_530;
	word32 s7_531;
	word32 s8_532;
	word32 s9_533;
	word32 s10_534;
	word32 s11_535;
	word32 t4_536;
	Eq_2 ra_214 = printf(ra_173, &g_t2307EBD0, a3_191, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_518, out a0_519, out a1_520, out a2_521, out a3_522, out a4_523, out a5_524, out a7_525, out s2_526, out s3_527, out s4_528, out s5_529, out s6_530, out s7_531, out s8_532, out s9_533, out s10_534, out s11_535, out t4_536);
	Eq_2 a3_232;
	word32 a4_537;
	word32 a5_538;
	ip4addr_ntoa(out a3_232, out a4_537, out a5_538);
	word32 s1_539;
	word32 a0_540;
	word32 a1_541;
	word32 a2_542;
	word32 a3_543;
	word32 a4_544;
	word32 a5_545;
	word32 a7_546;
	word32 s2_547;
	word32 s3_548;
	word32 s4_549;
	word32 s5_550;
	word32 s6_551;
	word32 s7_552;
	word32 s8_553;
	word32 s9_554;
	word32 s10_555;
	word32 s11_556;
	word32 t4_557;
	Eq_2 ra_255 = printf(ra_214, &g_t2307EBE0, a3_232, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_539, out a0_540, out a1_541, out a2_542, out a3_543, out a4_544, out a5_545, out a7_546, out s2_547, out s3_548, out s4_549, out s5_550, out s6_551, out s7_552, out s8_553, out s9_554, out s10_555, out s11_556, out t4_557);
	word32 a0_558;
	word32 a1_559;
	word32 a2_560;
	word32 a4_561;
	word32 a5_562;
	word32 s4_563;
	word32 s8_564;
	puts(587721712, out a0_558, out a1_559, out a2_560, out a4_561, out a5_562, out s4_563, out s8_564);
	word32 a0_565;
	word32 a1_566;
	word32 a2_567;
	word32 a4_568;
	word32 a5_569;
	word32 s4_570;
	word32 s8_571;
	puts(0x2307E7F0, out a0_565, out a1_566, out a2_567, out a4_568, out a5_569, out s4_570, out s8_571);
	word32 s1_572;
	word32 a0_573;
	word32 a1_574;
	word32 a2_575;
	word32 a3_576;
	word32 a4_577;
	word32 a5_578;
	word32 a7_579;
	word32 s2_580;
	word32 s3_581;
	word32 s4_582;
	word32 s5_583;
	word32 s6_584;
	word32 s7_585;
	word32 s8_586;
	word32 s9_587;
	word32 s10_588;
	word32 s11_589;
	word32 t4_590;
	word32 s1_591;
	word32 a0_592;
	word32 a1_593;
	word32 a2_594;
	word32 a3_595;
	word32 a4_596;
	word32 a5_597;
	word32 a7_598;
	word32 s2_599;
	word32 s3_600;
	word32 s4_601;
	word32 s5_602;
	word32 s6_603;
	word32 s7_604;
	word32 s8_605;
	word32 s9_606;
	word32 s10_607;
	word32 s11_608;
	word32 t4_609;
	word32 s1_610;
	word32 a0_611;
	word32 a1_612;
	word32 a2_613;
	word32 a3_614;
	word32 a4_615;
	word32 a5_616;
	word32 a7_617;
	word32 s2_618;
	word32 s3_619;
	word32 s4_620;
	word32 s5_621;
	word32 s6_622;
	word32 s7_623;
	word32 s8_624;
	word32 s9_625;
	word32 s10_626;
	word32 s11_627;
	word32 t4_628;
	printf(printf(printf(ra_255, &g_t2307EC08, (int32) bLoc36_411, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_572, out a0_573, out a1_574, out a2_575, out a3_576, out a4_577, out a5_578, out a7_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590), &g_t2307EC48, (int32) bLoc2E, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_591, out a0_592, out a1_593, out a2_594, out a3_595, out a4_596, out a5_597, out a7_598, out s2_599, out s3_600, out s4_601, out s5_602, out s6_603, out s7_604, out s8_605, out s9_606, out s10_607, out s11_608, out t4_609), &g_t2307ECA4, (int32) bLoc26, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_610, out a0_611, out a1_612, out a2_613, out a3_614, out a4_615, out a5_616, out a7_617, out s2_618, out s3_619, out s4_620, out s5_621, out s6_622, out s7_623, out s8_624, out s9_625, out s10_626, out s11_627, out t4_628);
	word32 a0_629;
	word32 a1_630;
	word32 a2_631;
	word32 a4_632;
	word32 a5_633;
	word32 s4_634;
	word32 s8_635;
	puts(0x2307E7F0, out a0_629, out a1_630, out a2_631, out a4_632, out a5_633, out s4_634, out s8_635);
}

