pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23027C36: void cmd_wifi_raw_send(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_122073) a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void cmd_wifi_raw_send(Eq_2 ra, Eq_2 s1, struct Eq_122073 * a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a0_52;
	word32 a5_8 = a4->dw0000;
	g_b4200D47A = (byte) (a4 << 0x04);
	g_b4200D47B = (byte) (a4 << 0x04 >> 8);
	a4->dw0001 = a5_8;
	if (wifi_mgmr_raw_80211_send(ra, s1, 0x18, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128) != 0x00)
		a0_52.u0 = 587717088;
	else
		a0_52.u0 = 587717108;
	word32 s8_109;
	word32 s4_108;
	word32 a5_107;
	word32 a4_106;
	word32 a2_105;
	word32 a1_104;
	word32 a0_103;
	puts(a0_52, out a0_103, out a1_104, out a2_105, out a4_106, out a5_107, out s4_108, out s8_109);
}

// 23027C84: void wifi_scan_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_scan_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_scan(ra, 0x00, 0x00, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027C8C: void sniffer_cb(Register (ptr32 Eq_122186) a4)
void sniffer_cb(struct Eq_122186 * a4)
{
	a4->dw0001 = a4->dw0000;
	word32 * a5_16;
	Eq_2 a0_15 = xTaskGetTickCount(out a5_16);
	word32 s0_17 = *a5_16;
	if (a0_15 - a5_16 > 0x02000710)
	{
		word32 a5_37;
		*xTaskGetTickCount(out a5_37) = s0_17;
	}
}

// 23027CC8: void cmd_wifi_dump(Register Eq_2 ra, Register int32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack word32 dwArg0108)
void cmd_wifi_dump(Eq_2 ra, int32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, word32 dwArg0108)
{
	Eq_2 a4_22;
	word32 a0_23;
	if (a2 > 0x01)
	{
		Eq_2 a4_31;
		word32 a0_97;
		word32 a1_98;
		word32 a2_99;
		word32 a5_100;
		word32 s4_101;
		word32 s8_102;
		puts(587717008, out a0_97, out a1_98, out a2_99, out a4_31, out a5_100, out s4_101, out s8_102);
		word32 a5_103;
		a4_22 = vTaskEnterCritical(a4_31, mstatus, out a5_103);
		a0_23 = 0x01;
	}
	else
	{
		Eq_2 a4_15;
		word32 s4_94;
		word32 s8_95;
		word32 a5_93;
		word32 a2_92;
		word32 a1_91;
		word32 a0_90;
		puts(587717048, out a0_90, out a1_91, out a2_92, out a4_15, out a5_93, out s4_94, out s8_95);
		word32 a5_96;
		a4_22 = vTaskEnterCritical(a4_15, mstatus, out a5_96);
		a0_23 = 0x00;
	}
	Eq_2 a3_52 = bl60x_fw_dump_statistic(ra, a0_23, a3, a4_22, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108);
	word32 a4_104;
	word32 a5_105;
	vTaskExitCritical(a3_52, mstatus, out a4_104, out a5_105);
}

// 23027D04: void cmd_wifi_ap_conf_max_sta(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cmd_wifi_ap_conf_max_sta(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a2 == 0x02)
	{
		Eq_2 a3_16;
		word32 a1_176;
		word32 a2_177;
		word32 a4_178;
		word32 a5_179;
		atoi(a0, out a1_176, out a2_177, out a3_16, out a4_178, out a5_179);
		Eq_2 s4_46;
		word32 s1_180;
		word32 a0_181;
		word32 a1_182;
		word32 a2_183;
		word32 a3_184;
		word32 a4_185;
		word32 a5_186;
		word32 a7_187;
		word32 s2_188;
		word32 s3_189;
		word32 s5_190;
		word32 s6_191;
		word32 s7_192;
		word32 s8_193;
		word32 s9_194;
		word32 s10_195;
		word32 s11_196;
		word32 t4_197;
		Eq_2 ra_40 = printf(ra, &g_t2307D8A4, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_46, out s5_190, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
		wifi_mgmr_conf_max_sta(ra_40, s4_46, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_198;
		word32 a0_199;
		word32 a1_200;
		word32 a2_201;
		word32 a3_202;
		word32 a4_203;
		word32 a5_204;
		word32 a7_205;
		word32 s2_206;
		word32 s3_207;
		word32 s4_208;
		word32 s5_209;
		word32 s6_210;
		word32 s7_211;
		word32 s8_212;
		word32 s9_213;
		word32 s10_214;
		word32 s11_215;
		word32 t4_216;
		printf(ra, &g_t2307D884, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
	}
}

// 23027D40: void wifi_mon_cmd(Register Eq_2 ra, Register int32 a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_mon_cmd(Eq_2 ra, int32 a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a2 <= 0x01)
		wifi_mgmr_sniffer_register(0x00, 587365516);
	else
		wifi_mgmr_sniffer_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027D58: void wifi_rc_fixed_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_rc_fixed_enable(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a2 == 0x04)
	{
		word32 a5_347;
		word32 a4_346;
		word32 a3_345;
		word32 a2_344;
		word32 a1_343;
		Eq_2 a0_23 = atoi(a0, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347);
		word32 a2_354;
		word32 a3_355;
		word32 a1_353;
		word32 a5_352;
		word32 a4_351;
		word32 a3_350;
		word32 a2_349;
		word32 a1_348;
		word32 a4_356;
		word32 a5_357;
		Eq_2 a0_59 = atoi(atoi(a0_23, out a1_348, out a2_349, out a3_350, out a4_351, out a5_352), out a1_353, out a2_354, out a3_355, out a4_356, out a5_357);
		Eq_2 a3_94;
		word32 s1_98;
		word32 s2_101;
		word32 s3_102;
		word32 s4_103;
		word32 a0_377;
		word32 a1_378;
		word32 a2_379;
		word32 a4_380;
		word32 a5_381;
		word32 a7_382;
		word32 s5_383;
		word32 s6_384;
		word32 s7_385;
		word32 s8_386;
		word32 s9_387;
		word32 s10_388;
		word32 s11_389;
		word32 t4_390;
		Eq_2 ra_97 = printf(ra, &g_t2307E848, a0_59 & 0x00FF, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_98, out a0_377, out a1_378, out a2_379, out a3_94, out a4_380, out a5_381, out a7_382, out s2_101, out s3_102, out s4_103, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out s10_388, out s11_389, out t4_390);
		word32 s1_391;
		word32 a0_392;
		word32 a1_393;
		word32 a2_394;
		word32 a3_395;
		word32 a4_396;
		word32 a5_397;
		word32 a7_398;
		word32 s2_399;
		word32 s3_400;
		word32 s4_401;
		word32 s5_402;
		word32 s6_403;
		word32 s7_404;
		word32 s8_405;
		word32 s9_406;
		word32 s10_407;
		word32 s11_408;
		word32 t4_409;
		Eq_2 ra_141 = printf(ra_97, &g_t2307E86C, a3_94, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_391, out a0_392, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397, out a7_398, out s2_399, out s3_400, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409);
		wifi_mgmr_rate_config(ra_141, dwArg04, mstatus, dwArg18, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_358;
		word32 a0_359;
		word32 a1_360;
		word32 a2_361;
		word32 a3_362;
		word32 a4_363;
		word32 a5_364;
		word32 a7_365;
		word32 s2_366;
		word32 s3_367;
		word32 s4_368;
		word32 s5_369;
		word32 s6_370;
		word32 s7_371;
		word32 s8_372;
		word32 s9_373;
		word32 s10_374;
		word32 s11_375;
		word32 t4_376;
		printf(ra, &g_t2307E828, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_358, out a0_359, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a7_365, out s2_366, out s3_367, out s4_368, out s5_369, out s6_370, out s7_371, out s8_372, out s9_373, out s10_374, out s11_375, out t4_376);
	}
}

