pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23027E22: void wifi_connect_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_2) a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
void wifi_connect_cmd(Eq_2 ra, Eq_2 s0, Eq_2 s1, union Eq_2 * a1, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	if (a2 == 0x03)
	{
		Eq_2 a1_16;
		ptr32 mstatus_23;
		Eq_2 s2_29;
		Eq_2 ra_24 = wifi_mgmr_sta_enable(ra, s1, a3, s2, mstatus, s0, dwLoc08, dwArg28, dwArg38, dwArg40, dwArg44, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0158, out a1_16, out s2_29, out mstatus_23);
		wifi_mgmr_sta_connect(ra_24, a1_16, dwArg10, 0x00, s2_29, mstatus_23, dwArg18, dwArg38, dwArg58, dwArg78, dwArg84, dwArgC4);
	}
	else
	{
		Eq_2 a3_86 = *a1;
		word32 s1_178;
		word32 a0_179;
		word32 a1_180;
		word32 a2_181;
		word32 a3_182;
		word32 a4_183;
		word32 a5_184;
		word32 a7_185;
		word32 s2_186;
		word32 s3_187;
		word32 s4_188;
		word32 s5_189;
		word32 s6_190;
		word32 s7_191;
		word32 s8_192;
		word32 s9_193;
		word32 s10_194;
		word32 s11_195;
		word32 t4_196;
		printf(ra, &g_t2307E604, a3_86, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_178, out a0_179, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184, out a7_185, out s2_186, out s3_187, out s4_188, out s5_189, out s6_190, out s7_191, out s8_192, out s9_193, out s10_194, out s11_195, out t4_196);
	}
}

// 23027E54: void wifi_sta_ip_set_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_121535) s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void wifi_sta_ip_set_cmd(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_121535 * s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	if (a2 != 0x06)
	{
		word32 a0_629;
		word32 a1_630;
		word32 a2_631;
		word32 a4_632;
		word32 a5_633;
		word32 s4_634;
		word32 s8_635;
		puts(0x2307ECD4, out a0_629, out a1_630, out a2_631, out a4_632, out a5_633, out s4_634, out s8_635);
	}
	else
	{
		Eq_2 a0_23;
		word32 a3_505;
		ipaddr_addr(a0, out a0_23, out a3_505);
		Eq_2 a0_43;
		word32 a3_506;
		ipaddr_addr(a0_23, out a0_43, out a3_506);
		Eq_2 a0_63;
		word32 a3_507;
		ipaddr_addr(a0_43, out a0_63, out a3_507);
		Eq_2 a0_83;
		word32 a3_508;
		ipaddr_addr(a0_63, out a0_83, out a3_508);
		Eq_2 a0_104;
		word32 a3_509;
		Eq_2 s0_112 = ipaddr_addr(a0_83, out a0_104, out a3_509);
		word32 a3_510;
		word32 a4_511;
		word32 a5_512;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_510, out a4_511, out a5_512);
		word32 a0_513;
		word32 a1_514;
		word32 a2_515;
		word32 a4_516;
		word32 a5_517;
		word32 s4_518;
		word32 s8_519;
		puts(0x2307ECEC, out a0_513, out a1_514, out a2_515, out a4_516, out a5_517, out s4_518, out s8_519);
		word32 a0_520;
		word32 a1_521;
		word32 a2_522;
		word32 a4_523;
		word32 a5_524;
		word32 s4_525;
		word32 s8_526;
		puts(fp + -52, out a0_520, out a1_521, out a2_522, out a4_523, out a5_524, out s4_525, out s8_526);
		word32 a0_527;
		word32 a1_528;
		word32 a2_529;
		word32 a4_530;
		word32 a5_531;
		word32 s4_532;
		word32 s8_533;
		puts((word32) s0_112 + 2044, out a0_527, out a1_528, out a2_529, out a4_530, out a5_531, out s4_532, out s8_533);
		word32 a3_534;
		word32 a4_535;
		word32 a5_536;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_534, out a4_535, out a5_536);
		word32 a0_537;
		word32 a1_538;
		word32 a2_539;
		word32 a4_540;
		word32 a5_541;
		word32 s4_542;
		word32 s8_543;
		puts(587721972, out a0_537, out a1_538, out a2_539, out a4_540, out a5_541, out s4_542, out s8_543);
		word32 a0_544;
		word32 a1_545;
		word32 a2_546;
		word32 a4_547;
		word32 a5_548;
		word32 s4_549;
		word32 s8_550;
		puts(fp + -52, out a0_544, out a1_545, out a2_546, out a4_547, out a5_548, out s4_549, out s8_550);
		word32 a0_551;
		word32 a1_552;
		word32 a2_553;
		word32 a4_554;
		word32 a5_555;
		word32 s4_556;
		word32 s8_557;
		puts((word32) s0_112 + 2044, out a0_551, out a1_552, out a2_553, out a4_554, out a5_555, out s4_556, out s8_557);
		word32 a3_558;
		word32 a4_559;
		word32 a5_560;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_558, out a4_559, out a5_560);
		word32 a0_561;
		word32 a1_562;
		word32 a2_563;
		word32 a4_564;
		word32 a5_565;
		word32 s4_566;
		word32 s8_567;
		puts(587721980, out a0_561, out a1_562, out a2_563, out a4_564, out a5_565, out s4_566, out s8_567);
		word32 a0_568;
		word32 a1_569;
		word32 a2_570;
		word32 a4_571;
		word32 a5_572;
		word32 s4_573;
		word32 s8_574;
		puts(fp + -52, out a0_568, out a1_569, out a2_570, out a4_571, out a5_572, out s4_573, out s8_574);
		word32 a0_575;
		word32 a1_576;
		word32 a2_577;
		word32 a4_578;
		word32 a5_579;
		word32 s4_580;
		word32 s8_581;
		puts((word32) s0_112 + 2044, out a0_575, out a1_576, out a2_577, out a4_578, out a5_579, out s4_580, out s8_581);
		word32 a3_582;
		word32 a4_583;
		word32 a5_584;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_582, out a4_583, out a5_584);
		word32 a0_585;
		word32 a1_586;
		word32 a2_587;
		word32 a4_588;
		word32 a5_589;
		word32 s4_590;
		word32 s8_591;
		puts(587721988, out a0_585, out a1_586, out a2_587, out a4_588, out a5_589, out s4_590, out s8_591);
		word32 a0_592;
		word32 a1_593;
		word32 a2_594;
		word32 a4_595;
		word32 a5_596;
		word32 s4_597;
		word32 s8_598;
		puts(fp + -52, out a0_592, out a1_593, out a2_594, out a4_595, out a5_596, out s4_597, out s8_598);
		word32 a0_599;
		word32 a1_600;
		word32 a2_601;
		word32 a4_602;
		word32 a5_603;
		word32 s4_604;
		word32 s8_605;
		puts((word32) s0_112 + 2044, out a0_599, out a1_600, out a2_601, out a4_602, out a5_603, out s4_604, out s8_605);
		word32 a3_606;
		word32 a4_607;
		word32 a5_608;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_606, out a4_607, out a5_608);
		word32 a0_609;
		word32 a1_610;
		word32 a2_611;
		word32 a4_612;
		word32 a5_613;
		word32 s4_614;
		word32 s8_615;
		puts(0x2307ED0C, out a0_609, out a1_610, out a2_611, out a4_612, out a5_613, out s4_614, out s8_615);
		word32 a0_616;
		word32 a1_617;
		word32 a2_618;
		word32 a4_619;
		word32 a5_620;
		word32 s4_621;
		word32 s8_622;
		puts(fp + -52, out a0_616, out a1_617, out a2_618, out a4_619, out a5_620, out s4_621, out s8_622);
		Eq_2 s4_375;
		word32 a0_623;
		word32 a1_624;
		word32 a2_625;
		word32 a4_626;
		word32 a5_627;
		word32 s8_628;
		wifi_mgmr_sta_ip_set(ra, puts((word32) s0_112 + 2044, out a0_623, out a1_624, out a2_625, out a4_626, out a5_627, out s4_375, out s8_628), a0_43, s4_375, a0_104, mstatus, dwLoc30, s4, dwLoc08, dwArg04, dwArg20, dwArg48, s3, dwArg78, dwArg98, dwArgB8, dwArgD8);
	}
}

// 23027F82: void wifi_scan_filter_cmd(Register word32 a2, Register Eq_2 a4, Register ptr32 mstatus)
void wifi_scan_filter_cmd(word32 a2, Eq_2 a4, ptr32 mstatus)
{
	if (a2 != 0x02)
		return;
	Eq_2 a3_6 = *(union Eq_2 *) 0x06;
	word32 a0_9 = (word32) ((word32) *(union Eq_2 *) 0x02 < -50);
	wifi_mgmr_scan_filter_hidden_ssid(a0_9, a3_6, a4, mstatus);
}

// 23027F9A: void wifi_capcode_cmd(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register up32 a2, Register Eq_2 a3, Stack ui32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void wifi_capcode_cmd(Eq_2 ra, Eq_2 a0, union Eq_2 * a1, up32 a2, Eq_2 a3, ui32 dwArg00, word32 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_81;
	if (a2 > ~0x01)
	{
		a3 = *a1;
		a0_81 = (struct Eq_274 *) &g_t2307E5BC;
	}
	else
	{
		dwArg74 = ra;
		if (a2 != 0x01)
		{
			Eq_2 a3_16;
			word32 a1_199;
			word32 a2_200;
			word32 a4_201;
			word32 a5_202;
			Eq_2 a0_13 = atoi(a0, out a1_199, out a2_200, out a3_16, out a4_201, out a5_202);
			int32 s2_44;
			int32 s3_45;
			word32 s1_203;
			word32 a0_204;
			word32 a1_205;
			word32 a2_206;
			word32 a3_207;
			word32 a4_208;
			word32 a5_209;
			word32 a7_210;
			word32 s4_211;
			word32 s5_212;
			word32 s6_213;
			word32 s7_214;
			word32 s8_215;
			word32 s9_216;
			word32 s10_217;
			word32 s11_218;
			word32 t4_219;
			Eq_2 ra_40 = printf(ra, &g_t2307E5EC, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_203, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out a7_210, out s2_44, out s3_45, out s4_211, out s5_212, out s6_213, out s7_214, out s8_215, out s9_216, out s10_217, out s11_218, out t4_219);
			if (a0_13 <= 0x00)
				return;
			word32 s1_220;
			word32 a3_221;
			hal_sys_capcode_update(ra_40, a0_13 & 0x00FF, a0_13 & 0x00FF, s2_44, s3_45, dwArg00, dwArg04, dwArg28, dwArg48, out s1_220, out a3_221);
			return;
		}
		hal_sys_capcode_get();
		a0_81 = (struct Eq_274 *) &g_t2307E5D0;
	}
	word32 a2_183;
	word32 a1_182;
	word32 a0_181;
	word32 s1_180;
	word32 a3_184;
	word32 a4_185;
	word32 a5_186;
	word32 a7_187;
	word32 s2_188;
	word32 s3_189;
	word32 s4_190;
	word32 s5_191;
	word32 s6_192;
	word32 s7_193;
	word32 s8_194;
	word32 s9_195;
	word32 s10_196;
	word32 s11_197;
	word32 t4_198;
	printf(ra, a0_81, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
}

// 23028004: void wifi_mgmr_cli_scanlist(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s10, Stack Eq_2 dwArg18, Stack (ptr32 Eq_123324) dwArgB8)
void wifi_mgmr_cli_scanlist(Eq_2 ra, Eq_2 a3, Eq_2 s10, Eq_2 dwArg18, struct Eq_123324 * dwArgB8)
{
	struct Eq_123324 * s0_155 = &g_b4201E448;
	Eq_2 a3_38;
	word32 s2_72;
	word32 s1_390;
	word32 t4_389;
	word32 s11_388;
	word32 s10_387;
	word32 s7_384;
	word32 s4_381;
	word32 a7_378;
	word32 a2_375;
	word32 s10_404;
	word32 s11_405;
	word32 t4_406;
	word32 s7_401;
	word32 s8_402;
	word32 s9_403;
	word32 s6_400;
	word32 s3_397;
	word32 s4_398;
	word32 s5_399;
	word32 a4_394;
	word32 a5_395;
	word32 a7_396;
	word32 a0_391;
	word32 a1_392;
	word32 a2_393;
	word32 s8_385;
	word32 s9_386;
	word32 s5_382;
	word32 s6_383;
	word32 s2_379;
	word32 s3_380;
	word32 a4_376;
	word32 a5_377;
	word32 a0_373;
	word32 a1_374;
	word32 s1_372;
	Eq_2 a3_106;
	Eq_2 ra_104 = printf(printf(ra, &g_t2307E694, a3, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_372, out a0_373, out a1_374, out a2_375, out a3_38, out a4_376, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388, out t4_389), &g_t2307E6A8, a3_38, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_390, out a0_391, out a1_392, out a2_393, out a3_106, out a4_394, out a5_395, out a7_396, out s2_72, out s3_397, out s4_398, out s5_399, out s6_400, out s7_401, out s8_402, out s9_403, out s10_404, out s11_405, out t4_406);
	word32 s4_101 = 0x2307E000;
	struct Eq_123415 * s2_122 = s2_72 + 0x4201E448;
	word32 s5_125 = 0x2307E000;
	do
	{
		word32 s3_123;
		word32 s1_119;
		if ((word32) s0_155->b02B0 != 0x00)
		{
			word32 a5_420;
			if (xTaskGetTickCount(out a5_420) - s0_155->t02B4 >= s2_122->t07D0)
				goto l2302810E;
			Eq_2 a4_134 = (word32) s0_155->b02A5;
			Eq_2 a3_133 = (word32) s0_155->b02A4;
			Eq_2 a0_149 = wifi_mgmr_auth_to_str((word32) s0_155->b02AE);
			wifi_mgmr_cipher_to_str((word32) s0_155->b02AF);
			dwArg18 = a4_134;
			s0_155 = dwArgB8;
			dwLoc78 = a0_149;
			word32 t4_433;
			word32 s11_432;
			word32 s10_431;
			word32 s9_430;
			word32 s8_429;
			word32 s7_428;
			word32 a5_425;
			word32 a7_426;
			word32 s6_427;
			word32 a1_422;
			word32 a2_423;
			word32 a4_424;
			word32 a0_421;
			ra_104 = printf(ra_104, s5_125 + 1808, a3_133, a0_149, s10, dwLoc10, dwLoc0C, a4_134, ra, out s1_119, out a0_421, out a1_422, out a2_423, out a3_106, out a4_424, out a5_425, out a7_426, out s2_122, out s3_123, out s4_101, out s5_125, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
		}
		else
		{
l2302810E:
			word32 t4_419;
			word32 s9_416;
			word32 s10_417;
			word32 s11_418;
			word32 s6_413;
			word32 s7_414;
			word32 s8_415;
			word32 a4_410;
			word32 a5_411;
			word32 a7_412;
			word32 a0_407;
			word32 a1_408;
			word32 a2_409;
			ra_104 = printf(ra_104, s4_101 + 0x0794, a3_106, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_119, out a0_407, out a1_408, out a2_409, out a3_106, out a4_410, out a5_411, out a7_412, out s2_122, out s3_123, out s4_101, out s5_125, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
		}
		++s0_155;
	} while (s1_119 + 0x01 != s3_123);
	word32 a2_437;
	word32 a1_436;
	word32 a0_435;
	word32 s1_434;
	word32 a3_438;
	word32 a4_439;
	word32 a5_440;
	word32 a7_441;
	word32 s2_442;
	word32 s3_443;
	word32 s4_444;
	word32 s5_445;
	word32 s6_446;
	word32 s7_447;
	word32 s8_448;
	word32 s9_449;
	word32 s10_450;
	word32 s11_451;
	word32 t4_452;
	printf(ra_104, &g_t2307E7AC, a3_106, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_434, out a0_435, out a1_436, out a2_437, out a3_438, out a4_439, out a5_440, out a7_441, out s2_442, out s3_443, out s4_444, out s5_445, out s6_446, out s7_447, out s8_448, out s9_449, out s10_450, out s11_451, out t4_452);
}

// 2302811A: Register word32 wifi_mgmr_ext_dump_needed(Register (ptr32 Eq_109221) a4)
// Called from:
//      tcpip_stack_input
word32 wifi_mgmr_ext_dump_needed(struct Eq_109221 * a4)
{
	word32 a5_6 = a4->dw0000;
	word32 a0_10 = 0x00;
	if (a4 > null)
	{
		a4->dwFFFFFFFF = a5_6;
		a0_10 = 0x01;
	}
	return a0_10;
}

// 23028132: void wifi_mgmr_cli_init()
// Called from:
//      aos_loop_proc
void wifi_mgmr_cli_init()
{
}

