pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23028136: Register (ptr32 byte) mac_is_unvalid(Register (ptr32 byte) a0)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
byte * mac_is_unvalid(byte * a0)
{
	word32 a5_5 = (word32) *a0;
	int32 a4_15;
	for (a4_15 = 0x01; a4_15 != 0x06; ++a4_15)
	{
		if ((word32) a0[a4_15] != a5_5)
			return null;
	}
	return (word32) ((a5_5 + -1 & 0x00FF) < 0x00FE) ^ 1;
}

// 23028166: void wifi_mgmr_psk_cal(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2)
// Called from:
//      event_cb_wifi_event
void wifi_mgmr_psk_cal(Eq_2 ra, Eq_2 a0, Eq_2 a2)
{
	word32 a0_15;
	struct Eq_123623 * s1_25 = bl60x_fw_password_hash(ra, a0, a2, fp + -48, out a0_15);
	if (a0_15 == 0x00)
		utils_bin2hex(s1_25, fp + -48, 32);
}

// 23028192: Register Eq_2 wifi_mgmr_drv_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_start_background
Eq_2 wifi_mgmr_drv_init(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_20;
	Eq_2 s0_22;
	ptr32 mstatus_51;
	Eq_2 s4_84;
	ptr32 mstatus_98;
	ptr32 s1_100;
	ptr32 s3_104;
	Eq_2 ra_99 = wifi_mgmr_api_ifaceup(wifi_mgmr_init(wifi_mgmr_api_set_country_code(bl606a0_wifi_init(ra, a0, a3, mstatus, dwLoc10, s0, dwLoc08, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg2C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_22, out mstatus_20), s0_22, mstatus_20, dwLoc10, s0, dwArg08, dwArg18, dwArg20, dwArg24, dwArg2C, dwArg3C, dwArg48, dwArg6C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out mstatus_51), mstatus_51, dwArg0108, out s4_84), s4_84, mstatus_51, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_100, out s3_104, out mstatus_98);
	s1Out = s1_100;
	s3Out = s3_104;
	mstatusOut = mstatus_98;
	return ra_99;
}

// 230281B6: Register Eq_2 wifi_mgmr_sta_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0168, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      event_cb_wifi_event
//      wifi_connect_cmd
Eq_2 wifi_mgmr_sta_enable(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0168, ptr32 & a1Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	ptr32 a1_175;
	Eq_2 ra_180;
	ptr32 s2_182;
	Eq_2 a5_14 = *a3;
	if (a3 == 0x01)
	{
		word32 s1_367;
		word32 a0_368;
		word32 a2_369;
		word32 a3_370;
		word32 a4_371;
		word32 a5_372;
		word32 a7_373;
		word32 s3_374;
		word32 s4_375;
		word32 s5_376;
		word32 s6_377;
		word32 s7_378;
		word32 s8_379;
		word32 s9_380;
		word32 s10_381;
		word32 s11_382;
		word32 t4_383;
		ra_180 = printf(ra, &g_t2307EDAC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_367, out a0_368, out a1_175, out a2_369, out a3_370, out a4_371, out a5_372, out a7_373, out s2_182, out s3_374, out s4_375, out s5_376, out s6_377, out s7_378, out s8_379, out s9_380, out s10_381, out s11_382, out t4_383);
	}
	else
	{
		*(union Eq_2 *) 0x01 = a5_14;
		word32 s6_353;
		word32 s7_354;
		word32 s4_351;
		word32 s5_352;
		word32 s2_349;
		word32 s3_350;
		word32 a5_347;
		word32 a7_348;
		word32 a3_345;
		word32 a4_346;
		word32 a1_343;
		word32 a2_344;
		word32 a0_342;
		word32 s1_341;
		word32 s8_355;
		word32 s9_356;
		word32 s10_357;
		word32 s11_358;
		word32 t4_359;
		Eq_2 ra_28 = printf(ra, &g_t2307EDD8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_341, out a0_342, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a7_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
		g_dw4201E454 = 0x00;
		word32 a1_360;
		word32 a2_361;
		word32 a3_362;
		word32 a4_363;
		word32 a5_364;
		word32 a6_365;
		word32 a7_366;
		memcpy(0x4201E4AE, 1107420249, 0x06, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a6_365, out a7_366);
		if (mac_is_unvalid(&g_w4201E4AE) != 0x00)
		{
			bl_wifi_mac_addr_get(0x4201E4AE);
			if (mac_is_unvalid(&g_w4201E4AE) != 0x00)
			{
				g_w4201E4AE = 0xC0;
				*(word32 *) 16828843 = 0x4201E448;
			}
			word32 a1_384;
			word32 a2_385;
			word32 a3_386;
			word32 a4_387;
			word32 a5_388;
			word32 a6_389;
			word32 a7_390;
			memcpy(1107420249, 0x4201E4AE, 0x06, out a1_384, out a2_385, out a3_386, out a4_387, out a5_388, out a6_389, out a7_390);
		}
		word32 s1_148;
		Eq_2 s0_147 = netifapi_netif_add(ra_28, 0x4201E448, fp + ~0x1B, fp + ~0x17, fp + ~0x13, 0x00, 0x23029266, 0x4201E000, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out s1_148);
		*((word32) s0_147 + 110) = 1139;
		((word32) s0_147 + 0x006D)->u1 = (byte) ((word32) *((word32) s0_147 + 0x006D) | 36);
		netif_set_default(s1_148 + 0x0474);
		ra_180 = netif_set_up(ra_28, s0_147, s1_148 + 0x0474, mstatus, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out a1_175, out s2_182, out mstatus);
	}
	a1Out = a1_175;
	s2Out = s2_182;
	mstatusOut = mstatus;
	return ra_180;
}

