pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230282B4: void wifi_mgmr_sta_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_disconnect_cmd
void wifi_mgmr_sta_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_idle(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 230282C4: void wifi_mgmr_sta_ip_get(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2, Register (ptr32 Eq_121557) a4)
// Called from:
//      wifi_sta_ip_info
void wifi_mgmr_sta_ip_get(ptr32 a0, ptr32 a1, ptr32 a2, struct Eq_121557 * a4)
{
	a4->ptr0000 = a0;
	struct Eq_123952 * a5_9 = a4->ptr0034;
	a4->ptr0000 = a2;
	*a5_9->ptr0038 = a1;
}

// 230282DC: void wifi_mgmr_sta_dns_get(Register ptr32 a0, Register ptr32 a1)
// Called from:
//      wifi_sta_ip_info
void wifi_mgmr_sta_dns_get(ptr32 a0, ptr32 a1)
{
	*dns_getserver(0x00) = a0;
	*dns_getserver(0x01) = a1;
}

// 23028306: void wifi_mgmr_sta_ip_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_121535) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_sta_ip_set_cmd
//      wifi_mgmr_sta_ip_unset
void wifi_mgmr_sta_ip_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_121535 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	word32 a5_86;
	Eq_2 a4_18 = vTaskEnterCritical(a4, mstatus, out a5_86);
	*((word32) a0 + 24) = 0x4201E448;
	*((word32) a1 + 28) = 0x4201E448;
	dwArg94->dw0020 = 0x4201E448;
	((word32) a3 + 36)->u0 = 0x4201E448;
	((word32) a4_18 + 40)->u0 = 0x4201E448;
	word32 a4_87;
	word32 a5_88;
	vTaskExitCritical(a3, mstatus, out a4_87, out a5_88);
	word32 a1_89;
	word32 a3_90;
	word32 mstatus_91;
	wifi_mgmr_api_ip_update(ra, a4, mstatus, dwLoc18, dwArg10, dwArg14, dwArg38, dwArg44, a0, dwArg60, ra, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out a1_89, out a3_90, out mstatus_91);
}

// 23028344: void wifi_mgmr_sta_ip_unset(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_121535) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_sta_ip_unset_cmd
void wifi_mgmr_sta_ip_unset(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_121535 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	wifi_mgmr_sta_ip_set(ra, 0x00, 0x00, 0x00, 0x00, mstatus, dwArg10, dwArg14, dwArg38, dwArg44, dwArg60, dwArg88, dwArg94, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 23028352: Register Eq_2 wifi_mgmr_sta_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_disconnect_cmd
Eq_2 wifi_mgmr_sta_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_api_disconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a3_11, out a4_12, out a5_13, out mstatus_16);
	a2Out = dwArg10;
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23028362: void wifi_mgmr_sta_powersaving(Register Eq_2 ra, Register word32 a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_power_saving_off_cmd
//      wifi_power_saving_on_cmd
void wifi_mgmr_sta_powersaving(Eq_2 ra, word32 a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a0 != 0x01 && a0 != 0x02)
	{
		if (a0 == 0x00)
			wifi_mgmr_api_fw_powersaving(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	}
	else
		wifi_mgmr_api_fw_powersaving(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23028392: void wifi_mgmr_sta_autoconnect_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_enable_autoreconnect_cmd
void wifi_mgmr_sta_autoconnect_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_enable_autoreconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 230283A2: void wifi_mgmr_sta_autoconnect_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_disable_autoreconnect_cmd
void wifi_mgmr_sta_autoconnect_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_disable_autoreconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

