pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230283B2: void wifi_mgmr_sta_ssid_set(Register Eq_2 a0)
// Called from:
//      wifi_mgmr_sta_connect
void wifi_mgmr_sta_ssid_set(Eq_2 a0)
{
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 a5_77;
	if (strlen(a0, out a1_73, out a2_74, out a3_75, out a4_76, out a5_77) == 0x00)
		return;
	word32 a1_78;
	word32 a2_79;
	word32 a3_80;
	word32 a4_81;
	word32 a5_82;
	Eq_2 a0_20 = strlen(a0, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82);
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 a7_89;
	memcpy(0x4201FB9B, a0, a0_20, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out a7_89);
}

// 230283E4: Register word32 wifi_mgmr_sta_psk_set(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      wifi_mgmr_sta_connect
word32 wifi_mgmr_sta_psk_set(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	word32 a1_75;
	word32 a2_76;
	if (strlen(a0, out a1_75, out a2_76, out a3_11, out a4_12, out a5_13) == 0x00)
	{
		a4Out = a4_12;
		a5Out = a5_13;
		return a3_11;
	}
	else
	{
		word32 a1_77;
		word32 a2_78;
		word32 a3_79;
		word32 a4_80;
		word32 a5_81;
		Eq_2 a0_20 = strlen(a0, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81);
		ptr32 a4_33;
		ptr32 a5_34;
		word32 a3_38;
		word32 a1_82;
		word32 a2_83;
		word32 a6_84;
		word32 a7_85;
		memcpy(0x4201FBBB, a0, a0_20, out a1_82, out a2_83, out a3_38, out a4_33, out a5_34, out a6_84, out a7_85);
		a4Out = a4_33;
		a5Out = a5_34;
		return a3_38;
	}
}

// 23028416: void wifi_mgmr_sta_connect(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArgC4)
// Called from:
//      event_cb_wifi_event
//      wifi_connect_cmd
void wifi_mgmr_sta_connect(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArgC4)
{
	wifi_mgmr_sta_ssid_set(a1);
	Eq_2 a4_42;
	word32 a5_43;
	Eq_2 a3_41 = wifi_mgmr_sta_psk_set(a2, out a4_42, out a5_43);
	0x00 = (uint16) dwArgC4;
	wifi_mgmr_api_connect(ra, dwArg84, a1, a2, a3, a3_41, a4_42, a5_43, s2, mstatus, dwArg18, dwArg38, dwArg58, dwArg78);
}

// 2302844E: Register Eq_2 wifi_mgmr_ap_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_wifi_ap_start
Eq_2 wifi_mgmr_ap_enable(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0168, union Eq_2 & s0Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	*(word32 *) 0x7D = 0x4201E448;
	word32 a6_250;
	word32 a7_251;
	word32 a4_248;
	word32 a5_249;
	word32 a2_246;
	word32 a3_247;
	word32 a1_245;
	memcpy(0x4201E51E, 0x4201E4C9, 0x06, out a1_245, out a2_246, out a3_247, out a4_248, out a5_249, out a6_250, out a7_251);
	if (mac_is_unvalid(&g_w4201E51E) != 0x00)
	{
		bl_wifi_mac_addr_get(0x4201E51E);
		if (mac_is_unvalid(&g_w4201E51E) != 0x00)
		{
			g_w4201E51E = 0xC0;
			g_dw4201E520 = 0x0100C943;
		}
		word32 a6_258;
		word32 a7_259;
		word32 a4_256;
		word32 a5_257;
		word32 a2_254;
		word32 a3_255;
		word32 a1_253;
		memcpy(0x4201E4C9, 0x4201E51E, 0x06, out a1_253, out a2_254, out a3_255, out a4_256, out a5_257, out a6_258, out a7_259);
	}
	struct Eq_124191 * s1_122;
	Eq_2 s0_121 = netifapi_netif_add(ra, 0x4201E000, fp + ~0x1B, fp + ~0x17, fp + ~0x13, 0x00, 0x23029266, 0x4201E000, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out s1_122);
	s1_122->w00DE = 0x61;
	netif_set_default((word32) s0_121 + 0x04E4);
	ptr32 mstatus_150;
	ptr32 s2_153;
	word32 a1_252;
	Eq_2 ra_151 = netif_set_up(ra, s0_121, (word32) s0_121 + 0x04E4, mstatus, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out a1_252, out s2_153, out mstatus_150);
	s0Out = s0_121;
	s2Out = s2_153;
	mstatusOut = mstatus_150;
	return ra_151;
}

// 23028524: void wifi_mgmr_ap_start(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
// Called from:
//      cmd_wifi_ap_start
void wifi_mgmr_ap_start(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	wifi_mgmr_api_ap_start(ra, a1, a3, a4, mstatus, dwLoc04, dwArg00, dwArg04, dwArg28, dwArg58, dwArg78, dwArg98, dwArgB8);
}

// 2302853E: Register Eq_2 wifi_mgmr_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 a3Out)
// Called from:
//      cmd_wifi_ap_stop
Eq_2 wifi_mgmr_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & a3Out)
{
	ptr32 a3_11;
	Eq_2 ra_17 = wifi_mgmr_api_ap_stop(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a3_11);
	a3Out = a3_11;
	return ra_17;
}

// 2302854E: void wifi_mgmr_ap_sta_cnt_get(Register (ptr32 byte) a0)
// Called from:
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
void wifi_mgmr_ap_sta_cnt_get(byte * a0)
{
	wifi_mgmr_ap_sta_cnt_get_internal(a0);
}

