pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302855E: Register Eq_2 wifi_mgmr_ap_sta_info_get(Register Eq_2 ra, Register Eq_2 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s4Out)
// Called from:
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
Eq_2 wifi_mgmr_ap_sta_info_get(Eq_2 ra, Eq_2 a1, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s4Out)
{
	struct Eq_124273 * s0_37;
	ptr32 s1_38;
	word32 t1_92;
	word32 a0_93;
	word32 a1_94;
	word32 a2_95;
	word32 a3_96;
	word32 a4_97;
	word32 a5_98;
	Eq_2 ra_36 = wifi_mgmr_ap_sta_info_get_internal(memset(ra, fp + -40, 0x00, 0x18, out t1_92, out a0_93, out a1_94, out a2_95, out a3_96, out a4_97, out a5_98), fp + -40, a1, out s0_37, out s1_38);
	struct Eq_124304 * a5_48 = (word32) wLoc28;
	s0_37->w0000 = (word16) a5_48;
	a5_48->ptr0010 = s0_37;
	a5_48->ptr000C = s0_37;
	a5_48->ptr0008 = s0_37;
	s0_37->b0014 = (byte) (word32) bLoc14;
	ptr32 a3_66;
	word32 a1_99;
	word32 a2_100;
	word32 a4_101;
	word32 a5_102;
	word32 a6_103;
	word32 a7_104;
	memcpy(&s0_37->w0000 + 1, fp + -38, 0x06, out a1_99, out a2_100, out a3_66, out a4_101, out a5_102, out a6_103, out a7_104);
	s0Out = dwArgE4;
	s1Out = s1_38;
	a3Out = a3_66;
	s4Out = dwArgB4;
	return ra_36;
}

// 230285B2: void wifi_mgmr_ap_sta_delete(Register Eq_2 ra, Register (ptr32 Eq_101482) s0, Register Eq_2 s1, Register (ptr32 Eq_101482) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
// Called from:
//      wifi_ap_sta_delete_cmd
void wifi_mgmr_ap_sta_delete(Eq_2 ra, struct Eq_101482 * s0, Eq_2 s1, struct Eq_101482 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg5C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	wifi_mgmr_ap_sta_delete_internal(ra, s0, s1, a0, s4, mstatus, dwArg10, dwArg14, dwArg2C, dwArg5C, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108);
}

// 230285C2: void wifi_mgmr_sniffer_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_sniffer_on_cmd
//      wifi_mon_cmd
void wifi_mgmr_sniffer_register(word32 a0, word32 a1)
{
	bl_rx_pkt_cb_register(a0, a1);
}

// 230285D2: void wifi_mgmr_sniffer_unregister()
// Called from:
//      wifi_sniffer_off_cmd
void wifi_mgmr_sniffer_unregister()
{
	bl_rx_pkt_cb_unregister();
}

// 230285E2: void wifi_mgmr_sniffer_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_sniffer_on_cmd
//      wifi_mon_cmd
void wifi_mgmr_sniffer_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_sniffer_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 230285F2: void wifi_mgmr_sniffer_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_sniffer_off_cmd
void wifi_mgmr_sniffer_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_idle(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23028602: void wifi_mgmr_rate_config(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_rc_fixed_disable
//      wifi_rc_fixed_enable
void wifi_mgmr_rate_config(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_rate_config(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 23028606: void wifi_mgmr_conf_max_sta(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      cmd_wifi_ap_conf_max_sta
void wifi_mgmr_conf_max_sta(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_conf_max_sta(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 2302860A: Register word32 wifi_mgmr_state_get(Register (ptr32 word32) a0, Register out ptr32 a5Out)
// Called from:
//      cmd_wifi_state_get
//      wifi_sta_get_state_cmd
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
word32 wifi_mgmr_state_get(word32 * a0, ptr32 & a5Out)
{
	ptr32 a5_8;
	word32 a3_6 = wifi_mgmr_state_get_internal(a0, out a5_8);
	a5Out = a5_8;
	return a3_6;
}

// 2302860E: void wifi_mgmr_rssi_get(Register ptr32 a0)
// Called from:
//      wifi_sta_ip_info
void wifi_mgmr_rssi_get(ptr32 a0)
{
	null[(int32) g_b4201E4C0 / 4] = a0;
}

// 2302861C: Register word32 wifi_mgmr_raw_80211_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_118815 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      cmd_wifi_raw_send
word32 wifi_mgmr_raw_80211_send(Eq_2 ra, Eq_2 s1, Eq_118815 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a1 > 480)
		return ~0x00;
	wifi_mgmr_api_raw_send(ra, s1, a1, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	return 0x00;
}

// 23028638: void wifi_mgmr_scan(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_scan_cmd
void wifi_mgmr_scan(Eq_2 ra, word32 a0, word32 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	g_dw4200EDDC = a1;
	g_dw4200EDE0 = a0;
	wifi_mgmr_api_fw_scan(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23028658: void wifi_mgmr_cfg_req(Register Eq_2 ra, Register Eq_2 s1, Register uint32 a0, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
// Called from:
//      cmd_wifi_cfg
void wifi_mgmr_cfg_req(Eq_2 ra, Eq_2 s1, uint32 a0, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	wifi_mgmr_api_cfg_req(ra, s1, a0, a4, a5, s3, mstatus, dwArg18, dwArg24, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgF8);
}

// 2302865C: void wifi_mgmr_scan_filter_hidden_ssid(Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      wifi_scan_filter_cmd
void wifi_mgmr_scan_filter_hidden_ssid(word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	int32 a5_16;
	word32 a5_37;
	vTaskEnterCritical(a4, mstatus, out a5_37);
	int32 a5_15 = g_dw4201FC14;
	if (a0 != 0x00)
		a5_16 = a5_15 & ~0x01;
	else
		a5_16 = a5_15 | 1;
	g_dw4201FC14 = a5_16;
	word32 a4_38;
	word32 a5_39;
	vTaskExitCritical(a3, mstatus, out a4_38, out a5_39);
}

// 2302868E: Register Eq_2 wifi_mgmr_scan_complete_callback(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 a4Out)
// Called from:
//      wifi_mgmr_scan_complete_notify
Eq_2 wifi_mgmr_scan_complete_callback(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & a4Out)
{
	word32 a3_17;
	word32 s1_101;
	word32 a0_102;
	word32 a1_103;
	word32 a2_104;
	word32 a5_105;
	word32 a7_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	word32 s5_110;
	word32 s6_111;
	word32 s7_112;
	word32 s8_113;
	word32 s9_114;
	word32 s10_115;
	word32 s11_116;
	word32 t4_117;
	ptr32 a4_18;
	Eq_2 ra_20 = printf(ra, &g_t2307ED98, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_101, out a0_102, out a1_103, out a2_104, out a3_17, out a4_18, out a5_105, out a7_106, out s2_107, out s3_108, out s4_109, out s5_110, out s6_111, out s7_112, out s8_113, out s9_114, out s10_115, out s11_116, out t4_117);
	<anonymous> * a5_35 = g_ptr4200DDDC;
	if (a5_35 != null)
		a5_35();
	a4Out = a4_18;
	return ra_20;
}

// 230286CA: void wifi_mgmr_status_code_str(Register up32 a0)
void wifi_mgmr_status_code_str(up32 a0)
{
	if (a0 > 0x10)
		;
}

// 230286EC: Register Eq_2 wifi_mgmr_profile_add(Register Eq_2 ra, Register (ptr32 Eq_112417) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 a3Out)
// Called from:
//      stateIdleAction_connect
Eq_2 wifi_mgmr_profile_add(Eq_2 ra, struct Eq_112417 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & a3Out)
{
	Eq_2 s0_15;
	Eq_2 s1_12 = a1;
	if (a2 != ~0x00)
	{
		word32 a1_17;
		if ((word32) a0->b01B1 != 0x00)
		{
			if ((word32) a0->b0275 != 0x00)
				goto l23028714;
			a1_17 = 0x01;
		}
		else
			a1_17 = 0x00;
		a0->dw0278 = a1_17;
		s0_15 = a0 + (a1_17 + 436) / 636;
		word32 a0_263;
		word32 a1_264;
		word32 a2_265;
		word32 a3_266;
		word32 a4_267;
		word32 a5_268;
		word32 a7_269;
		word32 s2_270;
		word32 s3_271;
		word32 s4_272;
		word32 s5_273;
		word32 s6_274;
		word32 s7_275;
		word32 s8_276;
		word32 s9_277;
		word32 s10_278;
		word32 s11_279;
		word32 t4_280;
		ra = printf(ra, &g_t2307EE04, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_12, out a0_263, out a1_264, out a2_265, out a3_266, out a4_267, out a5_268, out a7_269, out s2_270, out s3_271, out s4_272, out s5_273, out s6_274, out s7_275, out s8_276, out s9_277, out s10_278, out s11_279, out t4_280);
	}
	else
	{
		s0_15 = (char *) a0 + 0x00F0;
		if (a0 == (struct Eq_112417 *) 0xF0)
			goto l23028714;
	}
	word32 t1_281;
	word32 a0_282;
	word32 a1_283;
	word32 a2_284;
	word32 a3_285;
	word32 a4_286;
	word32 a5_287;
	ra = memset(ra, s0_15, 0x00, 0x00C4, out t1_281, out a0_282, out a1_283, out a2_284, out a3_285, out a4_286, out a5_287);
	((word32) s0_15 + 0x00C0)->u0 = 0x0100;
	((word32) *((word32) s1_12 + 36) << 24 | (((word32) (*((word32) s1_12 + 0x0022)) << 8 | (word32) (*((word32) s1_12 + 33))) | (word32) (*((word32) s1_12 + 35)) << 16))->t0024 = s0_15;
	((word32) *((word32) s1_12 + 0x00AA) << 24 | (((word32) (*((word32) s1_12 + 0x00A8)) << 8 | (word32) (*((word32) s1_12 + 0x00A7))) | (word32) (*((word32) s1_12 + 0x00A9)) << 16))->t006C = s0_15;
	*((word32) s0_15 + 0x00B4) = (word32) *((word32) s1_12 + 0x00AE) << 24 | (((word32) (*((word32) s1_12 + 0x00AC)) << 8 | (word32) (*((word32) s1_12 + 171))) | (word32) (*((word32) s1_12 + 0x00AD)) << 16);
	((word32) s0_15 + 191)->u1 = ~0x00;
	word32 a1_288;
	word32 a2_289;
	word32 a3_290;
	word32 a4_291;
	word32 a5_292;
	word32 a6_293;
	word32 a7_294;
	memcpy(s0_15, s1_12, 33, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a6_293, out a7_294);
	word32 a1_295;
	word32 a2_296;
	word32 a3_297;
	word32 a4_298;
	word32 a5_299;
	word32 a6_300;
	word32 a7_301;
	memcpy((word32) s0_15 + 40, (word32) s1_12 + 37, 65, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out a7_301);
	word32 a1_302;
	word32 a2_303;
	word32 a3_304;
	word32 a4_305;
	word32 a5_306;
	word32 a6_307;
	word32 a7_308;
	memcpy((word32) s0_15 + 112, (word32) s1_12 + 0x0066, 65, out a1_302, out a2_303, out a3_304, out a4_305, out a5_306, out a6_307, out a7_308);
	word32 a1_309;
	word32 a2_310;
	word32 a4_311;
	word32 a5_312;
	word32 a6_313;
	word32 a7_314;
	memcpy((word32) s0_15 + 0x00B8, (word32) s1_12 + 0x00AF, 0x06, out a1_309, out a2_310, out a3, out a4_311, out a5_312, out a6_313, out a7_314);
	((word32) s0_15 + 0x00BE)->u1 = (byte) (word32) *((word32) s1_12 + 0x00B8);
l23028714:
	a3Out = a3;
	return ra;
}

// 230287FC: Register Eq_2 wifi_mgmr_profile_get(Register Eq_2 ra, Register (ptr32 Eq_113768) a0, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      disconnect_retry
Eq_2 wifi_mgmr_profile_get(Eq_2 ra, struct Eq_113768 * a0, Eq_2 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & a0Out, union Eq_2 & a3Out)
{
	ptr32 a0_163;
	if ((word32) a0->b01B1 != 0x01)
	{
		a0_163 = ~0x00;
		if ((word32) a0->b0275 != 0x01)
			goto l2302881E;
	}
	word32 s1_41;
	word32 s2_44;
	word32 a0_241;
	word32 a1_242;
	word32 a2_243;
	word32 a3_244;
	word32 a4_245;
	word32 a5_246;
	word32 a7_247;
	word32 s3_248;
	word32 s4_249;
	word32 s5_250;
	word32 s6_251;
	word32 s7_252;
	word32 s8_253;
	word32 s9_254;
	word32 s10_255;
	word32 s11_256;
	word32 t4_257;
	word32 t1_258;
	word32 a0_259;
	word32 a1_260;
	word32 a2_261;
	word32 a3_262;
	word32 a4_263;
	word32 a5_264;
	ra = memset(printf(ra, &g_t2307EE30, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_41, out a0_241, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a7_247, out s2_44, out s3_248, out s4_249, out s5_250, out s6_251, out s7_252, out s8_253, out s9_254, out s10_255, out s11_256, out t4_257), a1, 0x00, 0x00B9, out t1_258, out a0_259, out a1_260, out a2_261, out a3_262, out a4_263, out a5_264);
	struct Eq_124814 * a4_70 = s2_44 + (s1_41 + 0x00C4);
	Eq_124818 a5_71 = a4_70->t0114;
	((word32) a1 + 33)->u1 = (byte) a5_71;
	*((word32) a1 + 0x0022) = (byte) (a5_71 >> 0x08);
	((word32) a1 + 35)->u1 = (byte) (a5_71 >> 0x10);
	*((word32) a1 + 36) = (byte) (a5_71 >> 24);
	Eq_124844 a5_81 = a4_70->t015C;
	((word32) a1 + 0x00A7)->u1 = (byte) a5_81;
	*((word32) a1 + 0x00A8) = (byte) (a5_81 >> 0x08);
	((word32) a1 + 0x00A9)->u1 = (byte) (a5_81 >> 0x10);
	*((word32) a1 + 0x00AA) = (byte) (a5_81 >> 24);
	Eq_124870 a5_89 = a4_70->t01A4;
	((word32) a1 + 171)->u1 = (byte) a5_89;
	*((word32) a1 + 0x00AC) = (byte) (a5_89 >> 0x08);
	((word32) a1 + 0x00AD)->u1 = (byte) (a5_89 >> 0x10);
	((word32) a1 + 0x00AE)->u1 = (byte) (a5_89 >> 24);
	((word32) a1 + 0x00B8)->u1 = (byte) (word32) a4_70->b01AE;
	word32 a1_265;
	word32 a2_266;
	word32 a3_267;
	word32 a4_268;
	word32 a5_269;
	word32 a6_270;
	word32 a7_271;
	memcpy(a1, s1_41 + 436 + s2_44, 33, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a6_270, out a7_271);
	word32 a1_272;
	word32 a2_273;
	word32 a3_274;
	word32 a4_275;
	word32 a5_276;
	word32 a6_277;
	word32 a7_278;
	memcpy((word32) a1 + 37, s1_41 + 476 + s2_44, 65, out a1_272, out a2_273, out a3_274, out a4_275, out a5_276, out a6_277, out a7_278);
	word32 a1_279;
	word32 a2_280;
	word32 a3_281;
	word32 a4_282;
	word32 a5_283;
	word32 a6_284;
	word32 a7_285;
	memcpy((word32) a1 + 0x0066, s1_41 + 0x0224 + s2_44, 65, out a1_279, out a2_280, out a3_281, out a4_282, out a5_283, out a6_284, out a7_285);
	word32 a1_286;
	word32 a2_287;
	word32 a4_288;
	word32 a5_289;
	word32 a6_290;
	word32 a7_291;
	memcpy((word32) a1 + 0x00AF, s1_41 + 620 + s2_44, 0x06, out a1_286, out a2_287, out a3, out a4_288, out a5_289, out a6_290, out a7_291);
	a0_163 = 0x00;
l2302881E:
	0x00 = (uint16) dwArg38;
	a0Out = a0_163;
	a3Out = a3;
	return ra;
}

// 230288FE: Register (ptr32 Eq_115041) wifi_mgmr_profile_autoreconnect_is_enabled(Register (ptr32 Eq_115041) a0)
// Called from:
//      stateDisconnect_enter
struct Eq_115041 * wifi_mgmr_profile_autoreconnect_is_enabled(struct Eq_115041 * a0)
{
	return (word32) ((word32) a0->b10007C1 < 1);
}

// 2302890C: void wifi_mgmr_profile_autoreconnect_disable(Register (ptr32 Eq_114872) a0)
// Called from:
//      stateGlobalGuard_disable_autoreconnect
void wifi_mgmr_profile_autoreconnect_disable(struct Eq_114872 * a0)
{
	a0->b10007C1 = 0x01;
}

// 2302891A: void wifi_mgmr_profile_autoreconnect_enable(Register (ptr32 Eq_114785) a0)
// Called from:
//      stateGlobalGuard_enable_autoreconnect
void wifi_mgmr_profile_autoreconnect_enable(struct Eq_114785 * a0)
{
	a0->b10007C1 = 0x00;
}

// 23028926: Register Eq_2 wifi_netif_dhcp_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      stateConnectedIPNoEnter
Eq_2 wifi_netif_dhcp_start(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 a4_19;
	word32 a3_51;
	word32 a5_52;
	word32 s2_53;
	netifapi_netif_common(ra, s0, a3, a4, a5, s2, mstatus, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a3_51, out a4_19, out a5_52, out s2_53);
	return a4_19;
}

