pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23028940: void cb_rssi_ind(Register word32 a1)
void cb_rssi_ind(word32 a1)
{
	g_b4201E4C0 = (byte) a1;
}

// 2302894A: void cb_probe_resp_ind(Register Eq_2 ra, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cb_probe_resp_ind(Eq_2 ra, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_39;
	word32 a0_40;
	word32 a1_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	word32 a7_46;
	word32 s2_47;
	word32 s3_48;
	word32 s4_49;
	word32 s5_50;
	word32 s6_51;
	word32 s7_52;
	word32 s8_53;
	word32 s9_54;
	word32 s10_55;
	word32 s11_56;
	word32 t4_57;
	printf(ra, &g_t2307EEE8, a2, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_39, out a0_40, out a1_41, out a2_42, out a3_43, out a4_44, out a5_45, out a7_46, out s2_47, out s3_48, out s4_49, out s5_50, out s6_51, out s7_52, out s8_53, out s9_54, out s10_55, out s11_56, out t4_57);
}

// 2302895A: void cb_beacon_ind(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
void cb_beacon_ind(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	wifi_mgmr_api_scan_item_beacon(ra, s2, s3, s4, mstatus, dwLoc18, dwLoc0C, dwArg0C, dwArg10, dwArg24, dwArg38, dwArg68, dwArg88, dwArgA8, dwArgC8);
}

// 2302898A: void cb_disconnect_ind(Register Eq_2 ra, Register (ptr32 uint16) a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cb_disconnect_ind(Eq_2 ra, uint16 * a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a3_29;
	Eq_2 s4_38;
	word32 t1_147;
	word32 a0_148;
	word32 a1_149;
	word32 a2_150;
	word32 a4_151;
	word32 a5_152;
	word32 s1_153;
	word32 a0_154;
	word32 a1_155;
	word32 a2_156;
	word32 a4_157;
	word32 a5_158;
	word32 a7_159;
	word32 s2_160;
	word32 s3_161;
	word32 s5_162;
	word32 s6_163;
	word32 s7_164;
	word32 s8_165;
	word32 s9_166;
	word32 s10_167;
	word32 s11_168;
	word32 t4_169;
	Eq_2 ra_32 = printf(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_147, out a0_148, out a1_149, out a2_150, out a3_16, out a4_151, out a5_152), &g_t2307EE58, a3_16, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_153, out a0_154, out a1_155, out a2_156, out a3_29, out a4_157, out a5_158, out a7_159, out s2_160, out s3_161, out s4_38, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168, out t4_169);
	g_b4201FB9A = 0x02;
	Eq_2 a4_70 = (word32) *a1;
	g_w4201FB98 = (word16) a4_70;
	word32 s1_170;
	word32 a1_171;
	word32 a3_172;
	word32 a4_173;
	word32 a5_174;
	word32 s3_175;
	word32 mstatus_176;
	wifi_mgmr_event_notify(ra_32, fp + ~0x1F, a3_29, a4_70, s4_38, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_170, out a1_171, out a3_172, out a4_173, out a5_174, out s3_175, out mstatus_176);
}

// 23028A22: void cb_connect_ind(Register Eq_2 ra, Register (ptr32 Eq_116990) a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cb_connect_ind(Eq_2 ra, struct Eq_116990 * a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a4_51;
	word32 t1_121;
	word32 a0_122;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	word32 a4_126;
	word32 a5_127;
	word32 s1_128;
	word32 a1_129;
	word32 a3_130;
	word32 a4_131;
	word32 a5_132;
	word32 s3_133;
	word32 mstatus_134;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_121, out a0_122, out a1_123, out a2_124, out a3_125, out a4_126, out a5_127), fp + ~0x1F, wifi_mgmr_set_connect_stat_info(a1, 0x01, out a4_51), a4_51, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_128, out a1_129, out a3_130, out a4_131, out a5_132, out s3_133, out mstatus_134);
}

// 23028AA8: void cb_event_ind(Register Eq_2 ra, Register (ptr32 Eq_125268) a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cb_event_ind(Eq_2 ra, struct Eq_125268 * a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_604 * a4_36;
	ui32 a5_14 = (word32) a1->b0003 << 24 | (((word32) a1->b0001 << 8 | (word32) a1->b0000) | (word32) a1->b0002 << 16);
	if (a5_14 != 0x01)
	{
		struct Eq_274 * a0_66;
		if (a5_14 == 0x00)
		{
			g_dw4201E44C = (word32) a1->b0007 << 24 | ((word32) a1->b0006 << 16 | ((word32) a1->b0004 | (word32) a1->b0005 << 8));
			a0_66 = (struct Eq_274 *) &g_t2307EE70;
			goto l23028B0A;
		}
		a4_36 = (struct Eq_604 *) 0x02;
		if (a5_14 != 0x02)
		{
			a0_66 = (struct Eq_274 *) &g_t2307EEAC;
l23028B0A:
			word32 s1_214;
			word32 a0_215;
			word32 a1_216;
			word32 a2_217;
			word32 a3_218;
			word32 a4_219;
			word32 a5_220;
			word32 a7_221;
			word32 s2_222;
			word32 s3_223;
			word32 s4_224;
			word32 s5_225;
			word32 s6_226;
			word32 s7_227;
			word32 s8_228;
			word32 s9_229;
			word32 s10_230;
			word32 s11_231;
			word32 t4_232;
			printf(ra, a0_66, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
			return;
		}
	}
	else
	{
		word32 a2_205;
		word32 a1_204;
		word32 a0_203;
		word32 a4_206;
		word32 a5_207;
		word32 s4_208;
		word32 s8_209;
		puts(0x2307EE90, out a0_203, out a1_204, out a2_205, out a4_206, out a5_207, out s4_208, out s8_209);
		ra = wifi_mgmr_scan_complete_notify(ra, a3, dwArg30, dwArg34, dwArg58, dwArg7C, out a4_36);
	}
	word32 s0_210;
	word32 a0_211;
	word32 a1_212;
	word32 a3_213;
	aos_post_event(ra, 0x02, a4_36, dwArg24, out s0_210, out a0_211, out a1_212, out a3_213);
}

// 23028B38: Register word32 wifi_mgmr_event_init()
// Called from:
//      wifi_mgmr_start
word32 wifi_mgmr_event_init()
{
	bl_rx_sm_connect_ind_cb_register(0x00, 0x23028A22);
	bl_rx_sm_disconnect_ind_cb_register(0x00, 0x2302898A);
	bl_rx_beacon_ind_cb_register(0x00, 587368794);
	bl_rx_probe_resp_ind_cb_register(587368778);
	bl_rx_rssi_cb_register(0x00, 587368768);
	return bl_rx_event_register(0x00, 0x23028AA8);
}

// 23028B98: void cmd_mgr_print(Register (ptr32 Eq_125447) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cmd_mgr_print(struct Eq_125447 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArgA4, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_17;
	word32 s4_100;
	word32 s3_99;
	word32 s2_98;
	word32 a4_97;
	word32 a3_96;
	word32 a2_95;
	word32 a1_94;
	word32 s1_93;
	Eq_2 a5_22;
	xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_93, out a0_17, out a1_94, out a2_95, out a3_96, out a4_97, out a5_22, out s2_98, out s3_99, out s4_100);
	word32 s0_32 = *((word32) a5_22 + 16);
	while (a5_22 != s0_32 + 16)
		a5_22 = *a5_22;
	word32 s0_101;
	word32 s1_102;
	word32 a0_103;
	word32 a1_104;
	word32 a2_105;
	word32 a3_106;
	word32 a4_107;
	word32 a5_108;
	word32 a7_109;
	word32 s2_110;
	word32 s3_111;
	word32 s4_112;
	word32 s5_113;
	word32 s6_114;
	word32 s8_115;
	xQueueGenericSend(a0_17, 0x00, 0x00, s0_32 + 16, a5_22, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s0_101, out s1_102, out a0_103, out a1_104, out a2_105, out a3_106, out a4_107, out a5_108, out a7_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114, out s8_115);
}

Eq_2 g_t23028BC0 = 
	{
		0x606F
	};
// 23028BC8: Register Eq_2 cmd_complete.isra.1(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_125590) a5, Register ptr32 mstatus, Stack (ptr32 Eq_125592) dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_125600 a4Out, Register out (ptr32 Eq_125601) a5Out)
// Called from:
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
Eq_2 cmd_complete.isra.1(Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, struct Eq_125590 * a5, ptr32 mstatus, struct Eq_125592 * dwArg04, Eq_2 dwArg24, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_125600 & a4Out, struct Eq_125601 & a5Out)
{
	struct Eq_125609 ** a4_5 = a5->ptr0000;
	a5->ptrFFFFFFFF = a4_5;
	struct Eq_125609 * a1_11 = *a4_5;
	a5->ptr0003 = a4_5;
	*a4_5 = (struct Eq_125609 **) &a5->ptrFFFFFFFF;
	*(struct Eq_125609 **) 0x00100100 = a1_11;
	*(struct Eq_125609 **) 0x00200204 = a1_11;
	Eq_2 a5_20 = (word32) a1_11->w0018;
	a1_11->w0018 = (word16) (a5_20 | 32);
	if ((a5_20 & 1) == 0x00)
	{
		if ((a5_20 & 0x18) != 0x00)
		{
			a0Out = a1;
			a3Out = a3;
			a4Out = a5_20 & 1;
			a5Out = a5_20 & 0x18;
			return s0;
		}
		else
		{
			a1_11->dw003C = 0x00;
			Eq_2 a0_31;
			Eq_2 a3_33;
			Eq_125600 a4_34;
			struct Eq_125601 * a5_35;
			word32 s1_102;
			word32 s2_103;
			word32 s3_104;
			word32 s4_105;
			Eq_2 s0_37 = xEventGroupSetBits(s0, (word32) a1 + 28, 0x01, a3, a5_20 & 1, mstatus, dwArg04, dwArg24, dwArg0138, dwArg0178, out s1_102, out a0_31, out a3_33, out a4_34, out a5_35, out s2_103, out s3_104, out s4_105);
			a0Out = a0_31;
			a3Out = a3_33;
			a4Out = a4_34;
			a5Out = a5_35;
			return s0_37;
		}
	}
	else
	{
		Eq_2 a3_49;
		Eq_125600 a4_50;
		struct Eq_125601 * a5_51;
		Eq_2 a0_54;
		Eq_2 s0_57;
		word32 s1_96;
		word32 a1_97;
		word32 a2_98;
		word32 a6_99;
		word32 s4_100;
		word32 t3_101;
		vPortFree(a1, a2, a5_20, mstatus, dwArg0158, dwArg0198, out s0_57, out s1_96, out a0_54, out a1_97, out a2_98, out a3_49, out a4_50, out a5_51, out a6_99, out s4_100, out t3_101);
		a0Out = a0_54;
		a3Out = a3_49;
		a4Out = a4_50;
		a5Out = a5_51;
		return s0_57;
	}
}

// 23028C16: void cmd_mgr_msgind(Register word32 ra, Register (ptr32 Eq_125716) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void cmd_mgr_msgind(word32 ra, struct Eq_125716 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	word32 s1_345;
	word32 a1_346;
	Eq_2 a2_104;
	Eq_2 a0_132;
	Eq_2 a4_100;
	Eq_2 a5_117;
	struct Eq_125734 * s2_227;
	<anonymous> * s3_228;
	word32 s4_229;
	Eq_2 a3_105;
	Eq_2 s0_38 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_345, out a0_132, out a1_346, out a2_104, out a3_105, out a4_100, out a5_117, out s2_227, out s3_228, out s4_229);
	word32 s1_230 = *((word32) s0_38 + 16);
	struct Eq_125759 * sp_131 = fp + ~0x1F;
	Eq_2 s5_226 = s1_230 + 16;
	while (s0_38 != s5_226)
	{
		a4_100 = (word32) *((word32) s0_38 + 0x0A);
		a5_117 = (word32) s2_227->w0000;
		if (a4_100 == a5_117)
		{
			ui32 a5_54 = (word32) *((word32) s0_38 + 24);
			a5_117 = a5_54 & 0x10;
			if ((a5_54 & 0x10) == 0x00)
				goto l23028CBA;
			if (s3_228 != null)
			{
				s3_228();
				if (a0_132 != 0x00)
					goto l23028CBA;
			}
			Eq_2 s0_94 = *((word32) a0_132 + 16);
			((word32) s0_94 + 24)->u0 = (word16) ((word32) *((word32) s0_38 + 24) & ~0x10);
			if (a0_132 != 0x00)
			{
				a2_104 = (word32) s2_227->w0006;
				if (a2_104 != 0x00)
				{
					word32 a1_357;
					word32 a5_358;
					word32 a6_359;
					word32 a7_360;
					memcpy(a0_132, &s2_227->w0006 + 1, a2_104, out a1_357, out a2_104, out a3_105, out a4_100, out a5_358, out a6_359, out a7_360);
				}
			}
			ui32 a5_115 = (word32) *((word32) s0_94 + 24);
			a5_117 = a5_115 & 0x18;
			if ((a5_115 & 0x18) == 0x00)
			{
				word32 a3_356;
				cmd_complete.isra.1(s0_94, s0_94, a2_104, a3_105, a5_115 & 0x18, mstatus, sp_131->ptr0004, sp_131->t0024, sp_131->t0138, sp_131->t0158, sp_131->t0178, sp_131->t0198, out a0_132, out a3_356, out a4_100, out a5_117);
			}
			break;
		}
l23028CBA:
		s0_38 = *s0_38;
	}
	word32 a3_169;
	word32 a4_170;
	word32 a5_171;
	<anonymous> * s3_177;
	word32 s4_178;
	word32 s5_179;
	word32 a2_351;
	word32 a7_352;
	word32 s8_355;
	word32 s2_353;
	word32 s6_354;
	word32 a0_349;
	word32 a1_350;
	word32 s0_347;
	word32 s1_348;
	xQueueGenericSend(a0_132, 0x00, 0x00, a4_100, a5_117, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_347, out s1_348, out a0_349, out a1_350, out a2_351, out a3_169, out a4_170, out a5_171, out a7_352, out s2_353, out s3_177, out s4_178, out s5_179, out s6_354, out s8_355);
	if (s5_179 == 0x00 && s3_177 != null)
		s3_177();
}

