pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
Eq_2 g_t23028C3A = 
	{
		35475
	};
// 23028CCE: void cmd_mgr_llind(Register Eq_2 ra, Register (ptr32 Eq_125906) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s6, Register (ptr32 Eq_125592) s8, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void cmd_mgr_llind(Eq_2 ra, struct Eq_125906 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s6, struct Eq_125592 * s8, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 a1_453;
	word32 s1_452;
	word32 s4_456;
	word32 a5_454;
	word32 s3_455;
	Eq_2 a2_130;
	Eq_2 a0_135;
	Eq_2 a4_113;
	Eq_2 a3_140;
	Eq_2 s2_249;
	Eq_2 s0_105 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_452, out a0_135, out a1_453, out a2_130, out a3_140, out a4_113, out a5_454, out s2_249, out s3_455, out s4_456);
	Eq_2 a5_103 = 0x00;
	Eq_2 s4_245 = (word32) *((word32) s0_105 + 16) + 16;
	struct Eq_125960 * s5_250 = &g_t4200E000;
	word32 s7_254 = 0x23079000;
	while (s0_105 != s4_245)
	{
		if (a5_103 == 0x00)
		{
			s0_105 = *((word32) a3_140 + 20);
			a4_113 = *((word32) s2_249 + 20);
			if (a3_140 != a4_113)
				goto l23028D46;
			a5_103 = s0_105;
			if (s0_105 != s2_249)
			{
				a4_113 = (word32) s5_250->bFFFFFDE4;
				if (a4_113 == 0x00)
				{
					byte * s3_94;
					word32 s8_99;
					word32 s1_472;
					word32 s10_478;
					word32 s11_479;
					word32 t4_480;
					word32 s6_476;
					word32 s9_477;
					word32 a7_475;
					word32 a1_473;
					word32 a5_474;
					ra = printf(ra, s7_254 + -0x05BC, a3_140, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_472, out a0_135, out a1_473, out a2_130, out a3_140, out a4_113, out a5_474, out a7_475, out s2_249, out s3_94, out s4_245, out s5_250, out s6_476, out s7_254, out s8_99, out s9_477, out s10_478, out s11_479, out t4_480);
					*s3_94 = (byte) s8_99;
					a5_103 = s0_105;
				}
			}
		}
		else
		{
l23028D46:
			ui32 a4_67 = (word32) *((word16) s0_105.u0 + 24);
			a4_113 = a4_67 & 0x04;
			if ((a4_67 & 0x04) != 0x00)
			{
				if (a5_103 != 0x00)
					goto l23028D50;
				goto l23028D6C;
			}
		}
		s0_105 = *s0_105.u0;
	}
	s0_105.u0 = 0x00;
	if (a5_103 != 0x00)
	{
l23028D50:
		ui32 a5_112 = (word32) *((word32) s2_249 + 24);
		((word32) s2_249 + 24)->u0 = (word16) (a5_112 & -9);
		a4_113 = a5_112 & -9;
		a5_103 = a5_112 & 0x10;
		if ((a5_112 & 0x10) == 0x00)
			s0_105 = cmd_complete.isra.1(s0_105, s2_249, a2_130, a3_140, a5_112 & 0x10, mstatus, s8, dwLoc0C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out a0_135, out a3_140, out a4_113, out a5_103);
		if (s0_105 != 0x00)
		{
l23028D6C:
			ui32 a5_155 = (word32) *((word16) s0_105.u0 + 24);
			((word16) s0_105.u0 + 24)->u0 = (word16) (a5_155 & ~0x04);
			uint32 a2_169 = (word32) (a5_155 & ~0x04)->w0006 + 0x08 << 16;
			Eq_2 a5_178;
			word32 t3_488;
			word32 s0_481;
			word32 a3_485;
			word32 a6_486;
			word32 s4_487;
			word32 a1_483;
			word32 a2_484;
			word32 s1_482;
			vPortFree(ipc_host_msg_push(a2_169 >> 16, a3_140, a4_113, out a5_178), a2_169 >> 16, a5_178, mstatus, dwArg0128, dwArg0168, out s0_481, out s1_482, out a0_135, out a1_483, out a2_484, out a3_485, out a4_113, out a5_103, out a6_486, out s4_487, out t3_488);
		}
	}
	word32 s8_471;
	word32 s6_470;
	word32 s3_467;
	word32 a4_463;
	word32 a0_459;
	word32 a1_460;
	word32 s1_458;
	word32 a3_462;
	word32 s0_457;
	word32 a5_464;
	word32 a7_465;
	word32 a2_461;
	word32 s4_468;
	word32 s5_469;
	word32 s2_466;
	xQueueGenericSend(a0_135, 0x00, 0x00, a4_113, a5_103, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s0_457, out s1_458, out a0_459, out a1_460, out a2_461, out a3_462, out a4_463, out a5_464, out a7_465, out s2_466, out s3_467, out s4_468, out s5_469, out s6_470, out s8_471);
	0x00 = (uint16) dwArg0128;
}

Eq_2 g_t23028CEE = 
	{
		0x4280
	};
// 23028DB6: void cmd_mgr_queue(Register (ptr32 Eq_126149) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void cmd_mgr_queue(struct Eq_126149 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	byte * s1_33;
	word32 a1_547;
	word32 a3_549;
	word32 a2_548;
	word32 a4_550;
	word32 a5_551;
	word32 s2_552;
	word32 s4_554;
	word32 s3_553;
	Eq_2 a0_25;
	Eq_2 s0_32 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_33, out a0_25, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out s2_552, out s3_553, out s4_554);
	Eq_2 a4_40 = (word32) *s1_33;
	if (a4_40 != 0x02)
	{
		Eq_2 s1_42 = *(union Eq_2 *) 0x12;
		if (s1_42 != 0x0E)
		{
			if (a4_40 == 0x02)
			{
				*(union Eq_2 *) 0x48 = s0_32;
				word32 s6_583;
				word32 s8_584;
				word32 s2_579;
				word32 s3_580;
				word32 s4_581;
				word32 s5_582;
				word32 a7_578;
				word32 a5_577;
				word32 a4_576;
				word32 a3_575;
				word32 a2_574;
				word32 s0_570;
				word32 s1_571;
				word32 a0_572;
				word32 a1_573;
				xQueueGenericSend(a0_25, 0x00, 0x00, a4_40, 0x0C, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_570, out s1_571, out a0_572, out a1_573, out a2_574, out a3_575, out a4_576, out a5_577, out a7_578, out s2_579, out s3_580, out s4_581, out s5_582, out s6_583, out s8_584);
				return;
			}
			if (((word32) *(union Eq_2 *) 0x1A & 0x0C) != 0x00)
				((word32) s0_32 + 24)->u0 = (word16) ((word32) *((word32) s0_32 + 24) | 4);
		}
		struct Eq_126290 * a5_59;
		ui32 a5_57 = (word32) *((word32) s0_32 + 24);
		if ((a5_57 & 2) == 0x00)
			a5_59 = a5_57 | 8;
		else
			a5_59 = a5_57 | 24;
		((word32) s0_32 + 24)->u0 = (word16) a5_59;
		Eq_2 a4_103 = (char *) a5_59 + 1;
		*((word32) a4_103 + 4) = a5_59->dw0004;
		a5_59->t0014 = s0_32;
		*(union Eq_2 *) 0x40 = s0_32;
		ui32 a5_70 = (word32) *((word32) s0_32 + 24);
		Eq_2 a5_71 = a5_70 & 0x01;
		if ((a5_70 & 0x01) == 0x00)
		{
			a0_25 = (word32) s0_32 + 28;
			s0_32 = xEventGroupCreateStatic((word32) s0_32 + 28, a4_103, mstatus, out a4_103, out a5_71);
		}
		struct Eq_126314 * s1_83 = *((word32) a5_71 + 20);
		*((word32) s0_32 + 20) = s1_83;
		*s0_32 = (word32) s1_42 + 16;
		*((word32) a5_71 + 4) = s0_32;
		*s0_32 = a5_71;
		*((word32) *((word32) a0_25 + 24) + 8) = s1_83->dw0008 + 0x01;
		Eq_2 a3_110;
		Eq_2 a4_111;
		struct Eq_126346 * a5_112;
		word32 s2_117;
		word32 s3_118;
		word32 s5_591;
		word32 s6_592;
		word32 s8_593;
		word32 a1_587;
		word32 a2_588;
		word32 a7_589;
		word32 s4_590;
		word32 s1_585;
		word32 a0_586;
		struct Eq_126358 * s0_115;
		xQueueGenericSend(a0_25, 0x00, 0x00, a4_103, a5_71, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_115, out s1_585, out a0_586, out a1_587, out a2_588, out a3_110, out a4_111, out a5_112, out a7_589, out s2_117, out s3_118, out s4_590, out s5_591, out s6_592, out s8_593);
		if (s3_118 == 0x00)
		{
			uint32 a2_135 = (word32) a5_112->w0006 + 0x08 << 16;
			word32 a0_595;
			word32 s1_594;
			word32 a4_599;
			word32 a3_598;
			word32 a6_601;
			word32 s4_602;
			word32 a2_597;
			word32 a5_600;
			word32 t3_603;
			Eq_2 a5_140;
			word32 a1_596;
			vPortFree(ipc_host_msg_push(a2_135 >> 16, a3_110, a4_111, out a5_140), a2_135 >> 16, a5_140, mstatus, dwArg0138, dwArg0178, out s0_115, out s1_594, out a0_595, out a1_596, out a2_597, out a3_598, out a4_599, out a5_600, out a6_601, out s4_602, out t3_603);
		}
		if (((word32) s0_115->t0018 & 0x01) == 0x00)
		{
			Eq_2 a5_176;
			struct Eq_126473 * s3_181;
			Eq_2 a4_175;
			Eq_2 a2_173;
			Eq_2 a3_174;
			ui32 a0_172 = xEventGroupWaitBits((char *) &s0_115->t0018 + 4, 0x01, 0x01, 0x00, s2_117 + 1000000, mstatus, dwLoc08, dwArg0108, dwArg0148, out a2_173, out a3_174, out a4_175, out a5_176, out s3_181);
			if ((a0_172 & 0x01) == 0x00)
			{
				word32 a5_605;
				word32 a1_604;
				word32 s3_607;
				word32 s4_608;
				word32 s2_606;
				Eq_2 a2_193;
				Eq_2 a3_194;
				byte * s1_199;
				Eq_2 a0_191;
				Eq_2 a4_195;
				Eq_2 s0_198 = xQueueSemaphoreTake(a0_172 & 0x01, ~0x00, a2_173, a3_174, a4_175, a5_176, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_199, out a0_191, out a1_604, out a2_193, out a3_194, out a4_195, out a5_605, out s2_606, out s3_607, out s4_608);
				*s1_199 = 0x02;
				ui32 a5_208 = (word32) *((word32) s0_198 + 24);
				Eq_2 a5_209 = a5_208 & 32;
				if ((a5_208 & 32) == 0x00)
				{
					*(union Eq_2 *) 0xAA = s0_198;
					word32 a3_620;
					cmd_complete.isra.1(s0_198, s0_198, a2_193, a3_194, (struct Eq_125590 *) 110, mstatus, dwLoc1C, dwArg04, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_191, out a3_620, out a4_195, out a5_209);
				}
				word32 s0_609;
				word32 s1_610;
				word32 a0_611;
				word32 a1_612;
				word32 a5_613;
				word32 a7_614;
				word32 s2_615;
				word32 s4_616;
				word32 s5_617;
				word32 s6_618;
				word32 s8_619;
				xQueueGenericSend(a0_191, 0x00, 0x00, a4_195, a5_209, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_609, out s1_610, out a0_611, out a1_612, out a2_173, out a3_174, out a4_175, out a5_613, out a7_614, out s2_615, out s3_181, out s4_616, out s5_617, out s6_618, out s8_619);
			}
			vEventGroupDelete(s3_181, a2_173, a3_174, a4_175, mstatus, dwLoc0C, dwArg14, dwArg0128, dwArg0138, dwArg0168, dwArg0178);
		}
		else
			s0_115->dw003C = 0x00;
	}
	else
	{
		*(union Eq_2 *) 0x5C = s0_32;
		word32 s4_566;
		word32 s5_567;
		word32 s6_568;
		word32 s8_569;
		word32 a5_562;
		word32 a7_563;
		word32 s2_564;
		word32 s3_565;
		word32 a4_561;
		word32 a3_560;
		word32 a2_559;
		word32 a1_558;
		word32 a0_557;
		word32 s1_556;
		word32 s0_555;
		xQueueGenericSend(a0_25, 0x00, 0x00, a4_40, 32, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_555, out s1_556, out a0_557, out a1_558, out a2_559, out a3_560, out a4_561, out a5_562, out a7_563, out s2_564, out s3_565, out s4_566, out s5_567, out s6_568, out s8_569);
	}
}

