pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
Eq_2 g_t23028DD2 = 
	{
		18313
	};
// 23028F20: void cmd_mgr_drain(Register (ptr32 Eq_126608) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register (ptr32 Eq_125592) s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cmd_mgr_drain(struct Eq_126608 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, struct Eq_125592 * s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	struct Eq_126626 * a0_26;
	word32 s2_35;
	word32 s3_178;
	word32 a1_176;
	word32 s4_179;
	word32 a2_177;
	Eq_2 s1_34;
	Eq_2 a5_126;
	Eq_2 a4_127;
	Eq_2 a3_131;
	xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_34, out a0_26, out a1_176, out a2_177, out a3_131, out a4_127, out a5_126, out s2_35, out s3_178, out s4_179);
	Eq_2 s4_125 = a0_26->dw0010 + 16;
	Eq_2 a0_44 = *s1_34;
	word32 s2_128 = s2_35 + 0x0100;
	word32 s3_129 = 0x00200200;
	while (a0_44 != s4_125)
	{
		Eq_2 a0_53 = *a4_127;
		*((word32) a5_126 + 4) = a4_127;
		*a4_127 = a5_126;
		*a0_53 = s2_128;
		*((word32) a0_53 + 4) = s3_129;
		Eq_2 s0_60 = *((word32) a5_126 + 8);
		*((word32) a5_126 + 7) = s0_60;
		ui32 a5_63 = (word32) *((word32) a0_53 + 24);
		a5_126 = a5_63 & 0x01;
		if ((a5_63 & 0x01) == 0x00)
		{
			word32 a0_195;
			xEventGroupSetBits(s0_60, (word32) a0_53 + 28, 0x01, a3_131, a4_127, mstatus, s4, dwArg04, dwArg0118, dwArg0158, out s1_34, out a0_195, out a3_131, out a4_127, out a5_126, out s2_128, out s3_129, out s4_125);
		}
		a0_44 = s1_34;
		s1_34 = *s1_34;
	}
	word32 a0_182;
	word32 s0_180;
	word32 s8_194;
	word32 s5_192;
	word32 s6_193;
	word32 s3_190;
	word32 s4_191;
	word32 a7_188;
	word32 s2_189;
	word32 a4_186;
	word32 a5_187;
	word32 a2_184;
	word32 a3_185;
	word32 a1_183;
	word32 s1_181;
	xQueueGenericSend(a0_44, 0x00, 0x00, a4_127, a5_126, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s0_180, out s1_181, out a0_182, out a1_183, out a2_184, out a3_185, out a4_186, out a5_187, out a7_188, out s2_189, out s3_190, out s4_191, out s5_192, out s6_193, out s8_194);
}

Eq_2 g_t23028F4C = 
	{
		0x8993
	};
// 23028F9A: Register word32 bl_cmd_mgr_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_ipc_init
word32 bl_cmd_mgr_init(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & s2Out)
{
	*((word32) a0 + 32) = a0;
	*((word32) a0 + 36) = a0;
	ptr32 a3_19;
	ptr32 s2_24;
	struct Eq_126761 * a0_30;
	word32 a1_71;
	word32 a4_72;
	word32 a5_73;
	word32 s3_74;
	word32 s4_75;
	word32 s5_76;
	word32 s6_77;
	word32 s1_23 = xQueueCreateMutex(ra, a3, a4, (word32) a0 + 16, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_30, out a1_71, out a3_19, out a4_72, out a5_73, out s2_24, out s3_74, out s4_75, out s5_76, out s6_77);
	*(union Eq_2 *) 0x14 = a0;
	g_t23028DD2 = a0;
	g_t23028BC0 = a0;
	g_t23028F4C = a0;
	g_t23028CEE = a0;
	a0_30->t0018 = a0;
	g_t23028C3A = a0;
	a3Out = a3_19;
	s2Out = s2_24;
	return s1_23;
}

// 23028FF0: Register word32 bl_irqs_init()
// Called from:
//      bl_main_lowlevel_init
word32 bl_irqs_init()
{
	return 0x00;
}

// 23028FF4: Register Eq_2 bl_irq_bottomhalf(Register Eq_2 ra, Register ptr32 s0, Register (ptr32 Eq_46930) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_46927 s6, Register ptr32 mstatus, Stack word32 dwArg18, Stack ptr32 dwArg38, Stack Eq_2 dwArg78, Stack word32 dwArg98, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_event_handle
Eq_2 bl_irq_bottomhalf(Eq_2 ra, ptr32 s0, struct Eq_46930 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_46927 s6, ptr32 mstatus, word32 dwArg18, ptr32 dwArg38, Eq_2 dwArg78, word32 dwArg98, union Eq_2 & a0Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	word32 a5_166;
	Eq_2 a0_12 = xTaskGetTickCount(out a5_166);
	Eq_2 s0_14 = *((word32) a0_12 + 52);
	ui32 s1_15 = 0x00;
	Eq_2 a0_16 = ipc_host_get_rawstatus(a0_12);
	do
	{
		while (a0_16 != 0x00)
		{
			Eq_2 a0_46;
			ra = ipc_host_irq(ra, s1_15 | a0_16, a0_16, a0_16, a2, a3, a4, s2, s4, s6, mstatus, dwLoc10, s0, dwArg18, dwArg38, dwArg78, dwArg98, out s1_15, out a0_46, out a2, out a3, out a4, out s2, out s4, out s6, out mstatus);
			s0_14 = *((word32) a0_46 + 52);
			a0_16 = ipc_host_get_rawstatus(a0_46);
		}
		word32 a5_167;
		Eq_2 a0_56 = xTaskGetTickCount(out a5_167);
		if ((s1_15 & 8) != 0x00)
			*((word32) a0_56 + 60) = s0_14;
		if ((s1_15 & 0x0780) != 0x00)
			*((word32) a0_56 + 64) = s0_14;
		ipc_host_enable_irq((struct Eq_99963 *) 0x07FF);
		s0_14 = *((word32) a0_56 + 52);
		a0_16 = ipc_host_get_rawstatus(a0_56);
	} while (a0_16 != 0x00);
	a0Out = a0_16;
	a4Out = a4;
	mstatusOut = mstatus;
	return ra;
}

// 2302904E: Register Eq_2 goToErrorState(Register Eq_2 a5)
// Called from:
//      stateM_handleEvent
Eq_2 goToErrorState(Eq_2 a5)
{
	*((word32) a5 + 4) = *a5;
	word32 a0_7 = *((word32) a5 + 8);
	*a5 = a0_7;
	if (a5 == 0x00)
		return a5;
	<anonymous> * t1_9 = *((word32) a5 + 20);
	if (t1_9 == null)
		return a5;
	Eq_2 a5_13;
	word32 t1_14;
	t1_9();
	return a5_13;
}

// 23029066: void stateM_init(Register (ptr32 Eq_116484) a0, Register (ptr32 (ptr32 Eq_116484)) a1, Register (ptr32 Eq_116486) a2)
// Called from:
//      wifi_mgmr_start
void stateM_init(struct Eq_116484 * a0, struct Eq_116484 ** a1, struct Eq_116486 * a2)
{
	if (a0 != null)
	{
		*a1 = (struct Eq_116484 **) a0;
		a0->dw0004 = 0x00;
		a2->ptr0008 = a0;
	}
}

// 23029072: Register Eq_2 stateM_handleEvent(Register Eq_2 ra, Register (ptr32 Eq_116639) s1, Register word32 a0, Register (ptr32 Eq_116770) a1, Register word32 a2, Register Eq_2 a5, Register out (ptr32 Eq_116639) s0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_start
Eq_2 stateM_handleEvent(Eq_2 ra, struct Eq_116639 * s1, word32 a0, struct Eq_116770 * a1, word32 a2, Eq_2 a5, struct Eq_116639 & s0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return ra;
	}
	else
	{
		word32 a0_119 = ~0x01;
		if (a1 != null)
		{
			word32 s0_224 = s1->dw0000;
			struct Eq_116770 * s2_117 = a1;
			if (s1 == null)
			{
l23029090:
				a5 = goToErrorState(a5);
			}
			else
			{
				word32 s5_123 = 0x14;
				if (a5 != 0x00)
				{
					do
					{
						Eq_2 s4_122 = 0x00;
						while (true)
						{
							word32 * s1_31 = *((word32) a5 + 0x0C);
							if (s4_122 >= a5)
								break;
							struct Eq_126951 * s3_107 = (word32) a5 + ((word32) s4_122 + s5_123);
							word32 s1_35 = *((word32) a5 + 8);
							a4 = s3_107->dw0000;
							a5 = s2_117->dw0000;
							if (a4 == a5)
							{
								a5 = s3_107[8];
								if (a5 == 0x00)
								{
l230290EC:
									if (s3_107[16] == 0x00)
										goto l23029090;
									do
									{
										Eq_2 s1_129 = *((word32) a5 + 4);
									} while (a5 != 0x00);
									Eq_127000 s0_70 = *a5;
									if (a5 != s1_129 && a4 != 0x00)
									{
										word32 t3_101;
										word32 s8_102;
										word32 a6_103;
										word32 tp_105;
										word32 t1_243;
										a4();
									}
									a5 = s3_107[0x0C];
									if (a5 != 0x00)
									{
										word32 t1_244;
										word32 t3_136;
										word32 s8_137;
										word32 a6_138;
										word32 a2_139;
										word32 tp_140;
										a5();
									}
									Eq_127017 s0_144 = *a5;
									if (a5 != s1_129)
									{
										s1_129 = *((word32) a5 + 20);
										if (a5 != 0x00)
										{
											word32 t1_245;
											word32 t3_168;
											word32 s8_169;
											word32 a6_170;
											word32 a2_171;
											word32 tp_172;
											a5();
										}
									}
									Eq_127028 s0_176 = *a5;
									*s1_129 = s0_176;
									*((word32) a5 + 4) = s0_176;
									goto l2302909A;
								}
								word32 t3_57;
								word32 s8_58;
								word32 a6_59;
								word32 tp_61;
								word32 t1_242;
								a5();
								if (a0_119 != 0x00)
									goto l230290EC;
							}
							s4_122 = (word32) s4_122 + 1;
						}
					} while (*s1_31 != 0x00);
				}
			}
		}
l2302909A:
		s0Out = s1;
		a4Out = a4;
		a5Out = a5;
		s4Out = dwArg04;
		return ra;
	}
}

