pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302914C: void netif_status_callback(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void netif_status_callback(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	Eq_2 a3_17;
	word32 a5_338;
	word32 a4_337;
	ip4addr_ntoa(out a3_17, out a4_337, out a5_338);
	word32 a4_344;
	word32 a3_343;
	word32 a2_342;
	word32 a0_340;
	word32 a1_341;
	word32 s1_339;
	word32 a5_345;
	word32 a7_346;
	word32 s2_347;
	word32 s3_348;
	word32 s4_349;
	word32 s5_350;
	word32 s6_351;
	word32 s7_352;
	word32 s8_353;
	word32 s9_354;
	word32 s10_355;
	word32 s11_356;
	word32 t4_357;
	Eq_2 ra_40 = printf(ra, &g_t2307EF9C, a3_17, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_339, out a0_340, out a1_341, out a2_342, out a3_343, out a4_344, out a5_345, out a7_346, out s2_347, out s3_348, out s4_349, out s5_350, out s6_351, out s7_352, out s8_353, out s9_354, out s10_355, out s11_356, out t4_357);
	Eq_2 a3_58;
	word32 a4_358;
	word32 a5_359;
	ip4addr_ntoa(out a3_58, out a4_358, out a5_359);
	word32 s1_360;
	word32 a0_361;
	word32 a1_362;
	word32 a2_363;
	word32 a3_364;
	word32 a4_365;
	word32 a5_366;
	word32 a7_367;
	word32 s2_368;
	word32 s3_369;
	word32 s4_370;
	word32 s5_371;
	word32 s6_372;
	word32 s7_373;
	word32 s8_374;
	word32 s9_375;
	word32 s10_376;
	word32 s11_377;
	word32 t4_378;
	Eq_2 ra_81 = printf(ra_40, &g_ptr2307EFC8, a3_58, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_360, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out t4_378);
	Eq_2 a3_99;
	word32 a4_379;
	word32 a5_380;
	ip4addr_ntoa(out a3_99, out a4_379, out a5_380);
	word32 a5_115;
	Eq_2 a3_119;
	word32 s1_123;
	Eq_2 s4_128;
	word32 a0_381;
	word32 a1_382;
	word32 a2_383;
	word32 a4_384;
	word32 a7_385;
	word32 s2_386;
	word32 s3_387;
	word32 s5_388;
	word32 s6_389;
	word32 s7_390;
	word32 s8_391;
	word32 s9_392;
	word32 s10_393;
	word32 s11_394;
	word32 t4_395;
	Eq_2 ra_122 = printf(ra_81, &g_t2307EFD4, a3_99, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_123, out a0_381, out a1_382, out a2_383, out a3_119, out a4_384, out a5_115, out a7_385, out s2_386, out s3_387, out s4_128, out s5_388, out s6_389, out s7_390, out s8_391, out s9_392, out s10_393, out s11_394, out t4_395);
	if (s1_123 == 0x00 || a5_115 == 0x00)
	{
		word32 s1_396;
		word32 a0_397;
		word32 a1_398;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		word32 a7_403;
		word32 s2_404;
		word32 s3_405;
		word32 s4_406;
		word32 s5_407;
		word32 s6_408;
		word32 s7_409;
		word32 s8_410;
		word32 s9_411;
		word32 s10_412;
		word32 s11_413;
		word32 t4_414;
		printf(ra_122, &g_t2307EFE0, a3_119, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a7_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
	}
	else
	{
		Eq_2 a1_139;
		Eq_2 a3_141;
		ptr32 mstatus_146;
		Eq_2 ra_147 = wifi_mgmr_api_ip_update(ra_122, s4_128, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, ra, dwArg70, dwArg74, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a1_139, out a3_141, out mstatus_146);
		dns_getserver(0x00);
		dns_getserver(0x01);
		wifi_mgmr_api_ip_got(ra_147, dwArg04, mstatus_146, dwArg10, dwArg14, dwArg38, dwArg44, dwArg5C, a3_141, a1_139, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
	}
}

// 230291E8: void wifi_tx(Register Eq_2 ra, Register (ptr32 Eq_108681) a0, Register Eq_2 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack word32 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8)
void wifi_tx(Eq_2 ra, struct Eq_108681 * a0, Eq_2 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, word32 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgC8)
{
	Eq_2 a3_11 = (word32) *((word32) a1 + 8);
	Eq_2 a5_14 = a1;
	if (a3_11 > 1514)
	{
		word32 * a5_66;
		Eq_2 a0_65 = xTaskGetTickCount(out a5_66);
		word32 s0_67 = *a5_66;
		if (a0_65 - a5_66 > 2000)
		{
			word32 s1_189;
			word32 a0_190;
			word32 a1_191;
			word32 a2_192;
			word32 a3_193;
			word32 a4_194;
			word32 a5_195;
			word32 a7_196;
			word32 s2_197;
			word32 s3_198;
			word32 s4_199;
			word32 s5_200;
			word32 s6_201;
			word32 s7_202;
			word32 s8_203;
			word32 s9_204;
			word32 s10_205;
			word32 s11_206;
			word32 t4_207;
			printf(ra, &g_t2307F008, a3_11, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
			word32 a5_208;
			*xTaskGetTickCount(out a5_208) = s0_67;
		}
	}
	else
	{
		do
			a5_14 = *a5_14;
		while (a5_14 != 0x00);
		bl_output(ra, g_ptr4200DDE8, a0, a1, (word32) (a0->tFFFFFFE0 < 1), s2, mstatus, dwLoc18, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg84, dwArg88, dwArgA0, dwArgA4, dwArgC8);
	}
}

struct Eq_127403 * g_ptr23029200 = &g_t4200E437;
// 23029266: void bl606a0_wifi_netif_init(Register (ptr32 Eq_127403) a0)
void bl606a0_wifi_netif_init(struct Eq_127403 * a0)
{
	g_ptr2307EFC8 = a0;
	a0->w0038 = 1500;
	a0->w0040 = 64006;
	g_ptr2303EC42 = a0;
	g_ptr23029200 = a0;
	netif_set_status_callback(a0, &g_t2302914C);
}

