pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230292AE: Register Eq_2 bl606a0_wifi_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 bl606a0_wifi_init(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & mstatusOut)
{
	byte bLoc16_204 = SLICE(dwLoc18, byte, 16);
	word32 s1_235;
	word32 a0_236;
	word32 a1_237;
	word32 a2_238;
	word32 a3_239;
	word32 a4_240;
	word32 a5_241;
	word32 a7_242;
	word32 s2_243;
	word32 s3_244;
	word32 s4_245;
	word32 s5_246;
	word32 s6_247;
	word32 s7_248;
	word32 s8_249;
	word32 s9_250;
	word32 s10_251;
	word32 s11_252;
	word32 t4_253;
	word32 t1_254;
	word32 a0_255;
	word32 a1_256;
	word32 a2_257;
	word32 a3_258;
	word32 a4_259;
	word32 a5_260;
	Eq_2 ra_44 = memset(printf(ra, &g_t2307EF10, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_235, out a0_236, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241, out a7_242, out s2_243, out s3_244, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253), fp + ~0x17, 0x00, 0x06, out t1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260);
	bl_wifi_mac_addr_get(fp + ~0x17);
	Eq_2 a3_96;
	union Eq_2 * a4_127;
	Eq_2 s1_130;
	Eq_2 s2_133;
	word32 s1_261;
	word32 a0_262;
	word32 a1_263;
	word32 a2_264;
	word32 a3_265;
	word32 a4_266;
	word32 a5_267;
	word32 a7_268;
	word32 s2_269;
	word32 s3_270;
	word32 s4_271;
	word32 s5_272;
	word32 s6_273;
	word32 s7_274;
	word32 s8_275;
	word32 s9_276;
	word32 s10_277;
	word32 s11_278;
	word32 t4_279;
	word32 a4_280;
	word32 a5_281;
	word32 s3_282;
	word32 a0_283;
	word32 a1_284;
	word32 a2_285;
	word32 a3_286;
	word32 a5_287;
	word32 a7_288;
	word32 s3_289;
	word32 s4_290;
	word32 s5_291;
	word32 s6_292;
	word32 s7_293;
	word32 s8_294;
	word32 s9_295;
	word32 s10_296;
	word32 s11_297;
	word32 t4_298;
	Eq_2 ra_129 = printf(bl_msg_update_channel_cfg(printf(ra_44, &g_t2307EF28, (word32) bLoc16_204, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_261, out a0_262, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s7_274, out s8_275, out s9_276, out s10_277, out s11_278, out t4_279), a0, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out a3_96, out a4_280, out a5_281, out s3_282), &g_t2307EF5C, a3_96, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_130, out a0_283, out a1_284, out a2_285, out a3_286, out a4_127, out a5_287, out a7_288, out s2_133, out s3_289, out s4_290, out s5_291, out s6_292, out s7_293, out s8_294, out s9_295, out s10_296, out s11_297, out t4_298);
	bl_wifi_clock_enable(a4_127);
	ptr32 mstatus_169;
	ptr32 s0_171;
	word32 t1_299;
	word32 a0_300;
	word32 a1_301;
	word32 a2_302;
	word32 a3_303;
	word32 a4_304;
	word32 a5_305;
	Eq_2 ra_170 = bl_main_rtthread_start(memset(ra_129, 0x4200DDE8, 0x00, 0x04, out t1_299, out a0_300, out a1_301, out a2_302, out a3_303, out a4_304, out a5_305), s1_130, s2_133, mstatus, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg3C, dwArg58, ra, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_171, out mstatus_169);
	s0Out = s0_171;
	mstatusOut = mstatus_169;
	return ra_170;
}

// 2302932C: Register Eq_2 fdt32_ld(Register Eq_2 a0, Register out Eq_127625 a4Out, Register out Eq_127626 a5Out)
// Called from:
//      fdt_get_property_by_offset_
//      fdt_get_string
//      fdt_get_name
//      fdt_get_property_namelen_
//      fdt_getprop
Eq_2 fdt32_ld(Eq_2 a0, union Eq_127625 & a4Out, union Eq_127626 & a5Out)
{
	Eq_127625 a4_10 = (word32) *((word32) a0 + 3);
	Eq_127626 a5_12 = (word32) *a0 << 24 | (word32) (*((word32) a0 + 1)) << 16 | a4_10;
	Eq_2 a0_14 = (word32) *((word32) a0 + 2) << 8 | a5_12;
	a4Out = a4_10;
	a5Out = a5_12;
	return a0_14;
}

// 2302934A: Register Eq_2 nextprop_.part.0(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_first_property_offset
//      fdt_next_property_offset
Eq_2 nextprop_.part.0(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s2_17 = a0;
	Eq_2 s0_19 = a1;
	do
	{
		ptr32 a0_33;
		ptr32 a4_36;
		ptr32 a5_37;
		ptr32 s1_41;
		ptr32 s3_43;
		ptr32 s4_44;
		ra = fdt_next_tag(ra, s2_17, s0_19, fp + -36, s5, s6, dwLoc30, dwLoc2C, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_19, out s1_41, out a0_33, out a4_36, out a5_37, out s2_17, out s3_43, out s4_44, out s5, out s6);
		if (a0_33 == s3_43)
			goto l23029382;
		if (a0_33 == s4_44)
		{
			if (s0_19 >= 0x00)
				s0_19.u0 = ~0x0A;
			goto l23029382;
		}
	} while (a0_33 == s1_41);
	s0_19.u0 = ~0x00;
l23029382:
	0x00 = (uint16) dwArg0128;
	a0Out = s0_19;
	a4Out = a4_36;
	a5Out = a5_37;
	s2Out = s2_17;
	s3Out = s3_43;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 23029394: Register Eq_2 fdt_get_property_by_offset_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_get_property_by_offset_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, ptr32 & a0Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_42;
	word32 s0_27;
	word32 s1_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s5_32;
	ptr32 s6_33;
	Eq_2 a0_20;
	ptr32 a5_24;
	ptr32 a4_23;
	Eq_2 ra_26 = fdt_check_prop_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_27, out s1_28, out a0_20, out a4_23, out a5_24, out s2_29, out s3_30, out s5_32, out s6_33);
	if (a0_20 < 0x00)
	{
		s0_42 = 0x00;
		if (s1_28 == 0x00)
			goto l230293B0;
	}
	else
	{
		s0_42 = s0_27 + ((word32) fdt32_ld(s0_27 + 8, out a4_23, out a5_24) + s2_29);
		if (s1_28 == 0x00)
			goto l230293B0;
		a0_20 = fdt32_ld(s0_42 + 4, out a4_23, out a5_24);
	}
	*a0_20 = s1_28;
l230293B0:
	0x00 = dwArg38;
	a0Out = s0_42;
	a4Out = a4_23;
	a5Out = a5_24;
	s2Out = s2_29;
	s3Out = s3_30;
	s5Out = s5_32;
	s6Out = s6_33;
	return ra_26;
}

// 230293D6: Register word32 fdt_get_string(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      fdt_get_property_namelen_
word32 fdt_get_string(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	Eq_2 s0_68;
	word32 a4_198;
	word32 a5_199;
	Eq_2 a0_23 = fdt32_ld((word32) a0 + 0x0C, out a4_198, out a5_199);
	Eq_2 s1_173 = a1;
	Eq_2 s3_182 = a0_23;
	ptr32 a5_164;
	Eq_2 a0_28 = fdt_ro_probe_(a0, out a5_164);
	if (a0_28 != 0x00)
	{
l23029496:
		s0_68.u0 = 0x00;
		if (a2 == null)
			goto l23029456;
		goto l2302949C;
	}
	s3_182 = a0_23 + a1;
	word32 a4_200;
	Eq_2 a0_34 = fdt32_ld((word32) a0 + 4, out a4_200, out a5_164);
	if (s3_182 < a0_34)
	{
		s2 = a0_34 - s3_182;
		word32 a4_201;
		word32 a5_202;
		Eq_2 a0_39 = fdt32_ld(a0, out a4_201, out a5_202);
		a5_164 = ~0x2FF20112;
		if (a0_39 == ~0x2FF20112)
		{
			if (a1 >= 0x00)
			{
				word32 a4_203;
				word32 a5_204;
				if (fdt32_ld((word32) a0 + 20, out a4_203, out a5_204) <= 0x10)
					goto l23029442;
				word32 a4_205;
				Eq_2 a0_60 = fdt32_ld((word32) a0 + 32, out a4_205, out a5_164);
				if (a1 < a0_60)
				{
					Eq_2 a0_64 = a0_60 - a1;
					if (a0_64 < s2)
						s2 = a0_64;
					goto l23029442;
				}
			}
		}
		else
		{
			a5_164 = 0x2FF20112;
			if (a0_39 != 0x2FF20112)
			{
				a0_28.u0 = ~0x0C;
				goto l23029496;
			}
			if (a1 < 0x00)
			{
				word32 a4_206;
				if (a1 >= 0x00 - fdt32_ld((word32) a0 + 32, out a4_206, out a5_164))
				{
					s1_173 = 0x00 - a1;
					if (s1_173 < s2)
						s2 = s1_173;
l23029442:
					s0_68 = a0 + s3_182;
					struct Eq_127887 * a0_81 = memchr(s0_68, 0x00, s2, out a3, out a5_164);
					if (a0_81 != null)
					{
						a0_28 = a0_81 - s0_68;
						if (a2 == null)
						{
l23029456:
							s1Out = s1_173;
							a0Out = s0_68;
							a3Out = a3;
							a5Out = a5_164;
							s2Out = s2;
							s3Out = s3_182;
							s4Out = dwArg04;
							return s1;
						}
l2302949C:
						*a2 = (union Eq_2 *) a0_28;
						goto l23029456;
					}
					a0_28.u0 = ~0x07;
					goto l23029496;
				}
			}
		}
	}
	a0_28.u0 = ~0x03;
	goto l23029496;
}

// 230294AA: Register Eq_2 fdt_get_name(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_subnode_offset_namelen
Eq_2 fdt_get_name(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg48, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s0_58;
	word32 a4_195;
	word32 a5_196;
	Eq_2 s3_165 = fdt32_ld((word32) a0 + 8, out a4_195, out a5_196);
	union Eq_2 * s2_164 = a2;
	ptr32 a5_147;
	Eq_2 a0_26 = fdt_ro_probe_(a0, out a5_147);
	if (a0_26 == 0x00)
	{
		word32 s0_41;
		word32 s1_42;
		word32 a4_197;
		ra = fdt_check_node_offset_(ra, a0, a1, s5, s6, s2, dwArg08, dwArg48, s1, out s0_41, out s1_42, out a0_26, out a4_197, out a5_147, out s2_164, out s3_165, out s5, out s6);
		if (a0_26 >= 0x00)
		{
			word32 s0_56 = (word32) s3_165 + s0_41 + s1_42;
			a5_147 = 0x0F;
			s0_58 = s0_56 + 0x04;
			word32 a4_198;
			word32 a5_199;
			if (fdt32_ld(s1_42 + 20, out a4_198, out a5_199) > 0x0F)
			{
l230294F8:
				if (s2_164 == null)
					goto l23029510;
				word32 a1_200;
				word32 a2_201;
				word32 a3_202;
				word32 a4_203;
				a0_26 = strlen(s0_58, out a1_200, out a2_201, out a3_202, out a4_203, out a5_147);
l23029502:
				*s2_164 = (union Eq_2 *) a0_26;
l23029510:
				s0Out = s0_58;
				a0Out = s0_58;
				a5Out = a5_147;
				s2Out = s2_164;
				s3Out = s3_165;
				s4Out = dwArg04;
				s5Out = s5;
				s6Out = s6;
				return ra;
			}
			word32 a0_61 = strrchr(s0_56 + 0x04, 47, out a5_147);
			if (a0_61 != 0x00)
			{
				s0_58 = a0_61 + 1;
				goto l230294F8;
			}
			a0_26.u0 = ~0x0A;
		}
	}
	s0_58.u0 = 0x00;
	if (s2_164 == null)
		goto l23029510;
	goto l23029502;
}

// 23029520: Register Eq_2 fdt_subnode_offset_namelen(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_subnode_offset
Eq_2 fdt_subnode_offset_namelen(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArgE8, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a5_108;
	Eq_2 a0_26 = fdt_ro_probe_(a0, out a5_108);
	Eq_2 s3_114 = a0;
	Eq_2 s2_113 = a3;
	Eq_2 s0_122 = a0_26;
	if (a0_26 == 0x00)
	{
		s5.u0 = 0x01;
		s0_122 = a1;
		while (s0_122 >= 0x00)
		{
			if (a5_108 < 0x00)
				goto l23029550;
			if (a5_108 == s5)
			{
				Eq_2 a0_49;
				Eq_2 a5_52;
				Eq_2 s4_58;
				ra = fdt_get_name(ra, s1, s3_114, s0_122, fp + -36, s2_113, s5, s6, dwLoc38, dwArg08, out s0_122, out a0_49, out a5_52, out s2_113, out s3_114, out s4_58, out s5, out s6);
				if (a0_49 != 0x00 && a5_52 >= s2_113)
				{
					word32 a1_247;
					word32 a2_248;
					word32 a3_249;
					word32 a4_250;
					word32 a5_251;
					if (memcmp(a0_49, s4_58, s2_113, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251) == 0x00)
					{
						s1 = a0_49 + s2_113;
						a5_108 = (word32) *s1;
						if (a5_108 == 0x00)
							goto l230295A8;
						word32 a3_252;
						word32 a5_253;
						if (memchr(s4_58, 64, s2_113, out a3_252, out a5_253) == null)
						{
							a5_108.u0 = 64;
							if ((word32) *s1 == 64)
								goto l230295A8;
						}
					}
				}
			}
			Eq_2 a0_121;
			ra = fdt_next_node(ra, s0_122, s3_114, s0_122, s5, s6, s2, dwLoc08, dwArg38, dwArgE8, out s1, out a0_121, out a5_108, out s2_113, out s3_114, out s5, out s6);
			s0_122 = a0_121;
		}
		if (a5_108 < 0x00)
		{
l23029550:
			s0_122.u0 = ~0x00;
		}
	}
l230295A8:
	s0Out = dwArg0158;
	s1Out = s1;
	a0Out = s0_122;
	a5Out = a5_108;
	s2Out = s2_113;
	s3Out = s3_114;
	s4Out = dwArgF4;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 230295BC: Register Eq_2 fdt_subnode_offset(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out (ptr32 Eq_2320) s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aos_loop_proc
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_subnode_offset(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s2, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArgE8, ptr32 & s0Out, struct Eq_2320 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a1_19;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	Eq_2 a0_15 = strlen(a2, out a1_19, out a2_69, out a3_70, out a4_71, out a5_72);
	ptr32 a5_33;
	ptr32 s0_35;
	ptr32 s2_36;
	ptr32 s3_37;
	ptr32 s4_38;
	ptr32 a0_42;
	ptr32 s5_43;
	struct Eq_2320 * s1_48;
	ptr32 s6_49;
	Eq_2 ra_47 = fdt_subnode_offset_namelen(ra, s1, a0, a1_19, a0_15, s2, s6, dwArg08, dwArg38, dwArgE8, out s0_35, out s1_48, out a0_42, out a5_33, out s2_36, out s3_37, out s4_38, out s5_43, out s6_49);
	s0Out = s0_35;
	s1Out = s1_48;
	a0Out = a0_42;
	a5Out = a5_33;
	s2Out = s2_36;
	s3Out = s3_37;
	s4Out = s4_38;
	s5Out = s5_43;
	s6Out = s6_49;
	return ra_47;
}

// 230295E0: Register Eq_2 fdt_first_property_offset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_first_property_offset(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_13;
	ptr32 a4_16;
	ptr32 a5_17;
	Eq_2 s0_20;
	ptr32 s2_22;
	ptr32 s3_23;
	Eq_2 s5_25;
	Eq_2 s6_26;
	word32 s1_88;
	Eq_2 ra_19 = fdt_check_node_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_20, out s1_88, out a0_13, out a4_16, out a5_17, out s2_22, out s3_23, out s5_25, out s6_26);
	if (a0_13 < 0x00)
	{
		a0Out = a0_13;
		a4Out = a4_16;
		a5Out = a5_17;
		s2Out = s2_22;
		s3Out = s3_23;
		s5Out = s5_25;
		s6Out = s6_26;
		return ra_19;
	}
	else
	{
		Eq_2 a0_38;
		ptr32 a4_41;
		ptr32 a5_42;
		ptr32 s2_47;
		ptr32 s3_48;
		Eq_2 s5_50;
		Eq_2 s6_51;
		Eq_2 ra_44 = nextprop_.part.0(ra_19, s0_20, a0_13, s5_25, s6_26, dwArg18, dwArg58, dwArg78, dwArg0128, out a0_38, out a4_41, out a5_42, out s2_47, out s3_48, out s5_50, out s6_51);
		a0Out = a0_38;
		a4Out = a4_41;
		a5Out = a5_42;
		s2Out = s2_47;
		s3Out = s3_48;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23029604: Register Eq_2 fdt_next_property_offset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_next_property_offset(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_13;
	ptr32 a4_16;
	ptr32 a5_17;
	Eq_2 s0_20;
	union Eq_2 * s2_22;
	ptr32 s3_23;
	Eq_2 s5_25;
	Eq_2 s6_26;
	word32 s1_88;
	Eq_2 ra_19 = fdt_check_prop_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_20, out s1_88, out a0_13, out a4_16, out a5_17, out s2_22, out s3_23, out s5_25, out s6_26);
	if (a0_13 < 0x00)
	{
		a0Out = a0_13;
		a4Out = a4_16;
		a5Out = a5_17;
		s2Out = s2_22;
		s3Out = s3_23;
		s5Out = s5_25;
		s6Out = s6_26;
		return ra_19;
	}
	else
	{
		Eq_2 a0_38;
		ptr32 a4_41;
		ptr32 a5_42;
		union Eq_2 * s2_47;
		ptr32 s3_48;
		Eq_2 s5_50;
		Eq_2 s6_51;
		Eq_2 ra_44 = nextprop_.part.0(ra_19, s0_20, a0_13, s5_25, s6_26, dwArg18, dwArg58, dwArg78, dwArg0128, out a0_38, out a4_41, out a5_42, out s2_47, out s3_48, out s5_50, out s6_51);
		a0Out = a0_38;
		a4Out = a4_41;
		a5Out = a5_42;
		s2Out = s2_47;
		s3Out = s3_48;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23029628: Register Eq_2 fdt_get_property_namelen_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_getprop
Eq_2 fdt_get_property_namelen_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_120;
	Eq_2 s6_132;
	union Eq_2 * s2_128;
	Eq_2 s3_129;
	Eq_2 s5_131;
	ptr32 a4_107;
	ptr32 a5_105;
	Eq_2 ra_126 = fdt_first_property_offset(ra, a0, a1, a5, a2, dwLoc18, dwArg28, dwArg48, dwArgF8, out a0_120, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
	while (true)
	{
		ptr32 s1_137;
		Eq_2 s0_139 = a0_120;
		if (a0_120 < 0x00)
			break;
		word32 a0_60;
		ra_126 = fdt_get_property_by_offset_(ra_126, s3_129, a0_120, s5_131, s6_132, dwLoc18, dwArg08, dwArg28, dwArg48, out a0_60, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
		if (a0_60 == 0x00)
		{
			s0_139.u0 = ~0x0C;
			break;
		}
		Eq_2 a0_85;
		Eq_2 a5_88;
		Eq_2 s4_93;
		word32 a4_261;
		word32 a5_262;
		Eq_2 s0_90 = fdt_get_string(s3_129, fdt32_ld(a0_60 + 0x08, out a4_261, out a5_262), fp + -36, out s1_137, out a0_85, out a3, out a5_88, out s2_128, out s3_129, out s4_93);
		if (a0_85 != 0x00 && s4_93 == a5_88)
		{
			word32 a1_263;
			word32 a2_264;
			if (memcmp(a0_85, s6_132, s4_93, out a1_263, out a2_264, out a3, out a4_107, out a5_105) == 0x00)
			{
				if (s5_131 != 0x00)
					*s5_131 = s0_90;
				goto l2302969C;
			}
		}
		ra_126 = fdt_next_property_offset(ra_126, s3_129, s0_90, s5_131, s6_132, dwLoc18, dwArg28, dwArg48, dwArgF8, out a0_120, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
	}
	s1_137 = 0x00;
	if (s2_128 != null)
		*s2_128 = (union Eq_2 *) s0_139;
l2302969C:
	0x00 = (uint16) dwArg0128;
	s1Out = s1_137;
	a0Out = s1_137;
	a3Out = a3;
	a4Out = a4_107;
	a5Out = a5_105;
	s2Out = s2_128;
	s3Out = s3_129;
	s5Out = s5_131;
	s6Out = s6_132;
	return ra_126;
}

