pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 230296B6: Register Eq_2 fdt_getprop_namelen(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      fdt_getprop
Eq_2 fdt_getprop_namelen(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArgD8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 a0_15;
	ptr32 a3_18;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s5_29;
	ptr32 s6_30;
	ptr32 a4_19;
	ptr32 a5_20;
	Eq_2 ra_23 = fdt_get_property_namelen_(ra, a0, a1, a2, fp + ~0x13, dwLoc18, dwArg08, dwArg28, dwArgD8, dwArg0108, out s1_25, out a0_15, out a3_18, out a4_19, out a5_20, out s2_26, out s3_27, out s5_29, out s6_30);
	ptr32 s0_35 = a0_15;
	if (a0_15 != 0x00)
	{
		a5_20 = 0x0F;
		word32 a5_123;
		if (fdt32_ld(s1_25 + 20, out a4_19, out a5_123) <= 0x0F)
		{
			a5_20 = 0x03;
			if (true)
			{
				a5_20 = 0x07;
				word32 a5_124;
				if (fdt32_ld(a0_15 + 4, out a4_19, out a5_124) > 0x07)
				{
					s0_35 = a0_15 + 0x10;
					goto l230296F0;
				}
			}
		}
		s0_35 = a0_15 + 0x0C;
	}
l230296F0:
	s0Out = s0_35;
	s1Out = s1_25;
	a0Out = s0_35;
	a1Out = a1_16;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_20;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = dwArg04;
	s5Out = s5_29;
	s6Out = s6_30;
	s8Out = dwLoc1C;
	return ra_23;
}

// 23029700: Register Eq_2 fdt_getprop(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_128544) s0Out, Register out (ptr32 Eq_128545) s1Out, Register out (ptr32 Eq_2) a0Out, Register out ptr32 a1Out, Register out Eq_128548 a3Out, Register out ptr32 a4Out, Register out Eq_128550 a5Out, Register out (ptr32 Eq_128551) s2Out, Register out (ptr32 Eq_128552) s3Out, Register out (ptr32 Eq_128553) s4Out, Register out (ptr32 Eq_128554) s5Out, Register out (ptr32 Eq_128555) s6Out, Register out ptr32 s8Out)
// Called from:
//      fdt_stringlist_count
//      fdt_stringlist_get
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_getprop(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArgD8, Eq_2 dwArg0108, union Eq_128544 & s0Out, struct Eq_128545 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_128548 & a3Out, ptr32 & a4Out, union Eq_128550 & a5Out, struct Eq_128551 & s2Out, struct Eq_128552 & s3Out, struct Eq_128553 & s4Out, struct Eq_128554 & s5Out, struct Eq_128555 & s6Out, ptr32 & s8Out)
{
	Eq_2 a1_21;
	word32 a2_76;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	strlen(a2, out a1_21, out a2_76, out a3_77, out a4_78, out a5_79);
	ptr32 a1_31;
	Eq_128548 a3_33;
	ptr32 a4_34;
	Eq_128550 a5_35;
	union Eq_128544 * s0_39;
	struct Eq_128545 * s1_40;
	struct Eq_128551 * s2_41;
	struct Eq_128552 * s3_42;
	struct Eq_128553 * s4_43;
	struct Eq_128554 * s5_44;
	struct Eq_128555 * s6_45;
	ptr32 s8_46;
	union Eq_2 * a0_50;
	Eq_2 ra_38 = fdt_getprop_namelen(ra, a0, a1_21, dwArg44, dwArg08, dwArg28, dwArgD8, dwArg0108, out s0_39, out s1_40, out a0_50, out a1_31, out a3_33, out a4_34, out a5_35, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45, out s8_46);
	s0Out = s0_39;
	s1Out = s1_40;
	a0Out = a0_50;
	a1Out = a1_31;
	a3Out = a3_33;
	a4Out = a4_34;
	a5Out = a5_35;
	s2Out = s2_41;
	s3Out = s3_42;
	s4Out = s4_43;
	s5Out = s5_44;
	s6Out = s6_45;
	s8Out = s8_46;
	return ra_38;
}

// 23029728: Register Eq_2 fdt_stringlist_count(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_board_cfg
Eq_2 fdt_stringlist_count(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgB8, Eq_2 dwArgE8, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_15;
	ptr32 s3_27;
	ptr32 s5_29;
	ptr32 s6_30;
	word32 s8_126;
	word32 a5_124;
	word32 s4_125;
	word32 a3_122;
	word32 a4_123;
	word32 a1_121;
	ptr32 s0_24;
	Eq_2 s1_100;
	Eq_2 s2_101;
	Eq_2 ra_23 = fdt_getprop(ra, a0, a2, s2, dwArg08, dwArg24, dwArgB8, dwArgE8, out s0_24, out s1_100, out a0_15, out a1_121, out a3_122, out a4_123, out a5_124, out s2_101, out s3_27, out s4_125, out s5_29, out s6_30, out s8_126);
	if (a0_15 != 0x00)
	{
		s2_101 = (word32) a0_15 + s0_24;
		s1_100 = a0_15;
		s0_24 = 0x00;
		while (s1_100 < s2_101)
		{
			word32 a1_127;
			word32 a3_128;
			word32 a4_129;
			word32 a5_130;
			s1_100 = (word32) s1_100 + ((word32) strnlen(s1_100, s2_101 - s1_100, out a1_127, out a3_128, out a4_129, out a5_130) + 1);
			if (s2_101 < s1_100)
			{
				s0_24 = ~0x0E;
				break;
			}
			++s0_24;
		}
	}
	s0Out = s0_24;
	s1Out = s1_100;
	a0Out = s0_24;
	s2Out = s2_101;
	s3Out = s3_27;
	s4Out = dwArg04;
	s5Out = s5_29;
	s6Out = s6_30;
	s8Out = dwLoc1C;
	return ra_23;
}

// 23029772: Register Eq_2 fdt_stringlist_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Stack Eq_2 dwArg14, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_128685) s0Out, Register out (ptr32 Eq_128686) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_128690 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_128694) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_128697) s6Out, Register out ptr32 s8Out)
// Called from:
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_stringlist_get(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 dwArg14, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0128, struct Eq_128685 & s0Out, struct Eq_128686 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_128690 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_128694 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_128697 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_21;
	struct Eq_128686 * s1_31;
	ptr32 s4_34;
	ptr32 s5_35;
	struct Eq_128697 * s6_36;
	ptr32 s8_37;
	word32 s0_190;
	Eq_2 a5_133;
	ptr32 a4_129;
	Eq_128690 a3_125;
	ptr32 a1_121;
	Eq_2 s2_150;
	struct Eq_128694 * s3_153;
	Eq_2 ra_29 = fdt_getprop(ra, a0, a2, dwLoc28, dwLoc08, dwArg14, dwArgA8, dwArgD8, out s0_190, out s1_31, out a0_21, out a1_121, out a3_125, out a4_129, out a5_133, out s2_150, out s3_153, out s4_34, out s5_35, out s6_36, out s8_37);
	Eq_2 s0_41 = a0_21;
	if (a0_21 == 0x00)
	{
		if (s1_31 != null)
		{
			*a5_133 = s1_31;
			goto l23029796;
		}
	}
	else
	{
		s2_150 += a0_21;
		while (s0_41 < s2_150)
		{
			word32 a5_191;
			Eq_2 a0_48 = strnlen(s0_41, s2_150 - s0_41, out a1_121, out a3_125, out a4_129, out a5_191);
			a5_133 = (word16) s0_41.u0 + ((word32) a0_48 + 1);
			if (s2_150 < a5_133)
			{
				a5_133.u0 = ~0x0E;
				if (s1_31 != null)
					goto l230297CE;
				goto l2302978E;
			}
			if (s3_153 == null)
			{
				if (s1_31 != null)
					*a0_48 = s1_31;
				goto l23029796;
			}
			s3_153 = (struct Eq_128694 *) ((char *) &s3_153->dwFFFFFE84 + 379);
			s0_41 = a5_133;
		}
		if (s1_31 != null)
		{
			a5_133.u0 = ~0x00;
l230297CE:
			*a5_133.u0 = s1_31;
		}
	}
l2302978E:
	s0_41.u0 = 0x00;
l23029796:
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_31;
	a0Out = s0_41;
	a1Out = a1_121;
	a2Out = dwArg0100;
	a3Out = a3_125;
	a4Out = a4_129;
	a5Out = a5_133;
	s2Out = s2_150;
	s3Out = s3_153;
	s4Out = s4_34;
	s5Out = s5_35;
	s6Out = s6_36;
	s8Out = s8_37;
	return ra_29;
}

