pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23029CD8: void tc_blfdtdump(Register Eq_2 ra, Register word32 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg5C)
// Called from:
//      blfdt
void tc_blfdtdump(Eq_2 ra, word32 s1, Eq_2 a3, Eq_2 s2, Eq_2 s7, Eq_2 s9, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg5C)
{
	Eq_2 s0_126 = 587723660;
	word32 s2_1084 = 0x2308063B;
	Eq_129731 s6_1085 = 0x03;
	Eq_129733 s4_1086 = ~0x2FF20112;
	Eq_129733 s7_1087 = 39;
	word32 s9_1091 = 0x2307F000;
	Eq_129733 s5_1088 = 0x11;
	while (true)
	{
		Eq_129731 a2_44 = s2_1084 - s0_126;
		if (s6_1085 >= a2_44)
			break;
		word32 a5_1620;
		struct Eq_127887 * a0_57 = memchr(s0_126, 0x00D0, (word32) a2_44 - 4, out a3, out a5_1620);
		if (a0_57 == null)
			goto l23029ED2;
		if (fdt32_ld(a0_57) == s4_1086)
		{
			Eq_129733 s3_63 = s2_1084 - a0_57;
			if (s7_1087 < s3_63 && (s5_1088 >= fdt32_ld(&a0_57->b0003 + 0x0011) && (s5_1088 >= fdt32_ld(&a0_57->b0003 + 21) && (fdt32_ld(&a0_57->b0003 + 1) < s3_63 && (fdt32_ld(&a0_57->b0003 + 5) < s3_63 && fdt32_ld(&a0_57->b0003 + 9) < s3_63)))))
				goto l23029D34;
			word32 a7_1765;
			word32 s8_1767;
			word32 s11_1769;
			word32 t4_1770;
			word32 s10_1768;
			word32 s3_1766;
			word32 s1_1759;
			word32 a0_1760;
			word32 a1_1761;
			word32 a2_1762;
			word32 a4_1763;
			word32 a5_1764;
			ra = printf(ra, s9_1091 + 0x00D0, a3, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1759, out a0_1760, out a1_1761, out a2_1762, out a3, out a4_1763, out a5_1764, out a7_1765, out s2_1084, out s3_1766, out s4_1086, out s5_1088, out s6_1085, out s7_1087, out s8_1767, out s9_1091, out s10_1768, out s11_1769, out t4_1770);
		}
		s0_126 = &a0_57->b0001;
	}
	if (s0_126 != 0x00 && a2_44 > 39)
	{
l23029D34:
		word32 s1_1621;
		word32 a0_1622;
		word32 a7_1628;
		word32 a5_1627;
		word32 s6_1633;
		word32 s3_1630;
		word32 s2_1629;
		word32 t4_1639;
		word32 a1_1623;
		word32 a2_1624;
		word32 a3_1625;
		word32 a4_1626;
		word32 s4_1631;
		word32 s5_1632;
		word32 s11_1638;
		word32 s8_1635;
		word32 s10_1637;
		word32 s7_1634;
		word32 s9_1636;
		Eq_2 ra_220 = printf(ra, &g_t2307F14C, a3, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1621, out a0_1622, out a1_1623, out a2_1624, out a3_1625, out a4_1626, out a5_1627, out a7_1628, out s2_1629, out s3_1630, out s4_1631, out s5_1632, out s6_1633, out s7_1634, out s8_1635, out s9_1636, out s10_1637, out s11_1638, out t4_1639);
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_1641;
			xTaskGetTickCountFromISR(out a5_1641);
		}
		else
		{
			word32 a5_1640;
			xTaskGetTickCount(out a5_1640);
		}
		Eq_2 a0_255;
		Eq_2 a3_258;
		word32 s5_1831;
		word32 s7_1833;
		word32 s8_1834;
		word32 s11_1837;
		word32 s10_1836;
		word32 s9_1835;
		word32 s6_1832;
		word32 a4_1826;
		word32 a5_1827;
		word32 s2_1828;
		word32 s3_1829;
		word32 s4_1830;
		word32 a1_1824;
		word32 a2_1825;
		word32 s1_1823;
		Eq_2 ra_261 = bl_printk(ra_220, &g_t2307F17C, 0x2307F0F8, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1823, out a0_255, out a1_1824, out a2_1825, out a3_258, out a4_1826, out a5_1827, out s2_1828, out s3_1829, out s4_1830, out s5_1831, out s6_1832, out s7_1833, out s8_1834, out s9_1835, out s10_1836, out s11_1837);
		Eq_2 a0_297 = fdt32_to_cpu(fdt32_to_cpu(fdt32_to_cpu(fdt32_to_cpu(fdt32_to_cpu(a0_255)))));
		Eq_2 a0_303;
		Eq_2 a3_308;
		word32 s10_1852;
		word32 s11_1853;
		word32 t4_1854;
		word32 s2_1844;
		word32 s4_1846;
		word32 s5_1847;
		word32 s8_1850;
		word32 s9_1851;
		word32 s7_1849;
		word32 s6_1848;
		word32 s3_1845;
		word32 a1_1839;
		word32 a2_1840;
		word32 a4_1841;
		word32 a5_1842;
		word32 a7_1843;
		word32 s1_1838;
		Eq_2 ra_311 = printf(ra_261, &g_t2307F19C, a3_258, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1838, out a0_303, out a1_1839, out a2_1840, out a3_308, out a4_1841, out a5_1842, out a7_1843, out s2_1844, out s3_1845, out s4_1846, out s5_1847, out s6_1848, out s7_1849, out s8_1850, out s9_1851, out s10_1852, out s11_1853, out t4_1854);
		fdt32_to_cpu(a0_303);
		Eq_2 a3_337;
		Eq_2 a3_363;
		Eq_2 a3_388;
		Eq_2 a3_413;
		Eq_2 a3_438;
		Eq_2 a0_458;
		Eq_2 a3_463;
		word32 t4_1961;
		word32 s11_1960;
		word32 s10_1959;
		word32 s9_1958;
		word32 s8_1957;
		word32 s7_1956;
		word32 s6_1955;
		word32 s5_1954;
		word32 s4_1953;
		word32 s3_1952;
		word32 s2_1951;
		word32 a7_1950;
		word32 a5_1949;
		word32 a4_1948;
		word32 a2_1947;
		word32 a1_1946;
		word32 s1_1945;
		word32 t4_1944;
		word32 s11_1943;
		word32 s10_1942;
		word32 s9_1941;
		word32 s8_1940;
		word32 s7_1939;
		word32 s6_1938;
		word32 s5_1937;
		word32 s4_1936;
		word32 a4_1931;
		word32 a5_1932;
		word32 a7_1933;
		word32 s2_1934;
		word32 s3_1935;
		word32 s9_1923;
		word32 s11_1925;
		word32 t4_1926;
		word32 a1_1929;
		word32 a2_1930;
		word32 a0_1928;
		word32 s1_1927;
		word32 s10_1924;
		word32 s4_1918;
		word32 s5_1919;
		word32 s6_1920;
		word32 s7_1921;
		word32 s8_1922;
		word32 a0_1910;
		word32 a2_1912;
		word32 a4_1913;
		word32 s2_1916;
		word32 s3_1917;
		word32 a7_1915;
		word32 a5_1914;
		word32 a1_1911;
		word32 s9_1905;
		word32 s10_1906;
		word32 s11_1907;
		word32 t4_1908;
		word32 s1_1909;
		word32 s7_1903;
		word32 s8_1904;
		word32 s2_1898;
		word32 s3_1899;
		word32 s4_1900;
		word32 s5_1901;
		word32 s6_1902;
		word32 t4_1890;
		word32 a0_1892;
		word32 a1_1893;
		word32 a5_1896;
		word32 a7_1897;
		word32 a4_1895;
		word32 a2_1894;
		word32 s1_1891;
		word32 s7_1885;
		word32 s8_1886;
		word32 s9_1887;
		word32 s10_1888;
		word32 s11_1889;
		word32 a4_1877;
		word32 a7_1879;
		word32 s2_1880;
		word32 s5_1883;
		word32 s6_1884;
		word32 s4_1882;
		word32 s3_1881;
		word32 a5_1878;
		word32 t4_1872;
		word32 s1_1873;
		word32 a0_1874;
		word32 a1_1875;
		word32 a2_1876;
		word32 s4_1864;
		word32 s6_1866;
		word32 s7_1867;
		word32 s10_1870;
		word32 s11_1871;
		word32 s9_1869;
		word32 s8_1868;
		word32 s5_1865;
		word32 a4_1859;
		word32 a5_1860;
		word32 a7_1861;
		word32 s2_1862;
		word32 s3_1863;
		word32 a1_1857;
		word32 a2_1858;
		word32 s1_1855;
		word32 a0_1856;
		Eq_2 ra_466 = printf(printf(printf(printf(printf(printf(ra_311, &g_t2307F1A8, a3_308, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1855, out a0_1856, out a1_1857, out a2_1858, out a3_337, out a4_1859, out a5_1860, out a7_1861, out s2_1862, out s3_1863, out s4_1864, out s5_1865, out s6_1866, out s7_1867, out s8_1868, out s9_1869, out s10_1870, out s11_1871, out t4_1872), &g_t2307F1BC, a3_337, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1873, out a0_1874, out a1_1875, out a2_1876, out a3_363, out a4_1877, out a5_1878, out a7_1879, out s2_1880, out s3_1881, out s4_1882, out s5_1883, out s6_1884, out s7_1885, out s8_1886, out s9_1887, out s10_1888, out s11_1889, out t4_1890), &g_t2307F1DC, a3_363, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1891, out a0_1892, out a1_1893, out a2_1894, out a3_388, out a4_1895, out a5_1896, out a7_1897, out s2_1898, out s3_1899, out s4_1900, out s5_1901, out s6_1902, out s7_1903, out s8_1904, out s9_1905, out s10_1906, out s11_1907, out t4_1908), &g_t2307F1F8, a3_388, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1909, out a0_1910, out a1_1911, out a2_1912, out a3_413, out a4_1913, out a5_1914, out a7_1915, out s2_1916, out s3_1917, out s4_1918, out s5_1919, out s6_1920, out s7_1921, out s8_1922, out s9_1923, out s10_1924, out s11_1925, out t4_1926), &g_t2307F214, a3_413, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1927, out a0_1928, out a1_1929, out a2_1930, out a3_438, out a4_1931, out a5_1932, out a7_1933, out s2_1934, out s3_1935, out s4_1936, out s5_1937, out s6_1938, out s7_1939, out s8_1940, out s9_1941, out s10_1942, out s11_1943, out t4_1944), &g_t2307F230, a3_438, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1945, out a0_458, out a1_1946, out a2_1947, out a3_463, out a4_1948, out a5_1949, out a7_1950, out s2_1951, out s3_1952, out s4_1953, out s5_1954, out s6_1955, out s7_1956, out s8_1957, out s9_1958, out s10_1959, out s11_1960, out t4_1961);
		Eq_2 s0_1100 = *((word32) a0_458 + 24);
		fdt32_to_cpu(a0_458);
		Eq_2 a0_487;
		up32 s4_501;
		word32 t4_1977;
		word32 s11_1976;
		word32 s10_1975;
		word32 s9_1974;
		word32 s7_1972;
		word32 s8_1973;
		word32 s5_1970;
		word32 s6_1971;
		word32 s2_1968;
		word32 s3_1969;
		word32 a5_1966;
		word32 a7_1967;
		word32 a2_1964;
		word32 a4_1965;
		word32 s1_1962;
		word32 a1_1963;
		Eq_2 a3_492;
		Eq_2 ra_495 = printf(ra_466, &g_t2307F244, a3_463, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1962, out a0_487, out a1_1963, out a2_1964, out a3_492, out a4_1965, out a5_1966, out a7_1967, out s2_1968, out s3_1969, out s4_501, out s5_1970, out s6_1971, out s7_1972, out s8_1973, out s9_1974, out s10_1975, out s11_1976, out t4_1977);
		if (s4_501 > 0x01)
		{
			s0_1100 = *((word32) a0_487 + 28);
			fdt32_to_cpu(a0_487);
			Eq_2 a0_517;
			word32 s4_531;
			word32 s3_1664;
			word32 s9_1669;
			word32 s10_1670;
			word32 s11_1671;
			word32 t4_1672;
			word32 s5_1665;
			word32 s8_1668;
			word32 s7_1667;
			word32 s6_1666;
			word32 a4_1660;
			word32 a5_1661;
			word32 a7_1662;
			word32 s2_1663;
			word32 a2_1659;
			word32 a1_1658;
			word32 s1_1657;
			ra_495 = printf(ra_495, &g_t2307F260, a3_492, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1657, out a0_517, out a1_1658, out a2_1659, out a3_492, out a4_1660, out a5_1661, out a7_1662, out s2_1663, out s3_1664, out s4_531, out s5_1665, out s6_1666, out s7_1667, out s8_1668, out s9_1669, out s10_1670, out s11_1671, out t4_1672);
			if (s4_531 != 0x02)
			{
				s0_1100 = *((word32) a0_517 + 32);
				fdt32_to_cpu(a0_517);
				Eq_2 a0_547;
				up32 s4_561;
				word32 s9_1685;
				word32 a4_1676;
				word32 a5_1677;
				word32 s10_1686;
				word32 t4_1688;
				word32 s11_1687;
				word32 s5_1681;
				word32 s6_1682;
				word32 s7_1683;
				word32 s8_1684;
				word32 a7_1678;
				word32 s3_1680;
				word32 s2_1679;
				word32 s1_1673;
				word32 a1_1674;
				word32 a2_1675;
				ra_495 = printf(ra_495, &g_t2307F27C, a3_492, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1673, out a0_547, out a1_1674, out a2_1675, out a3_492, out a4_1676, out a5_1677, out a7_1678, out s2_1679, out s3_1680, out s4_561, out s5_1681, out s6_1682, out s7_1683, out s8_1684, out s9_1685, out s10_1686, out s11_1687, out t4_1688);
				if (s4_561 > 0x10)
				{
					s0_1100 = *((word32) a0_547 + 36);
					fdt32_to_cpu(a0_547);
					word32 s2_1696;
					word32 s6_1700;
					word32 s7_1701;
					word32 s8_1702;
					word32 s9_1703;
					word32 s10_1704;
					word32 s11_1705;
					word32 t4_1706;
					word32 s3_1697;
					word32 s5_1699;
					word32 s4_1698;
					word32 s1_1689;
					word32 a0_1690;
					word32 a1_1691;
					word32 a2_1692;
					word32 a4_1693;
					word32 a5_1694;
					word32 a7_1695;
					ra_495 = printf(ra_495, &g_t2307F298, a3_492, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1689, out a0_1690, out a1_1691, out a2_1692, out a3_492, out a4_1693, out a5_1694, out a7_1695, out s2_1696, out s3_1697, out s4_1698, out s5_1699, out s6_1700, out s7_1701, out s8_1702, out s9_1703, out s10_1704, out s11_1705, out t4_1706);
				}
			}
		}
		word32 s10_1654;
		word32 s11_1655;
		word32 a4_1644;
		word32 a3_1643;
		word32 s3_1647;
		word32 a7_1646;
		word32 a5_1645;
		word32 s6_1650;
		word32 t4_1656;
		word32 s7_1651;
		word32 s8_1652;
		word32 s9_1653;
		word32 s1_1642;
		word32 s4_1648;
		word32 s5_1649;
		Eq_129199 a0_1062;
		struct Eq_129200 * a1_1065;
		ui32 a2_1066;
		union Eq_2 * s2_1011;
		Eq_2 ra_1014 = printf(ra_495, &g_t230727FC, a3_492, a0_297, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1642, out a0_1062, out a1_1065, out a2_1066, out a3_1643, out a4_1644, out a5_1645, out a7_1646, out s2_1011, out s3_1647, out s4_1648, out s5_1649, out s6_1650, out s7_1651, out s8_1652, out s9_1653, out s10_1654, out s11_1655, out t4_1656);
		word32 s3_1059 = 0x2307F000;
		while (true)
		{
			struct Eq_130139 * s1_634 = a1_1065->ptr0004;
			word32 a3_1758;
			Eq_2 a1_637;
			fdt64_to_cpu(a0_1062, a1_1065, out a1_637, out a3_1758);
			ui32 a1_647;
			Eq_2 a3_1015;
			if ((a2_1066 | fdt64_to_cpu(s1_634->t0008, s1_634->ptr000C, out a1_647, out a3_1015) | (a1_647 | a3_1015)) == 0x00)
				break;
			word32 a3_1745;
			word32 s6_1751;
			word32 s7_1752;
			word32 s8_1753;
			word32 s9_1754;
			word32 s10_1755;
			word32 s11_1756;
			word32 t4_1757;
			word32 a4_1746;
			word32 s4_1749;
			word32 s5_1750;
			word32 a7_1748;
			word32 a5_1747;
			word32 s1_1744;
			ra_1014 = printf(ra_1014, s3_1059 + 692, a3_1015, a1_637, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1744, out a0_1062, out a1_1065, out a2_1066, out a3_1745, out a4_1746, out a5_1747, out a7_1748, out s2_1011, out s3_1059, out s4_1749, out s5_1750, out s6_1751, out s7_1752, out s8_1753, out s9_1754, out s10_1755, out s11_1756, out t4_1757);
		}
		Eq_2 a5_661 = ~0x03 - s0_1100;
		Eq_2 s7_1003 = 0x2307F0C0;
		while (true)
		{
			Eq_2 a0_676 = fdt32_to_cpu(*s2_1011);
			if (a0_676 == 0x09)
				break;
			union Eq_2 * s1_1009;
			Eq_2 a3_704;
			Eq_2 s1_708;
			word32 s11_710;
			struct Eq_130287 * s2_711;
			up32 s4_713;
			word32 s6_715;
			word32 s8_717;
			word32 s10_1800;
			word32 t4_1801;
			word32 a2_1792;
			word32 a5_1794;
			word32 a7_1795;
			word32 s7_1798;
			word32 s9_1799;
			word32 s5_1797;
			word32 s3_1796;
			word32 a4_1793;
			word32 a0_1790;
			word32 a1_1791;
			Eq_2 ra_707 = printf(ra_1014, &g_t2307F2D0, s7_1003, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_708, out a0_1790, out a1_1791, out a2_1792, out a3_704, out a4_1793, out a5_1794, out a7_1795, out s2_711, out s3_1796, out s4_713, out s5_1797, out s6_715, out s7_1798, out s8_717, out s9_1799, out s10_1800, out s11_710, out t4_1801);
			if (s8_717 == 0x01)
			{
				word32 a4_1805;
				word32 a5_1806;
				word32 a1_1802;
				word32 a2_1803;
				word32 a3_1804;
				strlen(s1_708, out a1_1802, out a2_1803, out a3_1804, out a4_1805, out a5_1806);
				(word32) s2_711->t0004 != 0x00;
				union Eq_2 * s8_1004;
				word32 s6_1818;
				word32 s10_1820;
				word32 s11_1821;
				word32 t4_1822;
				word32 s9_1819;
				word32 a7_1813;
				word32 s2_1814;
				word32 s3_1815;
				word32 s4_1816;
				word32 s5_1817;
				word32 s1_1807;
				word32 a0_1808;
				word32 a4_1811;
				word32 a5_1812;
				word32 a2_1810;
				word32 a1_1809;
				ra_1014 = printf(ra_707, &g_t2307F2F0, s1_708, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1807, out a0_1808, out a1_1809, out a2_1810, out a3_1015, out a4_1811, out a5_1812, out a7_1813, out s2_1814, out s3_1815, out s4_1816, out s5_1817, out s6_1818, out s7_1003, out s8_1004, out s9_1819, out s10_1820, out s11_1821, out t4_1822);
				s1_1009 = s8_1004;
				goto l2302A006;
			}
			struct Eq_274 * a0_930;
			if (s8_717 == 0x02)
			{
				a0_930 = (struct Eq_274 *) &g_t2307F2FC;
				goto l2302A036;
			}
			if (s8_717 == 0x04)
			{
				a0_930 = (struct Eq_274 *) &g_t2307F304;
l2302A036:
				word32 s4_1986;
				word32 s5_1987;
				word32 s6_1988;
				word32 s8_1989;
				word32 s9_1990;
				word32 s11_1992;
				word32 s10_1991;
				word32 t4_1993;
				word32 s3_1985;
				word32 s2_1984;
				word32 a7_1983;
				word32 a5_1982;
				word32 a4_1981;
				word32 a2_1980;
				word32 a1_1979;
				word32 a0_1978;
				ra_1014 = printf(ra_707, a0_930, a3_704, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1009, out a0_1978, out a1_1979, out a2_1980, out a3_1015, out a4_1981, out a5_1982, out a7_1983, out s2_1984, out s3_1985, out s4_1986, out s5_1987, out s6_1988, out s7_1003, out s8_1989, out s9_1990, out s10_1991, out s11_1992, out t4_1993);
			}
			else
			{
				if (s8_717 != 0x03)
				{
					if (*(int32 *) ~0x0178 != 0x00)
					{
						word32 a5_1995;
						xTaskGetTickCountFromISR(out a5_1995);
					}
					else
					{
						word32 a5_1994;
						xTaskGetTickCount(out a5_1994);
					}
					word32 s1_1996;
					word32 a0_1997;
					word32 a1_1998;
					word32 a2_1999;
					word32 a4_2000;
					word32 a5_2001;
					word32 s2_2002;
					word32 s3_2003;
					word32 s4_2004;
					word32 s6_2006;
					word32 s5_2005;
					word32 s8_2008;
					word32 s7_2007;
					word32 s10_2010;
					word32 s9_2009;
					word32 s11_2011;
					ra_1014 = bl_printk(ra_707, &g_t2307F314, s6_715 + 0x00F8, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1996, out a0_1997, out a1_1998, out a2_1999, out a3_1015, out a4_2000, out a5_2001, out s2_2002, out s3_2003, out s4_2004, out s5_2005, out s6_2006, out s7_2007, out s8_2008, out s9_2009, out s10_2010, out s11_2011);
					break;
				}
				Eq_2 a0_729 = fdt32_to_cpu(s2_711->t0004);
				Eq_2 a3_741 = (word32) s0_1100 + ((word32) fdt32_to_cpu(s2_711->t0008) + s11_710);
				Eq_2 a3_757;
				word32 s1_2012;
				Eq_2 a3_783;
				Eq_2 s2_817;
				struct Eq_129268 * s8_823;
				int32 s9_824;
				Eq_2 a3_832;
				word32 a1_2014;
				word32 a0_2013;
				word32 a4_2016;
				word32 a2_2015;
				word32 a5_2017;
				word32 a7_2018;
				word32 s2_2019;
				word32 s3_2020;
				word32 s4_2021;
				word32 s5_2022;
				word32 s6_2023;
				word32 s7_2024;
				word32 s8_2025;
				word32 s9_2026;
				word32 s10_2027;
				word32 s11_2028;
				word32 t4_2029;
				word32 s1_2030;
				word32 a0_2031;
				word32 a1_2032;
				word32 a2_2033;
				word32 a4_2034;
				word32 a5_2035;
				word32 a7_2036;
				word32 s2_2037;
				word32 s3_2038;
				word32 s4_2039;
				word32 s5_2040;
				word32 s6_2041;
				word32 s7_2042;
				word32 s8_2043;
				word32 s9_2044;
				word32 s10_2045;
				word32 s11_2046;
				word32 t4_2047;
				word32 s1_2048;
				word32 a0_2049;
				word32 a1_2050;
				word32 a2_2051;
				word32 a3_2052;
				word32 a4_2053;
				word32 a5_2054;
				word32 a7_2055;
				word32 s3_2056;
				word32 s4_2057;
				word32 s5_2058;
				word32 s6_2059;
				word32 s7_2060;
				word32 s10_2061;
				word32 s11_2062;
				word32 t4_2063;
				word32 a0_2064;
				word32 a1_2065;
				word32 a2_2066;
				word32 a4_2067;
				word32 a5_2068;
				word32 a7_2069;
				word32 s2_2070;
				word32 s3_2071;
				word32 s4_2072;
				word32 s5_2073;
				word32 s6_2074;
				word32 s8_2075;
				word32 s9_2076;
				word32 s10_2077;
				word32 s11_2078;
				word32 t4_2079;
				ra_1014 = printf(utilfdt_print_data(printf(printf(printf(ra_707, &g_t2307F344, a3_741, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_2012, out a0_2013, out a1_2014, out a2_2015, out a3_757, out a4_2016, out a5_2017, out a7_2018, out s2_2019, out s3_2020, out s4_2021, out s5_2022, out s6_2023, out s7_2024, out s8_2025, out s9_2026, out s10_2027, out s11_2028, out t4_2029), &g_t2307F35C, a3_757, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_2030, out a0_2031, out a1_2032, out a2_2033, out a3_783, out a4_2034, out a5_2035, out a7_2036, out s2_2037, out s3_2038, out s4_2039, out s5_2040, out s6_2041, out s7_2042, out s8_2043, out s9_2044, out s10_2045, out s11_2046, out t4_2047), &g_t2307F370, a3_783, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_2048, out a0_2049, out a1_2050, out a2_2051, out a3_2052, out a4_2053, out a5_2054, out a7_2055, out s2_817, out s3_2056, out s4_2057, out s5_2058, out s6_2059, out s7_2060, out s8_823, out s9_824, out s10_2061, out s11_2062, out t4_2063), s8_823, s9_824, s2_817, a5_661, s2, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg18, s9, s7, s1, dwArg5C, out s0_1100, out a3_832), &g_t2307F1A4, a3_832, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1009, out a0_2064, out a1_2065, out a2_2066, out a3_1015, out a4_2067, out a5_2068, out a7_2069, out s2_2070, out s3_2071, out s4_2072, out s5_2073, out s6_2074, out s7_1003, out s8_2075, out s9_2076, out s10_2077, out s11_2078, out t4_2079);
			}
l2302A006:
			s2_1011 = s1_1009;
		}
		word32 s1_1771;
		word32 a1_1773;
		word32 a3_1775;
		word32 a5_1777;
		word32 s10_1787;
		word32 s11_1788;
		word32 t4_1789;
		word32 s2_1779;
		word32 s4_1781;
		word32 s5_1782;
		word32 s8_1785;
		word32 s9_1786;
		word32 s7_1784;
		word32 s6_1783;
		word32 s3_1780;
		word32 a7_1778;
		word32 a4_1776;
		word32 a2_1774;
		word32 a0_1772;
		printf(ra_1014, &g_t2307F378, a3_1015, a5_661, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1771, out a0_1772, out a1_1773, out a2_1774, out a3_1775, out a4_1776, out a5_1777, out a7_1778, out s2_1779, out s3_1780, out s4_1781, out s5_1782, out s6_1783, out s7_1784, out s8_1785, out s9_1786, out s10_1787, out s11_1788, out t4_1789);
	}
	else
	{
l23029ED2:
		if (g_t4200DE84 == 0x00)
		{
			word32 a5_1708;
			xTaskGetTickCount(out a5_1708);
		}
		else
		{
			word32 a5_1707;
			xTaskGetTickCountFromISR(out a5_1707);
		}
		Eq_2 a3_156;
		word32 t4_1743;
		word32 s10_1741;
		word32 s8_1739;
		word32 s6_1737;
		word32 s4_1735;
		word32 s2_1733;
		word32 a3_1729;
		word32 s5_1718;
		word32 s11_1742;
		word32 s9_1740;
		word32 s7_1738;
		word32 s5_1736;
		word32 s3_1734;
		word32 a4_1730;
		word32 a7_1732;
		word32 a5_1731;
		word32 s9_1722;
		word32 s10_1723;
		word32 s11_1724;
		word32 s1_1725;
		word32 a0_1726;
		word32 a1_1727;
		word32 a2_1728;
		word32 s6_1719;
		word32 s8_1721;
		word32 s7_1720;
		word32 a1_1711;
		word32 a2_1712;
		word32 a4_1713;
		word32 a5_1714;
		word32 s2_1715;
		word32 s3_1716;
		word32 s4_1717;
		word32 a0_1710;
		word32 s1_1709;
		printf(bl_printk(ra, &g_t2307F108, 0x2307F0F8, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1709, out a0_1710, out a1_1711, out a2_1712, out a3_156, out a4_1713, out a5_1714, out s2_1715, out s3_1716, out s4_1717, out s5_1718, out s6_1719, out s7_1720, out s8_1721, out s9_1722, out s10_1723, out s11_1724), &g_t2307F13C, a3_156, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1725, out a0_1726, out a1_1727, out a2_1728, out a3_1729, out a4_1730, out a5_1731, out a7_1732, out s2_1733, out s3_1734, out s4_1735, out s5_1736, out s6_1737, out s7_1738, out s8_1739, out s9_1740, out s10_1741, out s11_1742, out t4_1743);
	}
}

