pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302A14C: Register word32 tc_fdt_wifi_module(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register out ptr32 a3Out)
// Called from:
//      tc_fdt_wifi
word32 tc_fdt_wifi_module(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 & a3Out)
{
	ptr32 a3_1573;
	word32 a0_1595;
	struct Eq_274 * a0_1020;
	Eq_2 a3_1018;
	int32 a0_34;
	word32 s0_43;
	Eq_2 s1_44;
	Eq_2 s2_45;
	Eq_2 s6_49;
	word32 s3_2963;
	word32 a5_2962;
	word32 s4_2964;
	word32 s5_2965;
	Eq_2 ra_1034 = fdt_subnode_offset(ra, s1, 587723660, 0x23072C3C, s2, s6, dwLoc0138, dwLoc0108, dwLoc58, out s0_43, out s1_44, out a0_34, out a5_2962, out s2_45, out s3_2963, out s4_2964, out s5_2965, out s6_49);
	if (a0_34 <= 0x00)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2971;
			xTaskGetTickCountFromISR(out a5_2971);
		}
		else
		{
			word32 a5_2970;
			xTaskGetTickCount(out a5_2970);
		}
		a3_1018.u0 = 587728552;
		a0_1020 = (struct Eq_274 *) &g_t230806B8;
		goto l2302A1C6;
	}
	int32 a0_59;
	word32 s3_2967;
	word32 a5_2966;
	word32 s5_2969;
	word32 s4_2968;
	word32 s0_177;
	Eq_2 s2_163;
	Eq_2 s1_160;
	Eq_2 s6_167;
	Eq_2 ra_159 = fdt_subnode_offset(ra_1034, s1_44, s0_43 + 908, 0x230806D8, s2_45, s6_49, dwLoc0138, dwLoc0108, dwLoc58, out s0_177, out s1_160, out a0_59, out a5_2966, out s2_163, out s3_2967, out s4_2968, out s5_2969, out s6_167);
	if (a0_59 > 0x00)
	{
		word32 a0_84;
		word32 s1_2976;
		word32 a1_2977;
		word32 s3_2982;
		word32 s4_2983;
		word32 s2_2981;
		word32 a5_2980;
		word32 a3_2978;
		word32 a4_2979;
		word32 s8_2986;
		word32 s6_2985;
		word32 s5_2984;
		ra_1034 = fdt_getprop(ra_159, s0_177 + 908, 0x230806E0, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_177, out s1_2976, out a0_84, out a1_2977, out a3_2978, out a4_2979, out a5_2980, out s2_2981, out s3_2982, out s4_2983, out s5_2984, out s6_2985, out s8_2986);
		Eq_2 a5_107 = g_t4200DE84;
		if (a0_84 == 0x00)
		{
			if (a5_107 != 0x00)
			{
				word32 a5_3004;
				xTaskGetTickCountFromISR(out a5_3004);
			}
			else
			{
				word32 a5_3003;
				xTaskGetTickCount(out a5_3003);
			}
			a3_1018.u0 = 587728552;
			a0_1020 = (struct Eq_274 *) &g_t23080720;
			goto l2302A1C6;
		}
		if (a5_107 != 0x00)
		{
			word32 a5_2988;
			xTaskGetTickCountFromISR(out a5_2988);
		}
		else
		{
			word32 a5_2987;
			xTaskGetTickCount(out a5_2987);
		}
		word32 a5_2994;
		word32 s5_2997;
		word32 s8_2999;
		word32 a0_2989;
		word32 a2_2991;
		word32 a1_2990;
		word32 s4_2996;
		word32 s7_2998;
		word32 s3_2995;
		word32 a4_2993;
		word32 s10_3001;
		word32 a3_2992;
		word32 s9_3000;
		word32 s11_3002;
		ra_159 = bl_printk(ra_1034, &g_t230806F0, 587728552, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_160, out a0_2989, out a1_2990, out a2_2991, out a3_2992, out a4_2993, out a5_2994, out s2_163, out s3_2995, out s4_2996, out s5_2997, out s6_167, out s7_2998, out s8_2999, out s9_3000, out s10_3001, out s11_3002);
	}
	int32 a0_186;
	word32 a5_2972;
	word32 s5_2975;
	word32 s4_2974;
	word32 s3_2973;
	word32 s0_195;
	Eq_2 s2_197;
	Eq_2 s1_196;
	Eq_2 s6_201;
	Eq_2 ra_194 = fdt_subnode_offset(ra_159, s1_160, s0_177 + 908, 587728712, s2_163, s6_167, dwLoc0138, dwLoc0108, dwLoc58, out s0_195, out s1_196, out a0_186, out a5_2972, out s2_197, out s3_2973, out s4_2974, out s5_2975, out s6_201);
	if (a0_186 > 0x00)
	{
		Eq_2 a0_212;
		word32 a4_216;
		word32 s4_3035;
		word32 s1_3029;
		word32 a5_3032;
		word32 a1_3030;
		word32 s2_3033;
		word32 a3_3031;
		word32 s0_3028;
		word32 s3_3034;
		word32 s8_3038;
		word32 s6_3037;
		word32 s5_3036;
		ra_1034 = fdt_getprop(ra_194, s0_195 + 908, 587728716, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3028, out s1_3029, out a0_212, out a1_3030, out a3_3031, out a4_216, out a5_3032, out s2_3033, out s3_3034, out s4_3035, out s5_3036, out s6_3037, out s8_3038);
		if (a4_216 != 0x06)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3115;
				xTaskGetTickCountFromISR(out a5_3115);
			}
			else
			{
				word32 a5_3114;
				xTaskGetTickCount(out a5_3114);
			}
			a3_1018.u0 = 587728552;
			a0_1020 = (struct Eq_274 *) &g_t23080788;
			goto l2302A1C6;
		}
		word32 a1_3039;
		word32 a2_3040;
		word32 a3_3041;
		word32 a4_3042;
		word32 a6_3044;
		word32 a5_3043;
		word32 a7_3045;
		memcpy(fp + -304, a0_212, 0x06, out a1_3039, out a2_3040, out a3_3041, out a4_3042, out a5_3043, out a6_3044, out a7_3045);
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3047;
			xTaskGetTickCountFromISR(out a5_3047);
		}
		else
		{
			word32 a5_3046;
			xTaskGetTickCount(out a5_3046);
		}
		Eq_2 s5_298;
		Eq_2 s6_299;
		word32 s0_319;
		Eq_2 a0_340;
		word32 a4_344;
		struct Eq_131407 * s4_353;
		word32 s9_3107;
		word32 a3_3109;
		word32 s3_3111;
		word32 s8_3113;
		word32 s5_3112;
		word32 a5_3110;
		word32 a1_3108;
		word32 s8_3106;
		word32 s5_3103;
		word32 s6_3104;
		word32 s7_3105;
		word32 a3_3097;
		word32 a5_3099;
		word32 s2_3100;
		word32 s3_3101;
		word32 s4_3102;
		word32 a4_3098;
		word32 s3_3089;
		word32 s4_3090;
		word32 s7_3091;
		word32 s8_3092;
		word32 s10_3094;
		word32 s11_3095;
		word32 s1_3096;
		word32 s9_3093;
		word32 a1_3083;
		word32 a2_3084;
		word32 a3_3085;
		word32 a4_3086;
		word32 s2_3088;
		word32 a5_3087;
		word32 s1_3081;
		word32 a0_3082;
		ra_194 = fdt_getprop(log_buf_out(bl_printk(ra_1034, &g_t2308075C, 587728552, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3081, out a0_3082, out a1_3083, out a2_3084, out a3_3085, out a4_3086, out a5_3087, out s2_3088, out s3_3089, out s4_3090, out s5_298, out s6_299, out s7_3091, out s8_3092, out s9_3093, out s10_3094, out s11_3095), fp + -304, 0x06, 0x00, s5_298, s6_299, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_319, out s1_3096, out a3_3097, out a4_3098, out a5_3099, out s2_3100, out s3_3101, out s4_3102, out s5_3103, out s6_3104, out s7_3105, out s8_3106, out s9_3107), s0_319 + 908, 587728764, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_195, out s1_196, out a0_340, out a1_3108, out a3_3109, out a4_344, out a5_3110, out s2_197, out s3_3111, out s4_353, out s5_3112, out s6_201, out s8_3113);
		if (a4_344 == 0x06)
		{
			word32 a6_3053;
			word32 a5_3052;
			word32 a4_3051;
			word32 a3_3050;
			word32 a2_3049;
			word32 a1_3048;
			word32 a7_3054;
			memcpy(fp + -304, a0_340, 0x06, out a1_3048, out a2_3049, out a3_3050, out a4_3051, out a5_3052, out a6_3053, out a7_3054);
			if (s4_353->dwFFFFFE84 != 0x00)
			{
				word32 a5_3056;
				xTaskGetTickCountFromISR(out a5_3056);
			}
			else
			{
				word32 a5_3055;
				xTaskGetTickCount(out a5_3055);
			}
			Eq_2 s5_410;
			Eq_2 s6_411;
			word32 a0_3058;
			word32 a1_3059;
			word32 a2_3060;
			word32 a4_3062;
			word32 s4_3066;
			word32 s8_3068;
			word32 s11_3071;
			word32 s9_3069;
			word32 s10_3070;
			word32 a4_3073;
			word32 s9_3080;
			word32 s7_3078;
			word32 s8_3079;
			word32 s5_3077;
			word32 s4_3076;
			word32 s3_3075;
			word32 a5_3074;
			word32 a3_3072;
			word32 s1_3057;
			word32 a3_3061;
			word32 a5_3063;
			word32 s3_3065;
			word32 s2_3064;
			word32 s7_3067;
			ra_194 = log_buf_out(bl_printk(ra_194, &g_t230807B0, (word32) s1_196 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3057, out a0_3058, out a1_3059, out a2_3060, out a3_3061, out a4_3062, out a5_3063, out s2_3064, out s3_3065, out s4_3066, out s5_410, out s6_411, out s7_3067, out s8_3068, out s9_3069, out s10_3070, out s11_3071), fp + -304, 0x06, 0x00, s5_410, s6_411, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_195, out s1_196, out a3_3072, out a4_3073, out a5_3074, out s2_197, out s3_3075, out s4_3076, out s5_3077, out s6_201, out s7_3078, out s8_3079, out s9_3080);
		}
	}
	int32 a0_459;
	word32 s0_468;
	word32 s1_3021;
	word32 s2_3023;
	word32 a5_3022;
	word32 s4_3025;
	word32 s3_3024;
	word32 s5_3026;
	word32 s6_3027;
	ra_1034 = fdt_subnode_offset(ra_194, s1_196, s0_195 + 908, 587728848, s2_197, s6_201, dwLoc0138, dwLoc0108, dwLoc58, out s0_468, out s1_3021, out a0_459, out a5_3022, out s2_3023, out s3_3024, out s4_3025, out s5_3026, out s6_3027);
	if (a0_459 > 0x00)
	{
		int32 a0_491;
		word32 s8_3121;
		word32 s5_3119;
		word32 s6_3120;
		word32 s4_3118;
		word32 s1_3116;
		word32 s3_3117;
		word32 s0_500;
		word32 s2_1780;
		ra_1034 = fdt_stringlist_count(ra_1034, s0_468 + 908, 587669860, 0x23072000, dwLoc0138, dwLoc011C, dwLoc88, dwLoc58, out s0_500, out s1_3116, out a0_491, out s2_1780, out s3_3117, out s4_3118, out s5_3119, out s6_3120, out s8_3121);
		if (a0_491 > 0x00)
		{
			word32 s7_1781 = 0x23080000;
			word32 s9_1782 = 0x23080000;
			do
			{
				int32 a5_551;
				struct Eq_131676 * s6_561;
				word32 a1_3127;
				word32 a2_3128;
				word32 a3_3129;
				word32 a4_3130;
				word32 s5_3132;
				word32 s8_3133;
				word32 s3_3131;
				word32 a0_3126;
				word32 s1_556;
				word32 s4_559;
				ra_1034 = fdt_stringlist_get(ra_1034, s0_500 + 908, s2_1780 + 356, dwLoc012C, dwLoc98, dwLoc68, s4, out s0_500, out s1_556, out a0_3126, out a1_3127, out a2_3128, out a3_3129, out a4_3130, out a5_551, out s2_1780, out s3_3131, out s4_559, out s5_3132, out s6_561, out s8_3133);
				if (a5_551 > 0x00)
				{
					if (s6_561->dwFFFFFE84 != 0x00)
					{
						word32 a5_3123;
						xTaskGetTickCountFromISR(out a5_3123);
					}
					else
					{
						word32 a5_3122;
						xTaskGetTickCount(out a5_3122);
					}
					word32 a3_3145;
					word32 a5_3147;
					word32 s5_3149;
					word32 s11_3153;
					word32 s10_3152;
					word32 s8_3151;
					word32 s6_3150;
					word32 s3_3148;
					word32 a4_3146;
					word32 a2_3144;
					word32 a0_3142;
					word32 a1_3143;
					ra_1034 = bl_printk(ra_1034, s9_1782 + 2004, s7_1781 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_556, out a0_3142, out a1_3143, out a2_3144, out a3_3145, out a4_3146, out a5_3147, out s2_1780, out s3_3148, out s4_559, out s5_3149, out s6_3150, out s7_1781, out s8_3151, out s9_1782, out s10_3152, out s11_3153);
				}
			} while (s4_559 != s1_556 + 0x01);
			int32 a0_627;
			word32 s3_3135;
			word32 s5_3137;
			word32 s6_3138;
			word32 s8_3139;
			word32 s4_3136;
			word32 s1_3134;
			word32 s0_636;
			word32 s2_1783;
			ra_1034 = fdt_stringlist_count(ra_1034, s0_500 + 908, 0x2308082C, 0x23081000, dwLoc0138, dwLoc011C, dwLoc88, dwLoc58, out s0_636, out s1_3134, out a0_627, out s2_1783, out s3_3135, out s4_3136, out s5_3137, out s6_3138, out s8_3139);
			if (a0_627 > 0x00)
			{
				word32 s7_1784 = 0x23080000;
				word32 s9_1785 = 0x23081000;
				do
				{
					int32 a5_685;
					struct Eq_131774 * s6_695;
					word32 s3_3159;
					word32 s5_3160;
					word32 s8_3161;
					word32 a3_3157;
					word32 a4_3158;
					word32 a2_3156;
					word32 a0_3154;
					word32 a1_3155;
					word32 s1_690;
					word32 s4_693;
					ra_1034 = fdt_stringlist_get(ra_1034, s0_636 + 908, s2_1783 + -2004, dwLoc012C, dwLoc98, dwLoc68, s4, out s0_636, out s1_690, out a0_3154, out a1_3155, out a2_3156, out a3_3157, out a4_3158, out a5_685, out s2_1783, out s3_3159, out s4_693, out s5_3160, out s6_695, out s8_3161);
					if (a5_685 > 0x00)
					{
						if (s6_695->dwFFFFFE84 != 0x00)
						{
							word32 a5_3141;
							xTaskGetTickCountFromISR(out a5_3141);
						}
						else
						{
							word32 a5_3140;
							xTaskGetTickCount(out a5_3140);
						}
						word32 s3_3183;
						word32 s6_3185;
						word32 s10_3187;
						word32 s11_3188;
						word32 s8_3186;
						word32 s5_3184;
						word32 a5_3182;
						word32 a2_3179;
						word32 a3_3180;
						word32 a4_3181;
						word32 a0_3177;
						word32 a1_3178;
						ra_1034 = bl_printk(ra_1034, s9_1785 + -2000, s7_1784 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_690, out a0_3177, out a1_3178, out a2_3179, out a3_3180, out a4_3181, out a5_3182, out s2_1783, out s3_3183, out s4_693, out s5_3184, out s6_3185, out s7_1784, out s8_3186, out s9_1785, out s10_3187, out s11_3188);
					}
				} while (s4_693 != s1_690 + 0x01);
				word32 a0_762;
				word32 s0_771;
				word32 a4_3165;
				word32 a5_3166;
				word32 s2_3167;
				word32 s3_3168;
				word32 s5_3170;
				word32 s6_3171;
				word32 s8_3172;
				word32 s4_3169;
				word32 s1_3162;
				word32 a3_3164;
				word32 a1_3163;
				ra_1034 = fdt_getprop(ra_1034, s0_636 + 908, 0x23080888, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_771, out s1_3162, out a0_762, out a1_3163, out a3_3164, out a4_3165, out a5_3166, out s2_3167, out s3_3168, out s4_3169, out s5_3170, out s6_3171, out s8_3172);
				Eq_2 a5_785 = g_t4200DE84;
				if (a0_762 != 0x00)
				{
					if (a5_785 != 0x00)
					{
						word32 a5_3174;
						xTaskGetTickCountFromISR(out a5_3174);
					}
					else
					{
						word32 a5_3173;
						xTaskGetTickCount(out a5_3173);
					}
					word32 s7_1786 = 0x23081000;
					Eq_2 s2_840;
					int32 a0_855;
					word32 s1_865;
					struct Eq_131902 * s2_866;
					word32 s7_3253;
					word32 s9_3255;
					word32 s11_3257;
					word32 s8_3262;
					word32 s6_3261;
					word32 s5_3260;
					word32 s4_3259;
					word32 s3_3258;
					word32 s10_3256;
					word32 s8_3254;
					word32 s6_3252;
					word32 s3_3249;
					word32 s4_3250;
					word32 s5_3251;
					word32 a0_3243;
					word32 a2_3245;
					word32 a3_3246;
					word32 a4_3247;
					word32 a5_3248;
					word32 a1_3244;
					word32 s1_3242;
					word32 s0_864;
					ra_1034 = fdt_stringlist_count(bl_printk(ra_1034, &g_t23080894, 587728552, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3242, out a0_3243, out a1_3244, out a2_3245, out a3_3246, out a4_3247, out a5_3248, out s2_840, out s3_3249, out s4_3250, out s5_3251, out s6_3252, out s7_3253, out s8_3254, out s9_3255, out s10_3256, out s11_3257), s0_771 + 908, 0x230808BC, s2_840, dwLoc0138, dwLoc011C, dwLoc88, dwLoc58, out s0_864, out s1_865, out a0_855, out s2_866, out s3_3258, out s4_3259, out s5_3260, out s6_3261, out s8_3262);
					if (a0_855 > 0x00)
					{
						word32 s9_1788 = 0x23081000;
						do
						{
							int32 a5_909;
							word32 a3_3203;
							word32 a4_3204;
							word32 s3_3205;
							word32 s4_3206;
							word32 s5_3207;
							word32 a0_3200;
							word32 a2_3202;
							word32 a1_3201;
							word32 s6_919;
							Eq_2 s8_920;
							Eq_2 s2_915;
							Eq_2 s1_914;
							ra_1034 = fdt_stringlist_get(ra_1034, s0_864 + 908, s7_1786 + -0x0744, dwLoc012C, dwLoc98, dwLoc68, s4, out s0_864, out s1_914, out a0_3200, out a1_3201, out a2_3202, out a3_3203, out a4_3204, out a5_909, out s2_915, out s3_3205, out s4_3206, out s5_3207, out s6_919, out s8_920);
							if (a5_909 > 0x00)
							{
								if (*((word32) s2_915 - 380) != 0x00)
								{
									word32 a5_3176;
									xTaskGetTickCountFromISR(out a5_3176);
								}
								else
								{
									word32 a5_3175;
									xTaskGetTickCount(out a5_3175);
								}
								word32 s5_3197;
								word32 s10_3198;
								word32 s11_3199;
								word32 s3_3195;
								word32 s4_3196;
								word32 a5_3194;
								word32 a3_3192;
								word32 a4_3193;
								word32 a2_3191;
								word32 a1_3190;
								word32 a0_3189;
								ra_1034 = bl_printk(ra_1034, s9_1788 + -1800, (word32) s1_914 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_914, out a0_3189, out a1_3190, out a2_3191, out a3_3192, out a4_3193, out a5_3194, out s2_915, out s3_3195, out s4_3196, out s5_3197, out s6_919, out s7_1786, out s8_920, out s9_1788, out s10_3198, out s11_3199);
							}
							Eq_2 s6_972 = s6_919 + 0x01;
						} while (s8_920 != s6_972);
						int32 a0_986;
						word32 s0_995;
						word32 s1_996;
						struct Eq_132036 * s2_997;
						word32 s5_3211;
						word32 s6_3212;
						word32 a5_3208;
						word32 s3_3209;
						word32 s4_3210;
						ra_1034 = fdt_subnode_offset(ra_1034, s1_914, s0_864 + 908, 0x23080968, s2_915, s6_972, dwLoc0138, dwLoc0108, dwLoc58, out s0_995, out s1_996, out a0_986, out a5_3208, out s2_997, out s3_3209, out s4_3210, out s5_3211, out s6_3212);
						if (a0_986 > 0x00)
						{
							Eq_2 a0_1026;
							word32 a4_1030;
							word32 s1_1036;
							struct Eq_132066 * s2_1037;
							word32 s8_3221;
							word32 s6_3220;
							word32 s3_3217;
							word32 s4_3218;
							word32 s5_3219;
							word32 s0_3213;
							word32 a1_3214;
							word32 a3_3215;
							word32 a5_3216;
							ra_1034 = fdt_getprop(ra_1034, s0_995 + 908, 0x23080970, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3213, out s1_1036, out a0_1026, out a1_3214, out a3_3215, out a4_1030, out a5_3216, out s2_1037, out s3_3217, out s4_3218, out s5_3219, out s6_3220, out s8_3221);
							if (a4_1030 == 0x14)
							{
								word32 a7_3228;
								word32 a6_3227;
								word32 a3_3224;
								word32 a4_3225;
								word32 a5_3226;
								word32 a2_3223;
								word32 a1_3222;
								memcpy(fp + -304, a0_1026, 0x14, out a1_3222, out a2_3223, out a3_3224, out a4_3225, out a5_3226, out a6_3227, out a7_3228);
								if (s2_1037->dwFFFFFE84 != 0x00)
								{
									word32 a5_3230;
									xTaskGetTickCountFromISR(out a5_3230);
								}
								else
								{
									word32 a5_3229;
									xTaskGetTickCount(out a5_3229);
								}
								Eq_2 s5_1110;
								Eq_2 s6_1111;
								word32 s0_1131;
								Eq_2 a0_1152;
								int32 a4_1156;
								word32 s1_1162;
								struct Eq_132153 * s2_1163;
								word32 a0_3291;
								word32 a2_3293;
								word32 a4_3295;
								word32 s8_3325;
								word32 a3_3319;
								word32 s3_3321;
								word32 s4_3322;
								word32 s5_3323;
								word32 s6_3324;
								word32 a5_3320;
								word32 s4_3311;
								word32 s5_3312;
								word32 s6_3313;
								word32 s7_3314;
								word32 s9_3316;
								word32 s0_3317;
								word32 a1_3318;
								word32 s8_3315;
								word32 s1_3305;
								word32 a3_3306;
								word32 a4_3307;
								word32 a5_3308;
								word32 s3_3310;
								word32 s2_3309;
								word32 s10_3303;
								word32 s11_3304;
								word32 s9_3302;
								word32 s7_3300;
								word32 s8_3301;
								word32 s4_3299;
								word32 s3_3298;
								word32 s2_3297;
								word32 a5_3296;
								word32 a3_3294;
								word32 a1_3292;
								word32 s1_3290;
								Eq_2 ra_1160 = fdt_getprop(log_buf_out(bl_printk(ra_1034, &g_t23080978, s1_1036 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3290, out a0_3291, out a1_3292, out a2_3293, out a3_3294, out a4_3295, out a5_3296, out s2_3297, out s3_3298, out s4_3299, out s5_1110, out s6_1111, out s7_3300, out s8_3301, out s9_3302, out s10_3303, out s11_3304), fp + -304, 0x14, 0x00, s5_1110, s6_1111, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_1131, out s1_3305, out a3_3306, out a4_3307, out a5_3308, out s2_3309, out s3_3310, out s4_3311, out s5_3312, out s6_3313, out s7_3314, out s8_3315, out s9_3316), s0_1131 + 908, 0x23080994, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3317, out s1_1162, out a0_1152, out a1_3318, out a3_3319, out a4_1156, out a5_3320, out s2_1163, out s3_3321, out s4_3322, out s5_3323, out s6_3324, out s8_3325);
								if (a4_1156 != 0x0100)
								{
									if (s2_1163->dwFFFFFE84 != 0x00)
									{
										word32 a5_3239;
										xTaskGetTickCountFromISR(out a5_3239);
									}
									else
									{
										word32 a5_3238;
										xTaskGetTickCount(out a5_3238);
									}
									word32 s6_3273;
									word32 s7_3274;
									word32 s8_3275;
									word32 s9_3276;
									word32 s11_3278;
									word32 s10_3277;
									word32 a4_3267;
									word32 a5_3268;
									word32 s2_3269;
									word32 s3_3270;
									word32 s5_3272;
									word32 s4_3271;
									word32 a1_3265;
									word32 a2_3266;
									word32 a0_3264;
									word32 s1_3263;
									bl_printk(ra_1160, &g_t230809F8, s1_1162 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3263, out a0_3264, out a1_3265, out a2_3266, out a3_1573, out a4_3267, out a5_3268, out s2_3269, out s3_3270, out s4_3271, out s5_3272, out s6_3273, out s7_3274, out s8_3275, out s9_3276, out s10_3277, out s11_3278);
l2302A5D0:
									a0_1595 = ~0x00;
									goto l2302A956;
								}
								word32 a4_3234;
								word32 a5_3235;
								word32 a6_3236;
								word32 a7_3237;
								word32 a2_3232;
								word32 a3_3233;
								word32 a1_3231;
								memcpy(fp + -304, a0_1152, 0x0100, out a1_3231, out a2_3232, out a3_3233, out a4_3234, out a5_3235, out a6_3236, out a7_3237);
								if (s2_1163->dwFFFFFE84 != 0x00)
								{
									word32 a5_3280;
									xTaskGetTickCountFromISR(out a5_3280);
								}
								else
								{
									word32 a5_3279;
									xTaskGetTickCount(out a5_3279);
								}
								Eq_2 s5_1222;
								Eq_2 s6_1223;
								word32 s0_1243;
								Eq_2 a0_1264;
								int32 a4_1268;
								word32 s1_1274;
								struct Eq_132313 * s2_1275;
								word32 a5_3367;
								word32 s4_3369;
								word32 s6_3371;
								word32 s8_3372;
								word32 s5_3370;
								word32 s3_3368;
								word32 a3_3366;
								word32 s9_3363;
								word32 s0_3364;
								word32 a1_3365;
								word32 s3_3357;
								word32 s5_3359;
								word32 s6_3360;
								word32 s7_3361;
								word32 s8_3362;
								word32 s4_3358;
								word32 s9_3349;
								word32 s10_3350;
								word32 s11_3351;
								word32 s1_3352;
								word32 a4_3354;
								word32 a5_3355;
								word32 s2_3356;
								word32 a3_3353;
								word32 a5_3343;
								word32 s2_3344;
								word32 s3_3345;
								word32 s4_3346;
								word32 s8_3348;
								word32 s7_3347;
								word32 a3_3341;
								word32 a4_3342;
								word32 a2_3340;
								word32 a0_3338;
								word32 a1_3339;
								word32 s1_3337;
								ra_1034 = fdt_getprop(log_buf_out(bl_printk(ra_1160, &g_t230809C0, s1_1162 + 0x06A8, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3337, out a0_3338, out a1_3339, out a2_3340, out a3_3341, out a4_3342, out a5_3343, out s2_3344, out s3_3345, out s4_3346, out s5_1222, out s6_1223, out s7_3347, out s8_3348, out s9_3349, out s10_3350, out s11_3351), fp + -304, 0x0100, 0x00, s5_1222, s6_1223, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_1243, out s1_3352, out a3_3353, out a4_3354, out a5_3355, out s2_3356, out s3_3357, out s4_3358, out s5_3359, out s6_3360, out s7_3361, out s8_3362, out s9_3363), s0_1243 + 908, 0x230809E4, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3364, out s1_1274, out a0_1264, out a1_3365, out a3_3366, out a4_1268, out a5_3367, out s2_1275, out s3_3368, out s4_3369, out s5_3370, out s6_3371, out s8_3372);
								if (a4_1268 != 60)
								{
									if (s2_1275->dwFFFFFE84 != 0x00)
									{
										word32 a5_3289;
										xTaskGetTickCountFromISR(out a5_3289);
									}
									else
									{
										word32 a5_3288;
										xTaskGetTickCount(out a5_3288);
									}
									a3_1018 = s1_1274 + 0x06A8;
									a0_1020 = (struct Eq_274 *) &g_t23080A6C;
								}
								else
								{
									word32 a7_3287;
									word32 a1_3281;
									word32 a3_3283;
									word32 a4_3284;
									word32 a5_3285;
