pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302AD18: Register Eq_2 blog_init(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bfl_main
Eq_2 blog_init(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	union Eq_133892 * a2_15;
	word32 s11_157;
	word32 s8_154;
	word32 s9_155;
	word32 s10_156;
	word32 s5_151;
	word32 s6_152;
	word32 s7_153;
	word32 s2_148;
	word32 s3_149;
	word32 s4_150;
	word32 a3_145;
	word32 a4_146;
	word32 a5_147;
	word32 s1_142;
	word32 a0_143;
	word32 a1_144;
	Eq_2 ra_19 = bl_printk(ra, &g_t23080B74, 0x02, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_142, out a0_143, out a1_144, out a2_15, out a3_145, out a4_146, out a5_147, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_156, out s11_157);
	up32 a5_35 = 587785268;
	while (a5_35 < 587785396)
	{
		a5_35 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_133892 *) 0x02;
	}
	up32 a5_48 = 587785396;
	while (a5_48 < 587785524)
	{
		a5_48 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_133892 *) 0x02;
	}
	up32 a5_61 = 587785524;
	while (a5_61 < 587785524)
	{
		a5_61 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_133892 *) 0x02;
	}
	return ra_19;
}

// 2302AD94: void ota_dump_cmd(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack word32 dwArg0C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118)
void ota_dump_cmd(Eq_2 ra, Eq_2 a3, Eq_2 s6, word32 dwArg0C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118)
{
	hal_boot2_dump(ra, a3, s6, dwArg0C, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118);
}

// 2302AD98: void ota_tcp_cmd.part.0(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48)
// Called from:
//      ota_tcp_cmd
void ota_tcp_cmd.part.0(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48)
{
	Eq_2 a0_1419;
	word32 a0_34;
	Eq_2 a3_37;
	Eq_2 a4_38;
	Eq_2 a5_39;
	Eq_2 s3_45;
	word32 s2_1871;
	word32 s1_1870;
	lwip_gethostbyname(ra, s0, *((word32) a0 + 4), a3, mstatus, dwLocD8, dwLoc98, dwLoc58, dwLoc48, s4, s0, out s1_1870, out a0_34, out a3_37, out a4_38, out a5_39, out s2_1871, out s3_45);
	if (a0_34 == 0x00)
	{
		a0_1419.u0 = 0x230726C8;
		goto l2302ADDE;
	}
	word32 a0_62;
	Eq_2 a3_65;
	word32 s0_1879;
	word32 s2_1880;
	word32 s5_1881;
	word32 s6_1882;
	Eq_2 ra_78 = bl_mtd_open(ra, 0x23080D18, a3_37, a4_38, a5_39, s3_45, mstatus, dwLoc0140, dwLoc013C, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, dwLoc9C, dwLoc88, dwLoc48, s8, s0, out s0_1879, out a0_62, out a3_65, out s2_1880, out s5_1881, out s6_1882);
	if (a0_62 != 0x00)
	{
		a0_1419.u0 = 0x23080D1C;
l2302ADDE:
		word32 a5_1876;
		word32 a2_1874;
		word32 a4_1875;
		word32 s4_1877;
		word32 s8_1878;
		word32 a0_1872;
		word32 a1_1873;
		puts(a0_1419, out a0_1872, out a1_1873, out a2_1874, out a4_1875, out a5_1876, out s4_1877, out s8_1878);
		return;
	}
	Eq_2 a3_94;
	word32 a1_1883;
	word32 s3_1887;
	word32 s5_1888;
	word32 s2_1886;
	word32 a2_1884;
	word32 a4_1885;
	if (lwip_socket(ra_78, 0x01, 0x00, a3_65, mstatus, dwLoc011C, dwLocE8, dwLocA8, dwLoc68, dwLoc58, dwLoc48, s8, s4, s0, out a1_1883, out a2_1884, out a3_94, out a4_1885, out s2_1886, out s3_1887, out s5_1888) < 0x00)
	{
		word32 s7_1902;
		word32 s2_1897;
		word32 a4_1894;
		word32 s1_1889;
		word32 a1_1891;
		word32 a0_1890;
		word32 s11_1906;
		word32 t4_1907;
		word32 s10_1905;
		word32 s8_1903;
		word32 s9_1904;
		word32 s5_1900;
		word32 s6_1901;
		word32 s3_1898;
		word32 s4_1899;
		word32 a5_1895;
		word32 a7_1896;
		word32 a2_1892;
		word32 a3_1893;
		printf(ra_78, &g_t230726E0, a3_94, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1889, out a0_1890, out a1_1891, out a2_1892, out a3_1893, out a4_1894, out a5_1895, out a7_1896, out s2_1897, out s3_1898, out s4_1899, out s5_1900, out s6_1901, out s7_1902, out s8_1903, out s9_1904, out s10_1905, out s11_1906, out t4_1907);
		goto l2302AE54;
	}
	Eq_2 a2_1328;
	Eq_2 a5_1331;
	word32 a5_1918;
	word32 a4_1917;
	word32 a2_1915;
	word32 a3_1916;
	word32 a1_1914;
	word32 t1_1912;
	word32 a0_1913;
	Eq_2 ra_124 = memset(ra_78, fp + -0x0144, 0x00, 0x10, out t1_1912, out a0_1913, out a1_1914, out a2_1915, out a3_1916, out a4_1917, out a5_1918);
	union Eq_2 ** a5_132;
	lwip_htons(0x00FFFD05, out a5_132);
	Eq_2 a5_137 = **a5_132;
	Eq_2 a3_143;
	Eq_2 a4_144;
	Eq_2 a5_145;
	Eq_2 a0_157;
	Eq_2 a3_160;
	word32 s1_1919;
	word32 a1_1920;
	word32 s8_1928;
	word32 a2_1921;
	word32 a4_1922;
	word32 s3_1926;
	word32 s4_1927;
	word32 s2_1925;
	word32 a5_1923;
	word32 a6_1924;
	pvPortMalloc(ra_124, ip4addr_ntoa(out a3_143, out a4_144, out a5_145), 0x0200, a3_143, a4_144, a5_145, mstatus, dwLoc0110, dwLoc010C, dwLocC4, s4, dwArg28, out s1_1919, out a0_157, out a1_1920, out a2_1921, out a3_160, out a4_1922, out a5_1923, out a6_1924, out s2_1925, out s3_1926, out s4_1927, out s8_1928);
	hal_boot2_get_active_partition();
	Eq_2 a3_182;
	Eq_2 a3_207;
	word32 s4_1956;
	word32 s5_1957;
	word32 s6_1958;
	word32 s7_1959;
	word32 s11_1963;
	word32 t4_1964;
	word32 s10_1962;
	word32 s8_1960;
	word32 s9_1961;
	word32 s11_1945;
	word32 s3_1955;
	word32 t4_1946;
	word32 s2_1954;
	word32 s1_1947;
	word32 a0_1948;
	word32 a5_1952;
	word32 a7_1953;
	word32 a4_1951;
	word32 a1_1949;
	word32 a2_1950;
	word32 s7_1941;
	word32 s10_1944;
	word32 s8_1942;
	word32 s9_1943;
	word32 a0_1930;
	word32 s6_1940;
	word32 a1_1931;
	word32 s5_1939;
	word32 a2_1932;
	word32 a4_1933;
	word32 s3_1937;
	word32 s4_1938;
	word32 s2_1936;
	word32 a5_1934;
	word32 a7_1935;
	word32 s1_1929;
	Eq_2 ra_210 = printf(printf(ra_124, &g_t23080D40, a3_160, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1929, out a0_1930, out a1_1931, out a2_1932, out a3_182, out a4_1933, out a5_1934, out a7_1935, out s2_1936, out s3_1937, out s4_1938, out s5_1939, out s6_1940, out s7_1941, out s8_1942, out s9_1943, out s10_1944, out s11_1945, out t4_1946), &g_t23080D68, a3_182, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1947, out a0_1948, out a1_1949, out a2_1950, out a3_207, out a4_1951, out a5_1952, out a7_1953, out s2_1954, out s3_1955, out s4_1956, out s5_1957, out s6_1958, out s7_1959, out s8_1960, out s9_1961, out s10_1962, out s11_1963, out t4_1964);
	hal_boot2_get_active_entries(a0, a1);
	Eq_2 s0_1334 = a0_157;
	if (false)
	{
		word32 t4_1982;
		word32 s8_1978;
		word32 s9_1979;
		word32 s10_1980;
		word32 s11_1981;
		word32 a0_1967;
		word32 s7_1977;
		word32 a1_1968;
		word32 s6_1976;
		word32 a3_1969;
		word32 a4_1970;
		word32 s4_1974;
		word32 s5_1975;
		word32 s3_1973;
		word32 a7_1971;
		word32 s2_1972;
		word32 s1_1966;
		printf(ra_210, &g_t23080D88, a3_207, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1966, out a0_1967, out a1_1968, out a2_1328, out a3_1969, out a4_1970, out a5_1331, out a7_1971, out s2_1972, out s3_1973, out s4_1974, out s5_1975, out s6_1976, out s7_1977, out s8_1978, out s9_1979, out s10_1980, out s11_1981, out t4_1982);
	}
	else
	{
		Eq_2 a3_244;
		Eq_2 a3_270;
		Eq_2 a3_295;
		word32 s10_2045;
		word32 s11_2046;
		word32 t4_2047;
		word32 s9_2044;
		word32 s8_2043;
		word32 s7_2042;
		word32 s4_2039;
		word32 s5_2040;
		word32 s6_2041;
		word32 s11_2028;
		word32 s3_2038;
		word32 t4_2029;
		word32 s2_2037;
		word32 s1_2030;
		word32 a0_2031;
		word32 a5_2035;
		word32 a7_2036;
		word32 a4_2034;
		word32 a1_2032;
		word32 a2_2033;
		word32 a5_2017;
		word32 s10_2027;
		word32 a7_2018;
		word32 s9_2026;
		word32 s2_2019;
		word32 s3_2020;
		word32 s7_2024;
		word32 s8_2025;
		word32 s6_2023;
		word32 s4_2021;
		word32 s5_2022;
		word32 s7_2006;
		word32 a4_2016;
		word32 s8_2007;
		word32 a2_2015;
		word32 s9_2008;
		word32 s10_2009;
		word32 a0_2013;
		word32 a1_2014;
		word32 s1_2012;
		word32 s11_2010;
		word32 t4_2011;
		word32 a0_1995;
		word32 s6_2005;
		word32 a1_1996;
		word32 s5_2004;
		word32 a2_1997;
		word32 a4_1998;
		word32 s3_2002;
		word32 s4_2003;
		word32 s2_2001;
		word32 a5_1999;
		word32 a7_2000;
		word32 s1_1994;
		Eq_2 ra_298 = printf(printf(printf(ra_210, &g_t23080DAC, fp + -64, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1994, out a0_1995, out a1_1996, out a2_1997, out a3_244, out a4_1998, out a5_1999, out a7_2000, out s2_2001, out s3_2002, out s4_2003, out s5_2004, out s6_2005, out s7_2006, out s8_2007, out s9_2008, out s10_2009, out s11_2010, out t4_2011), &g_t23080DD4, a3_244, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2012, out a0_2013, out a1_2014, out a2_2015, out a3_270, out a4_2016, out a5_2017, out a7_2018, out s2_2019, out s3_2020, out s4_2021, out s5_2022, out s6_2023, out s7_2024, out s8_2025, out s9_2026, out s10_2027, out s11_2028, out t4_2029), &g_t23080E0C, a3_270, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2030, out a0_2031, out a1_2032, out a2_2033, out a3_295, out a4_2034, out a5_2035, out a7_2036, out s2_2037, out s3_2038, out s4_2039, out s5_2040, out s6_2041, out s7_2042, out s8_2043, out s9_2044, out s10_2045, out s11_2046, out t4_2047);
		0x00 = (uint16) dwLoc010C;
		bl_mtd_erase_all(ra, a1);
		Eq_2 a3_319;
		Eq_2 s4_353;
		word32 s9_2080;
		word32 s10_2081;
		word32 s11_2082;
		word32 t4_2083;
		word32 a7_2073;
		word32 s2_2074;
		word32 s7_2078;
		word32 s8_2079;
		word32 s6_2077;
		word32 s3_2075;
		word32 s5_2076;
		word32 s1_2066;
		word32 a0_2067;
		word32 a4_2071;
		word32 a5_2072;
		word32 a3_2070;
		word32 a1_2068;
		word32 a2_2069;
		word32 s6_2059;
		word32 s7_2060;
		word32 s11_2064;
		word32 t4_2065;
		word32 s10_2063;
		word32 s8_2061;
		word32 s9_2062;
		word32 a4_2052;
		word32 a5_2053;
		word32 s4_2057;
		word32 s5_2058;
		word32 s3_2056;
		word32 a7_2054;
		word32 s2_2055;
		word32 a1_2050;
		word32 a2_2051;
		word32 a0_2049;
		word32 s1_2048;
		Eq_2 ra_347 = printf(printf(ra_298, &g_t23080E38, a3_295, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2048, out a0_2049, out a1_2050, out a2_2051, out a3_319, out a4_2052, out a5_2053, out a7_2054, out s2_2055, out s3_2056, out s4_2057, out s5_2058, out s6_2059, out s7_2060, out s8_2061, out s9_2062, out s10_2063, out s11_2064, out t4_2065), &g_t230726F4, a3_319, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2066, out a0_2067, out a1_2068, out a2_2069, out a3_2070, out a4_2071, out a5_2072, out a7_2073, out s2_2074, out s3_2075, out s4_353, out s5_2076, out s6_2077, out s7_2078, out s8_2079, out s9_2080, out s10_2081, out s11_2082, out t4_2083);
		word32 a0_364;
		Eq_2 a3_367;
		word32 s2_2087;
		word32 s3_2088;
		word32 a2_2085;
		word32 a4_2086;
		word32 a1_2084;
		Eq_2 s4_1167;
		Eq_2 s0_1146 = lwip_connect(s4_353, fp + -0x0144, mstatus, dwLoc011C, dwLoc0108, dwLocC8, dwLoc88, out a0_364, out a1_2084, out a2_2085, out a3_367, out a4_2086, out s2_2087, out s3_2088, out s4_1167);
		if (a0_364 == 0x00)
		{
			utils_sha256_init(ra, a0);
			utils_sha256_starts(a0);
			word32 a3_2120;
			word32 a2_2119;
			word32 a1_2118;
			word32 a0_2117;
			word32 t1_2116;
			word32 a4_2121;
			word32 a5_2122;
			Eq_2 ra_1161 = memset(ra_347, fp + -308, 0x00, 32, out t1_2116, out a0_2117, out a1_2118, out a2_2119, out a3_2120, out a4_2121, out a5_2122);
			Eq_2 s2_1176 = 0x00;
			Eq_2 s1_1162 = 0x00;
			Eq_134705 s9_1175 = 0x00;
			Eq_2 s3_1166 = 0x23072000;
			mstatus_419 = mstatus;
			while (true)
			{
				Eq_2 a2_1209;
				Eq_2 ra_1213;
				Eq_2 s4_1219;
				ptr32 mstatus_419;
				int32 a0_422;
				Eq_2 a3_425;
				word32 s6_2123;
				word32 ra_431 = lwip_read(ra_1161, s1_1162, s4_1167, s0_1146 + s9_1175, 0x0200 - s9_1175, s2_1176, s3_1166, s4_1167, mstatus_419, a5_137, dwLoc013C, dwLoc0138, dwLoc0128, dwLoc0118, dwLocF8, dwLocE8, dwLocC8, dwLocB8, s4, out s0_1146, out a0_422, out a3_425, out s6_2123, out mstatus_419);
				if (a0_422 < 0x00)
					break;
				if (a0_422 == 0x00)
				{
					word32 s1_2162;
					word32 a0_2163;
					word32 a1_2164;
					word32 a3_2165;
					word32 a4_2166;
					word32 a5_2167;
					word32 a7_2168;
					word32 s2_2169;
					word32 s3_2170;
					word32 s5_2171;
					word32 s6_2172;
					word32 s7_2173;
					word32 s8_2174;
					word32 s9_2175;
					word32 s10_2176;
					word32 s11_2177;
					word32 t4_2178;
					ra_1213 = printf(ra_431, &g_t23080E40, a3_425, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2162, out a0_2163, out a1_2164, out a2_1209, out a3_2165, out a4_2166, out a5_2167, out a7_2168, out s2_2169, out s3_2170, out s4_1219, out s5_2171, out s6_2172, out s7_2173, out s8_2174, out s9_2175, out s10_2176, out s11_2177, out t4_2178);
					goto l2302AFBC;
				}
				Eq_2 a3_460;
				Eq_2 a4_461;
				Eq_134705 s10_465;
				word32 s11_466;
				word32 s9_474;
				word32 a0_2179;
				word32 a1_2180;
				word32 a2_2181;
				word32 a5_2182;
				word32 a7_2183;
				word32 s5_2184;
				word32 s6_2185;
				word32 s7_2186;
				word32 s8_2187;
				word32 t4_2188;
				ra_1161 = printf(ra_431, &g_t23072744, a3_425, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1162, out a0_2179, out a1_2180, out a2_2181, out a3_460, out a4_461, out a5_2182, out a7_2183, out s2_1176, out s3_1166, out s4_1167, out s5_2184, out s6_2185, out s7_2186, out s8_2187, out s9_474, out s10_465, out s11_466, out t4_2188);
				s9_1175 = s9_474 + s11_466;
				if (s2_1176 == 0x00)
				{
					if (s9_1175 <= 511)
						continue;
					if (s9_1175 == s10_465)
					{
						word32 a1_2208;
						word32 a2_2209;
						word32 a3_2210;
						word32 a4_2211;
						word32 a5_2212;
						word32 a6_2213;
						word32 a7_2214;
						memcpy(fp + -244, s0_1146, 0x10, out a1_2208, out a2_2209, out a3_2210, out a4_2211, out a5_2212, out a6_2213, out a7_2214);
						word32 a0_2215;
						word32 a1_2216;
						word32 a2_2217;
						word32 a4_2218;
						word32 a5_2219;
						word32 s4_2220;
						word32 s8_2221;
						puts(0x23080EB8, out a0_2215, out a1_2216, out a2_2217, out a4_2218, out a5_2219, out s4_2220, out s8_2221);
						word32 a0_2222;
						word32 a1_2223;
						word32 a2_2224;
						word32 a4_2225;
						word32 a5_2226;
						word32 s4_2227;
						word32 s8_2228;
						puts(fp + -244, out a0_2222, out a1_2223, out a2_2224, out a4_2225, out a5_2226, out s4_2227, out s8_2228);
						word32 a0_2229;
						word32 a1_2230;
						word32 a2_2231;
						word32 a4_2232;
						word32 a5_2233;
						word32 s4_2234;
						word32 s8_2235;
						puts((word32) s3_1166 + 2044, out a0_2229, out a1_2230, out a2_2231, out a4_2232, out a5_2233, out s4_2234, out s8_2235);
						word32 a1_2236;
						word32 a2_2237;
						word32 a3_2238;
						word32 a4_2239;
						word32 a5_2240;
						word32 a6_2241;
						word32 a7_2242;
						memcpy(fp + -244, (word32) s0_1146 + 16, 0x04, out a1_2236, out a2_2237, out a3_2238, out a4_2239, out a5_2240, out a6_2241, out a7_2242);
						word32 a0_2243;
						word32 a1_2244;
						word32 a2_2245;
						word32 a4_2246;
						word32 a5_2247;
						word32 s4_2248;
						word32 s8_2249;
						puts(0x23080ED8, out a0_2243, out a1_2244, out a2_2245, out a4_2246, out a5_2247, out s4_2248, out s8_2249);
						word32 a0_2250;
						word32 a1_2251;
						word32 a2_2252;
						word32 a4_2253;
						word32 a5_2254;
						word32 s4_2255;
						word32 s8_2256;
						puts(fp + -244, out a0_2250, out a1_2251, out a2_2252, out a4_2253, out a5_2254, out s4_2255, out s8_2256);
						word32 s8_891;
						word32 a0_2257;
						word32 a1_2258;
						word32 a2_2259;
						word32 a4_2260;
						word32 a5_2261;
						word32 s4_2262;
						puts((word32) s3_1166 + 2044, out a0_2257, out a1_2258, out a2_2259, out a4_2260, out a5_2261, out s4_2262, out s8_891);
						word32 a1_2263;
						word32 a3_2264;
						word32 a4_2265;
						word32 a5_2266;
						strstr(ra_1161, fp + -244, s8_891 + -752, out a1_2263, out a3_2264, out a4_2265, out a5_2266);
						Eq_2 a3_914;
						word32 a1_2267;
						word32 a2_2268;
						word32 a4_2269;
						word32 a5_2270;
						word32 a6_2271;
						word32 a7_2272;
						memcpy(fp + -328, (word32) s0_1146 + 20, 0x04, out a1_2267, out a2_2268, out a3_914, out a4_2269, out a5_2270, out a6_2271, out a7_2272);
						word32 s3_938;
						word32 s1_2273;
						word32 a0_2274;
						word32 a1_2275;
						word32 a2_2276;
						word32 a3_2277;
						word32 a4_2278;
						word32 a5_2279;
						word32 a7_2280;
						word32 s2_2281;
						word32 s4_2282;
						word32 s5_2283;
						word32 s7_2284;
						word32 s8_2285;
						word32 s9_2286;
						word32 s10_2287;
						word32 s11_2288;
						word32 t4_2289;
						word32 s6_1086;
						Eq_2 ra_1089 = printf(ra_1161, &g_t23080EF8, a3_914, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2273, out a0_2274, out a1_2275, out a2_2276, out a3_2277, out a4_2278, out a5_2279, out a7_2280, out s2_2281, out s3_938, out s4_2282, out s5_2283, out s6_1086, out s7_2284, out s8_2285, out s9_2286, out s10_2287, out s11_2288, out t4_2289);
						word32 a1_2290;
						word32 a2_2291;
						word32 a3_2292;
						word32 a4_2293;
						word32 a5_2294;
						word32 a6_2295;
						word32 a7_2296;
						memcpy(fp + -244, (word32) dwLocEC + 32, 0x10, out a1_2290, out a2_2291, out a3_2292, out a4_2293, out a5_2294, out a6_2295, out a7_2296);
						word32 a0_2297;
						word32 a1_2298;
						word32 a2_2299;
						word32 a4_2300;
						word32 a5_2301;
						word32 s4_2302;
						word32 s8_2303;
						puts(0x23080F34, out a0_2297, out a1_2298, out a2_2299, out a4_2300, out a5_2301, out s4_2302, out s8_2303);
						word32 a0_2304;
						word32 a1_2305;
						word32 a2_2306;
						word32 a4_2307;
						word32 a5_2308;
						word32 s4_2309;
						word32 s8_2310;
						puts(fp + -244, out a0_2304, out a1_2305, out a2_2306, out a4_2307, out a5_2308, out s4_2309, out s8_2310);
						word32 a0_2311;
						word32 a1_2312;
						word32 a2_2313;
						word32 a4_2314;
						word32 a5_2315;
						word32 s4_2316;
						word32 s8_2317;
						puts(s3_938 + 2044, out a0_2311, out a1_2312, out a2_2313, out a4_2314, out a5_2315, out s4_2316, out s8_2317);
						word32 a1_2318;
						word32 a2_2319;
						word32 a3_2320;
						word32 a4_2321;
						word32 a5_2322;
						word32 a6_2323;
						word32 a7_2324;
						memcpy(fp + -244, (word32) dwLocEC + 48, 0x10, out a1_2318, out a2_2319, out a3_2320, out a4_2321, out a5_2322, out a6_2323, out a7_2324);
						word32 a0_2325;
						word32 a1_2326;
						word32 a2_2327;
						word32 a4_2328;
						word32 a5_2329;
						word32 s4_2330;
						word32 s8_2331;
						puts(587730772, out a0_2325, out a1_2326, out a2_2327, out a4_2328, out a5_2329, out s4_2330, out s8_2331);
						word32 a0_2332;
						word32 a1_2333;
						word32 a2_2334;
						word32 a4_2335;
						word32 a5_2336;
						word32 s4_2337;
						word32 s8_2338;
						puts(fp + -244, out a0_2332, out a1_2333, out a2_2334, out a4_2335, out a5_2336, out s4_2337, out s8_2338);
						word32 a0_2339;
						word32 a1_2340;
						word32 a2_2341;
						word32 a4_2342;
						word32 a5_2343;
						word32 s4_2344;
						word32 s8_2345;
						puts(s3_938 + 2044, out a0_2339, out a1_2340, out a2_2341, out a4_2342, out a5_2343, out s4_2344, out s8_2345);
						word32 a1_2346;
						word32 a2_2347;
						word32 a4_2348;
						word32 a5_2349;
						word32 a6_2350;
						word32 a7_2351;
						Eq_2 a3_1058;
						memcpy(fp + -244, (word32) dwLocEC + 64, 32, out a1_2346, out a2_2347, out a3_1058, out a4_2348, out a5_2349, out a6_2350, out a7_2351);
						word32 a0_2352;
						word32 a1_2353;
						word32 a2_2354;
						word32 a4_2355;
						word32 a5_2356;
						word32 s4_2357;
						word32 s8_2358;
						puts(587730804, out a0_2352, out a1_2353, out a2_2354, out a4_2355, out a5_2356, out s4_2357, out s8_2358);
						do
						{
							word32 s10_1101;
							word32 s11_1102;
							word32 s2_1103;
							word32 s3_1104;
							Eq_2 s9_1110;
							word32 s1_2359;
							word32 a0_2360;
							word32 a1_2361;
							word32 a2_2362;
							word32 a4_2363;
							word32 a5_2364;
							word32 a7_2365;
							word32 s4_2366;
							word32 s5_2367;
							word32 s7_2368;
							word32 s8_2369;
							word32 t4_2370;
							ra_1089 = printf(ra_1089, s6_1086 + 0x0530, a3_1058, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2359, out a0_2360, out a1_2361, out a2_2362, out a3_1058, out a4_2363, out a5_2364, out a7_2365, out s2_1103, out s3_1104, out s4_2366, out s5_2367, out s6_1086, out s7_2368, out s8_2369, out s9_1110, out s10_1101, out s11_1102, out t4_2370);
						} while (s2_1103 != s10_1101);
						word32 a0_2371;
						word32 a1_2372;
						word32 a2_2373;
						word32 a4_2374;
						word32 a5_2375;
						word32 s4_2376;
						word32 s8_2377;
						puts(s3_1104 + 2044, out a0_2371, out a1_2372, out a2_2373, out a4_2374, out a5_2375, out s4_2376, out s8_2377);
						Eq_2 a3_1132;
						word32 a1_2378;
						word32 a2_2379;
						word32 a4_2380;
						word32 a5_2381;
						word32 a6_2382;
						word32 a7_2383;
						memcpy(fp + -0x0114, s9_1110, 32, out a1_2378, out a2_2379, out a3_1132, out a4_2380, out a5_2381, out a6_2382, out a7_2383);
						s0_1146 = dwLocEC;
						word32 a0_2384;
						word32 a1_2385;
						word32 a2_2386;
						word32 a3_2387;
						word32 a4_2388;
						word32 a5_2389;
						word32 a7_2390;
						word32 s2_2391;
						word32 s5_2392;
						word32 s6_2393;
						word32 s7_2394;
						word32 s8_2395;
						word32 s9_2396;
						word32 s10_2397;
						word32 s11_2398;
						word32 t4_2399;
						ra_1161 = printf(ra_1089, &g_t23080F90, a3_1132, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1162, out a0_2384, out a1_2385, out a2_2386, out a3_2387, out a4_2388, out a5_2389, out a7_2390, out s2_2391, out s3_1166, out s4_1167, out s5_2392, out s6_2393, out s7_2394, out s8_2395, out s9_2396, out s10_2397, out s11_2398, out t4_2399);
						s9_1175.u0 = 0x00;
						s2_1176.u0 = 0x01;
						continue;
					}
					else
					{
						word32 s1_2189;
						word32 a0_2190;
						word32 a1_2191;
						word32 a2_2192;
						word32 a3_2193;
						word32 a4_2194;
						word32 a5_2195;
						word32 a7_2196;
						word32 s2_2197;
						word32 s3_2198;
						word32 s4_2199;
						word32 s5_2200;
						word32 s6_2201;
						word32 s7_2202;
						word32 s8_2203;
						word32 s9_2204;
						word32 s10_2205;
						word32 s11_2206;
						word32 t4_2207;
						printf(ra_1161, &g_t23080E88, a3_460, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2189, out a0_2190, out a1_2191, out a2_2192, out a3_2193, out a4_2194, out a5_2195, out a7_2196, out s2_2197, out s3_2198, out s4_2199, out s5_2200, out s6_2201, out s7_2202, out s8_2203, out s9_2204, out s10_2205, out s11_2206, out t4_2207);
						while (true)
							;
					}
				}
				s0_1146 = dwLoc8C;
				if (a4_461 != s1_1162)
				{
					if (s9_1175 <= 511)
						continue;
					if (s9_1175 != s10_465)
					{
						word32 s1_2400;
						word32 a0_2401;
						word32 a1_2402;
						word32 a2_2403;
						word32 a3_2404;
						word32 a4_2405;
						word32 a5_2406;
						word32 a7_2407;
						word32 s2_2408;
						word32 s3_2409;
						word32 s4_2410;
						word32 s5_2411;
						word32 s6_2412;
						word32 s7_2413;
						word32 s8_2414;
