pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
						word32 s9_2415;
						word32 s10_2416;
						word32 s11_2417;
						word32 t4_2418;
						printf(ra_1161, &g_t23080E88, a3_460, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2400, out a0_2401, out a1_2402, out a2_2403, out a3_2404, out a4_2405, out a5_2406, out a7_2407, out s2_2408, out s3_2409, out s4_2410, out s5_2411, out s6_2412, out s7_2413, out s8_2414, out s9_2415, out s10_2416, out s11_2417, out t4_2418);
						while (true)
							;
					}
				}
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 s1_501;
				Eq_2 s2_504;
				Eq_2 s5_507;
				Eq_2 s9_511;
				word32 a0_2419;
				word32 a1_2420;
				word32 a2_2421;
				word32 a3_2422;
				word32 a4_2423;
				word32 a5_2424;
				word32 a7_2425;
				word32 s3_2426;
				word32 s4_2427;
				word32 s6_2428;
				word32 s7_2429;
				word32 s8_2430;
				word32 s10_2431;
				word32 s11_2432;
				word32 t4_2433;
				Eq_2 ra_500 = printf(ra_1161, &g_t23080FC8, dwLoc8C, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_501, out a0_2419, out a1_2420, out a2_2421, out a3_2422, out a4_2423, out a5_2424, out a7_2425, out s2_504, out s3_2426, out s4_2427, out s5_507, out s6_2428, out s7_2429, out s8_2430, out s9_511, out s10_2431, out s11_2432, out t4_2433);
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				word32 a3_2438;
				word32 a5_2439;
				word32 a7_2440;
				utils_sha256_update(t1, a1, a2, a3, a5, a7, stackArg72, stackArg168, out a3_2438, out a5_2439, out a7_2440);
				0x00 = (uint16) dwLoc010C;
				Eq_2 a5_525;
				word32 s0_2441;
				word32 a0_2442;
				word32 a1_2443;
				word32 a4_2444;
				word32 s5_2445;
				word32 s7_2446;
				word32 s6_539;
				Eq_2 a3_523;
				ra_1161 = bl_mtd_write(ra_500, s1_501, s5_507, s9_511, dwLoc8C, s2_504, dwLoc0140, dwLoc013C, dwLoc0118, dwLocF4, out s0_2441, out s1_1162, out a0_2442, out a1_2443, out a3_523, out a4_2444, out a5_525, out s2_1176, out s3_1166, out s4_1167, out s5_2445, out s6_539, out s7_2446);
				s0_1146 = dwLoc6C;
				s9_1175.u0 = 0x00;
				if (s1_1162 != a5_525)
					continue;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg40 = <invalid>;
				Eq_2 stackArg136 = <invalid>;
				utils_sha256_finish(t1, a2, a5, a7, stackArg40, stackArg136);
				word32 a0_2449;
				word32 a1_2450;
				word32 a2_2451;
				word32 a4_2452;
				word32 a5_2453;
				word32 s4_2454;
				word32 s8_2455;
				puts(0x23080FE8, out a0_2449, out a1_2450, out a2_2451, out a4_2452, out a5_2453, out s4_2454, out s8_2455);
				do
				{
					word32 s11_587;
					word32 s9_595;
					word32 s1_2456;
					word32 a0_2457;
					word32 a1_2458;
					word32 a2_2459;
					word32 a4_2460;
					word32 a5_2461;
					word32 a7_2462;
					word32 s2_2463;
					word32 s3_2464;
					word32 s4_2465;
					word32 s5_2466;
					word32 s7_2467;
					word32 s8_2468;
					word32 s10_2469;
					word32 t4_2470;
					ra_1161 = printf(ra_1161, s6_539 + 0x0530, a3_523, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2456, out a0_2457, out a1_2458, out a2_2459, out a3_523, out a4_2460, out a5_2461, out a7_2462, out s2_2463, out s3_2464, out s4_2465, out s5_2466, out s6_539, out s7_2467, out s8_2468, out s9_595, out s10_2469, out s11_587, out t4_2470);
				} while (s9_595 != s11_587);
				word32 a0_2471;
				word32 a1_2472;
				word32 a2_2473;
				word32 a4_2474;
				word32 a5_2475;
				word32 s4_2476;
				word32 s8_2477;
				puts(0x23081008, out a0_2471, out a1_2472, out a2_2473, out a4_2474, out a5_2475, out s4_2476, out s8_2477);
				do
				{
					word32 s11_634;
					word32 s3_636;
					word32 s9_642;
					word32 s1_2478;
					word32 a0_2479;
					word32 a1_2480;
					word32 a2_2481;
					word32 a4_2482;
					word32 a5_2483;
					word32 a7_2484;
					word32 s2_2485;
					word32 s4_2486;
					word32 s5_2487;
					word32 s7_2488;
					word32 s8_2489;
					word32 s10_2490;
					word32 t4_2491;
					ra_1161 = printf(ra_1161, s6_539 + 0x0530, a3_523, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2478, out a0_2479, out a1_2480, out a2_2481, out a3_523, out a4_2482, out a5_2483, out a7_2484, out s2_2485, out s3_636, out s4_2486, out s5_2487, out s6_539, out s7_2488, out s8_2489, out s9_642, out s10_2490, out s11_634, out t4_2491);
				} while (s9_642 != s11_634);
				word32 a0_2492;
				word32 a1_2493;
				word32 a2_2494;
				word32 a4_2495;
				word32 a5_2496;
				word32 s4_2497;
				word32 s8_2498;
				puts(s3_636 + 2044, out a0_2492, out a1_2493, out a2_2494, out a4_2495, out a5_2496, out s4_2497, out s8_2498);
				Eq_2 a3_661;
				word32 a1_2499;
				word32 a2_2500;
				word32 a4_2501;
				word32 a5_2502;
				if (memcmp(fp + -0x0114, fp + -308, 32, out a1_2499, out a2_2500, out a3_661, out a4_2501, out a5_2502) != 0x00)
				{
					word32 s1_2503;
					word32 a0_2504;
					word32 a1_2505;
					word32 a3_2506;
					word32 a4_2507;
					word32 a5_2508;
					word32 a7_2509;
					word32 s2_2510;
					word32 s3_2511;
					word32 s5_2512;
					word32 s6_2513;
					word32 s7_2514;
					word32 s8_2515;
					word32 s9_2516;
					word32 s10_2517;
					word32 s11_2518;
					word32 t4_2519;
					ra_1213 = printf(ra_1161, &g_t23081028, a3_661, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2503, out a0_2504, out a1_2505, out a2_1209, out a3_2506, out a4_2507, out a5_2508, out a7_2509, out s2_2510, out s3_2511, out s4_1219, out s5_2512, out s6_2513, out s7_2514, out s8_2515, out s9_2516, out s10_2517, out s11_2518, out t4_2519);
					goto l2302AFBC;
				}
				Eq_2 a3_672;
				Eq_2 a3_698;
				word32 s1_2520;
				word32 a0_2521;
				word32 a1_2522;
				word32 a2_2523;
				word32 a4_2524;
				word32 a5_2525;
				word32 a7_2526;
				word32 s2_2527;
				word32 s3_2528;
				word32 s4_2529;
				word32 s5_2530;
				word32 s6_2531;
				word32 s7_2532;
				word32 s8_2533;
				word32 s9_2534;
				word32 s10_2535;
				word32 s11_2536;
				word32 t4_2537;
				word32 s1_2538;
				word32 a0_2539;
				word32 a1_2540;
				word32 a2_2541;
				word32 a4_2542;
				word32 a5_2543;
				word32 a7_2544;
				word32 s2_2545;
				word32 s3_2546;
				word32 s4_2547;
				word32 s5_2548;
				word32 s6_2549;
				word32 s7_2550;
				word32 s8_2551;
				word32 s9_2552;
				word32 s10_2553;
				word32 s11_2554;
				word32 t4_2555;
				Eq_2 ra_701 = printf(printf(ra_1161, &g_t2308104C, a3_661, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2520, out a0_2521, out a1_2522, out a2_2523, out a3_672, out a4_2524, out a5_2525, out a7_2526, out s2_2527, out s3_2528, out s4_2529, out s5_2530, out s6_2531, out s7_2532, out s8_2533, out s9_2534, out s10_2535, out s11_2536, out t4_2537), &g_t23081078, a3_672, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2538, out a0_2539, out a1_2540, out a2_2541, out a3_698, out a4_2542, out a5_2543, out a7_2544, out s2_2545, out s3_2546, out s4_2547, out s5_2548, out s6_2549, out s7_2550, out s8_2551, out s9_2552, out s10_2553, out s11_2554, out t4_2555);
				hal_boot2_update_ptable(a0);
				word32 a0_2556;
				word32 a1_2557;
				word32 a2_2558;
				word32 a3_2559;
				word32 a4_2560;
				word32 a5_2561;
				word32 a7_2562;
				word32 s5_2563;
				word32 s6_2564;
				word32 s7_2565;
				word32 s8_2566;
				word32 s9_2567;
				word32 s10_2568;
				word32 s11_2569;
				word32 t4_2570;
				ra_1161 = printf(ra_701, &g_t230810B0, a3_698, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1162, out a0_2556, out a1_2557, out a2_2558, out a3_2559, out a4_2560, out a5_2561, out a7_2562, out s2_1176, out s3_1166, out s4_1167, out s5_2563, out s6_2564, out s7_2565, out s8_2566, out s9_2567, out s10_2568, out s11_2569, out t4_2570);
				hal_reboot(mstatus);
				s0_1146 = dwLocEC;
				s9_1175.u0 = 0x00;
			}
			word32 s1_2124;
			word32 a0_2125;
			word32 a1_2126;
			word32 a3_2127;
			word32 a4_2128;
			word32 a5_2129;
			word32 a7_2130;
			word32 s2_2131;
			word32 s3_2132;
			word32 s5_2133;
			word32 s6_2134;
			word32 s7_2135;
			word32 s8_2136;
			word32 s9_2137;
			word32 s10_2138;
			word32 s11_2139;
			word32 t4_2140;
			ra_1213 = printf(ra_431, &g_t2307272C, a3_425, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2124, out a0_2125, out a1_2126, out a2_1209, out a3_2127, out a4_2128, out a5_2129, out a7_2130, out s2_2131, out s3_2132, out s4_1219, out s5_2133, out s6_2134, out s7_2135, out s8_2136, out s9_2137, out s10_2138, out s11_2139, out t4_2140);
l2302AFBC:
			Eq_2 a2_1266;
			Eq_2 a5_1269;
			word32 s1_2141;
			word32 a0_2142;
			word32 a1_2143;
			word32 a3_2144;
			word32 a4_2145;
			word32 s2_2146;
			word32 s3_2147;
			word32 s4_2148;
			word32 s5_2149;
			word32 s6_2150;
			word32 s0_2151;
			word32 s1_2152;
			word32 a0_2153;
			word32 a1_2154;
			word32 a2_2155;
			word32 a3_2156;
			word32 a4_2157;
			word32 a5_2158;
			word32 a6_2159;
			word32 s4_2160;
			word32 t3_2161;
			vPortFree(lwip_close(ra_1213, s4_1219, a2_1209, mstatus_419, dwLoc0108, dwLocC8, dwLoc98, dwLoc88, dwLoc78, s8, out s1_2141, out a0_2142, out a1_2143, out a2_1266, out a3_2144, out a4_2145, out a5_1269, out s2_2146, out s3_2147, out s4_2148, out s5_2149, out s6_2150), a2_1266, a5_1269, mstatus_419, dwArg08, dwArg48, out s0_2151, out s1_2152, out a0_2153, out a1_2154, out a2_2155, out a3_2156, out a4_2157, out a5_2158, out a6_2159, out s4_2160, out t3_2161);
			utils_sha256_free(a0);
l2302AE54:
			0x00 = (uint16) dwLoc010C;
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg328 = <invalid>;
			Eq_2 stackArg392 = <invalid>;
			bl_mtd_close(a0, a2, a5, mstatus, stackArg328, stackArg392);
			return;
		}
		Eq_2 a2_1307;
		Eq_2 s4_1317;
		word32 s6_2115;
		word32 s5_2114;
		word32 s4_2113;
		word32 s3_2112;
		word32 s2_2111;
		word32 a4_2110;
		word32 a3_2109;
		word32 s1_2106;
		word32 a0_2107;
		word32 a1_2108;
		word32 s11_2104;
		word32 t4_2105;
		word32 s10_2103;
		word32 s9_2102;
		word32 s8_2101;
		word32 s7_2100;
		word32 s6_2099;
		word32 s5_2098;
		word32 a1_2091;
		word32 a3_2092;
		word32 s2_2096;
		word32 s3_2097;
		word32 a7_2095;
		word32 a4_2093;
		word32 a5_2094;
		word32 s1_2089;
		word32 a0_2090;
		s0_1334 = lwip_close(printf(ra_347, &g_t23072710, a3_367, a5_137, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2089, out a0_2090, out a1_2091, out a2_1307, out a3_2092, out a4_2093, out a5_2094, out a7_2095, out s2_2096, out s3_2097, out s4_1317, out s5_2098, out s6_2099, out s7_2100, out s8_2101, out s9_2102, out s10_2103, out s11_2104, out t4_2105), s4_1317, a2_1307, mstatus, dwLoc0108, dwLocC8, dwLoc98, dwLoc88, dwLoc78, s8, out s1_2106, out a0_2107, out a1_2108, out a2_1328, out a3_2109, out a4_2110, out a5_1331, out s2_2111, out s3_2112, out s4_2113, out s5_2114, out s6_2115);
	}
	word32 s1_1984;
	word32 a0_1985;
	word32 t3_1993;
	word32 a1_1986;
	word32 a2_1987;
	word32 a6_1991;
	word32 s4_1992;
	word32 a5_1990;
	word32 a3_1988;
	word32 a4_1989;
	word32 s0_1983;
	vPortFree(s0_1334, a2_1328, a5_1331, mstatus, dwArg08, dwArg48, out s0_1983, out s1_1984, out a0_1985, out a1_1986, out a2_1987, out a3_1988, out a4_1989, out a5_1990, out a6_1991, out s4_1992, out t3_1993);
	goto l2302AE54;
}

