pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302B264: void ota_tcp_cmd(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_2) a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ota_tcp_cmd(Eq_2 ra, Eq_2 s0, union Eq_2 * a1, word32 a2, Eq_2 a3, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (a2 == 0x02)
		ota_tcp_cmd.part.0(ra, s0, a3, a3, s4, s8, mstatus, dwArg08, dwArg28, dwArg48);
	else
	{
		Eq_2 a3_31 = *a1;
		word32 s1_108;
		word32 a0_109;
		word32 a1_110;
		word32 a2_111;
		word32 a3_112;
		word32 a4_113;
		word32 a5_114;
		word32 a7_115;
		word32 s2_116;
		word32 s3_117;
		word32 s4_118;
		word32 s5_119;
		word32 s6_120;
		word32 s7_121;
		word32 s8_122;
		word32 s9_123;
		word32 s10_124;
		word32 s11_125;
		word32 t4_126;
		printf(ra, &g_t230810C8, a3_31, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_108, out a0_109, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114, out a7_115, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120, out s7_121, out s8_122, out s9_123, out s10_124, out s11_125, out t4_126);
	}
}

// 2302B27E: void bl_sys_ota_cli_init()
// Called from:
//      aos_loop_proc
void bl_sys_ota_cli_init()
{
}

// 2302B282: void cmd_sys_time_now(Stack word32 dwArg14)
void cmd_sys_time_now(word32 dwArg14)
{
	ui32 a5_14;
	Eq_2 a1_16;
	ui32 a4_17;
	word32 a0_60;
	word32 a2_61;
	word32 s4_62;
	word32 s8_63;
	puts(0x2308112C, out a0_60, out a1_16, out a2_61, out a4_17, out a5_14, out s4_62, out s8_63);
	Eq_2 a0_23 = bl_sys_time_get(fp + -48, a4_17, a5_14);
	0x00 = dwArg14;
	word32 a1_64;
	word32 a3_65;
	word32 a4_66;
	word32 a5_67;
	utils_time_date_from_epoch(__udivdi3(a0_23, a1_16, 1000, 0x00, out a1_64, out a3_65, out a4_66, out a5_67), fp + -36);
}

// 2302B2B8: void bl_sys_time_cli_init()
// Called from:
//      aos_loop_proc
void bl_sys_time_cli_init()
{
}

// 2302B2BC: void bl_sys_time_update(Register uint32 a0, Register Eq_136091 a1)
// Called from:
//      sntp_recv
void bl_sys_time_update(uint32 a0, Eq_136091 a1)
{
	word32 a5_32;
	*xTaskGetTickCount(out a5_32) = 0x4200DE08;
	g_dw4200DE0C = 0x00;
	g_dw4200EDF0 = a0;
	g_t4200EDF4 = a1;
}

// 2302B2F0: Register ptr32 bl_sys_time_get(Register ptr32 a0, Register ui32 a4, Register ui32 a5)
// Called from:
//      cmd_sys_time_now
ptr32 bl_sys_time_get(ptr32 a0, ui32 a4, ui32 a5)
{
	ptr32 a0_16;
	if ((a5 | a4) != 0x00)
	{
		word32 a5_54;
		Eq_2 a0_19 = xTaskGetTickCount(out a5_54);
		ptr32 * a5_24 = a0_19 - g_dw4200DE08;
		ptr32 * a4_27 = a5_24 + a4;
		*a4_27 = a0;
		Mem32[CONVERT(a4_27 <u a5_24, bool, word32) + ((a5_24 >> 0x1F) + a0_19) + 4:word32] = a0;
		a0_16 = 0x00;
	}
	else
		a0_16 = ~0x00;
	return a0_16;
}

// 2302B340: Register ptr32 bl_sys_time_sync_state(Register ptr32 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out)
// Called from:
//      xTaskIncrementTick
ptr32 bl_sys_time_sync_state(ptr32 a0, Eq_2 a4, ptr32 mstatus, word32 dwArg38, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out)
{
	if (g_dw4200DE00 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		return ~0x00;
	}
	else
	{
		word32 a5_98;
		Eq_2 a4_21 = vTaskEnterCritical(a4, mstatus, out a5_98);
		word32 a5_99;
		Eq_2 a0_22 = xTaskGetTickCount(out a5_99);
		Eq_2 a3_28;
		word32 a0_25 = bl_rtc_get_timestamp_ms(a4_21, out a3_28);
		word32 a4_100;
		word32 a5_101;
		vTaskExitCritical(a3_28, mstatus, out a4_100, out a5_101);
		Eq_136176 a5_40 = g_t4200DDFC;
		ptr32 a0_42 = 0x00;
		Eq_2 a3_43 = a0_22 - a5_40;
		Eq_2 a4_44 = a0_25 - g_dw4200DDF8;
		if (a3_43 < a4_44)
		{
			Mem47[a5_40 - a0_22 + a4_44:word32] = a0;
			a0_42 = 0x01;
		}
		0x00 = dwArg38;
		a2Out = dwArg10;
		a3Out = a3_43;
		a4Out = a4_44;
		s2Out = a0_22;
		return a0_42;
	}
}

// 2302B3A2: Register Eq_2 cli_command_get(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      proc_onecmd
//      help_cmd
//      cli_main_input
Eq_2 cli_command_get(Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_28 = ~0x00;
	if (a0 >= 0x00)
	{
		a5_28.u0 = ~0x00;
		a4 = *((word32) a3 + 44);
		a2 = (word32) a3 + 8;
		if (a0 < (word32) a3 + 8)
		{
			if (a0 < a3)
			{
				if (a1 != 0x00)
					*(union Eq_2 *) 0x01 = a1;
				a4 = *(union Eq_2 *) 0x14;
				a5_28 = (word32) a0 + 24;
			}
			else
			{
				if (a1 != 0x00)
					*a1 = 0x00;
				a4 = *(union Eq_2 *) 0x2B;
			}
		}
	}
	a2Out = a2;
	a4Out = a4;
	a5Out = a5_28;
	return a5_28;
}

// 2302B3E6: void exit_cmd()
void exit_cmd()
{
	g_dw4200EE14 = 0x01;
}

// 2302B3F2: void cb_idnoe(Register Eq_2 ra, Register (ptr32 Eq_136235) a1, Register Eq_2 a3, Register (ptr32 Eq_2) a5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cb_idnoe(Eq_2 ra, struct Eq_136235 * a1, Eq_2 a3, union Eq_2 * a5, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a0_7 = *a5;
	if (a5 == null)
	{
		*(union Eq_2 *) 0x01 = a0_7;
		Eq_2 a3_20;
		word32 s1_174;
		word32 a0_175;
		word32 a2_176;
		word32 s10_171;
		word32 s11_172;
		word32 t4_173;
		word32 s7_168;
		word32 s8_169;
		word32 s9_170;
		word32 s4_165;
		word32 s5_166;
		word32 s6_167;
		word32 a7_162;
		word32 s2_163;
		word32 s3_164;
		word32 a2_159;
		word32 a4_160;
		word32 a5_161;
		word32 s1_156;
		word32 a0_157;
		word32 a1_158;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a7_180;
		word32 s2_181;
		word32 s3_182;
		word32 s4_183;
		word32 s5_184;
		word32 s6_185;
		word32 s7_186;
		word32 s8_187;
		word32 s9_188;
		word32 s10_189;
		word32 s11_190;
		word32 t4_191;
		ra = printf(printf(ra, &g_t230811BC, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_156, out a0_157, out a1_158, out a2_159, out a3_20, out a4_160, out a5_161, out a7_162, out s2_163, out s3_164, out s4_165, out s5_166, out s6_167, out s7_168, out s8_169, out s9_170, out s10_171, out s11_172, out t4_173), &g_t230811DC, a3_20, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_174, out a0_175, out a1, out a2_176, out a3_177, out a4_178, out a5_179, out a7_180, out s2_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out s9_188, out s10_189, out s11_190, out t4_191);
	}
	word32 a5_64 = (word32) a1->b0010;
	Eq_2 a3_78;
	if (a5_64 != 0x01)
	{
		if (a5_64 != 0x02)
		{
			if (a5_64 != 0x03)
				a3_78.u0 = 0x2307D6E4;
			else
				a3_78.u0 = 587731348;
		}
		else
			a3_78.u0 = 587731372;
	}
	else
		a3_78.u0 = 0x230811A0;
	word32 s1_192;
	word32 a0_193;
	word32 a1_194;
	word32 a2_195;
	word32 a3_196;
	word32 a4_197;
	word32 a5_198;
	word32 a7_199;
	word32 s2_200;
	word32 s3_201;
	word32 s4_202;
	word32 s5_203;
	word32 s6_204;
	word32 s7_205;
	word32 s8_206;
	word32 s9_207;
	word32 s10_208;
	word32 s11_209;
	word32 t4_210;
	printf(ra, &g_t23081234, a3_78, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_192, out a0_193, out a1_194, out a2_195, out a3_196, out a4_197, out a5_198, out a7_199, out s2_200, out s3_201, out s4_202, out s5_203, out s6_204, out s7_205, out s8_206, out s9_207, out s10_208, out s11_209, out t4_210);
}

// 2302B48A: void ota_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ota_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	aos_task_new(ra, s1, 587379874, 0x00, 0x01000000, a4, a5, s4, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2302B4A2: void tftp_ota_thread(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
void tftp_ota_thread(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	aos_task_exit(a2, a3, a4, a5, mstatus);
}

