pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302B4A8: void cat_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cat_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a2 != 0x02)
	{
		word32 a3_290;
		word32 a2_289;
		word32 a1_288;
		word32 s1_287;
		word32 a4_291;
		word32 a5_292;
		word32 a7_293;
		word32 s3_294;
		word32 s4_295;
		word32 s5_296;
		word32 s6_297;
		word32 s7_298;
		word32 s8_299;
		word32 s9_300;
		word32 s10_301;
		word32 s11_302;
		word32 t4_303;
		ra = printf(ra, &g_t23081164, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_287, out a0, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a7_293, out s2, out s3_294, out s4_295, out s5_296, out s6_297, out s7_298, out s8_299, out s9_300, out s10_301, out s11_302, out t4_303);
	}
	Eq_2 a0_49;
	ptr32 mstatus_73;
	word32 s6_286;
	word32 s3_285;
	word32 a5_283;
	word32 s0_282;
	word32 s2_284;
	Eq_2 a4_108;
	Eq_2 a3_122;
	Eq_2 ra_107 = aos_open(ra, a0, s2, mstatus, dwLoc1C, dwArg64, s1, dwArgD8, dwArg0118, dwArg0158, out s0_282, out a0_49, out a3_122, out a4_108, out a5_283, out s2_284, out s3_285, out s6_286, out mstatus_73);
	Eq_2 s0_105 = a0_49;
	if (a0_49 >= 0x00)
	{
		word32 s1_101 = 0x23081000;
		while (true)
		{
			word32 a0_110;
			word32 a1_362;
			word32 a2_363;
			word32 a4_364;
			word32 a5_365;
			Eq_2 ra_118 = aos_read(ra_107, s0_105, fp + ~0x10, a4_108, dwLoc20, dwArg24, out s0_105, out a0_110, out a1_362, out a2_363, out a4_364, out a5_365);
			if (a0_110 != 0x01)
				break;
			word32 a0_346;
			word32 a1_347;
			word32 a2_348;
			word32 a5_349;
			word32 a7_350;
			word32 s2_351;
			word32 s3_352;
			word32 s4_353;
			word32 s5_354;
			word32 s6_355;
			word32 s7_356;
			word32 s8_357;
			word32 s9_358;
			word32 s10_359;
			word32 s11_360;
			word32 t4_361;
			ra_107 = printf(ra_118, s1_101 + 400, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_101, out a0_346, out a1_347, out a2_348, out a3_122, out a4_108, out a5_349, out a7_350, out s2_351, out s3_352, out s4_353, out s5_354, out s6_355, out s7_356, out s8_357, out s9_358, out s10_359, out s11_360, out t4_361);
		}
		Eq_2 a2_127;
		Eq_2 a3_128;
		Eq_2 a4_129;
		struct Eq_7032 * s2_135;
		word32 s1_323;
		word32 a0_324;
		word32 a1_325;
		word32 a5_326;
		word32 a7_327;
		word32 s3_328;
		word32 s4_329;
		word32 s5_330;
		word32 s6_331;
		word32 s7_332;
		word32 s8_333;
		word32 s9_334;
		word32 s10_335;
		word32 s11_336;
		word32 t4_337;
		word32 a2_338;
		word32 a3_339;
		word32 a4_340;
		word32 a5_341;
		word32 s2_342;
		word32 s3_343;
		word32 s5_344;
		word32 s6_345;
		aos_close(printf(ra_118, &g_t230727FC, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_323, out a0_324, out a1_325, out a2_127, out a3_128, out a4_129, out a5_326, out a7_327, out s2_135, out s3_328, out s4_329, out s5_330, out s6_331, out s7_332, out s8_333, out s9_334, out s10_335, out s11_336, out t4_337), s0_105, a2_127, a3_128, a4_129, s2_135, mstatus_73, dwArg18, out a2_338, out a3_339, out a4_340, out a5_341, out s2_342, out s3_343, out s5_344, out s6_345);
	}
	else
	{
		word32 s1_304;
		word32 a0_305;
		word32 a1_306;
		word32 a2_307;
		word32 a3_308;
		word32 a4_309;
		word32 a5_310;
		word32 a7_311;
		word32 s2_312;
		word32 s3_313;
		word32 s4_314;
		word32 s5_315;
		word32 s6_316;
		word32 s7_317;
		word32 s8_318;
		word32 s9_319;
		word32 s10_320;
		word32 s11_321;
		word32 t4_322;
		printf(ra_107, &g_t2308117C, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_304, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out a7_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s7_317, out s8_318, out s9_319, out s10_320, out s11_321, out t4_322);
	}
}

// 2302B522: void hexdump_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0178)
void hexdump_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0178)
{
	if (a2 != 0x02)
	{
		word32 s1_292;
		word32 a1_293;
		word32 a2_294;
		word32 a3_295;
		word32 a4_296;
		word32 a5_297;
		word32 a7_298;
		word32 s3_299;
		word32 s4_300;
		word32 s5_301;
		word32 s6_302;
		word32 s7_303;
		word32 s8_304;
		word32 s9_305;
		word32 s10_306;
		word32 s11_307;
		word32 t4_308;
		ra = printf(ra, &g_t23081164, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_292, out a0, out a1_293, out a2_294, out a3_295, out a4_296, out a5_297, out a7_298, out s2, out s3_299, out s4_300, out s5_301, out s6_302, out s7_303, out s8_304, out s9_305, out s10_306, out s11_307, out t4_308);
	}
	Eq_2 a0_49;
	Eq_2 a3_57;
	ptr32 mstatus_73;
	word32 s0_286;
	word32 a4_287;
	word32 a5_288;
	word32 s2_289;
	word32 s3_290;
	word32 s6_291;
	Eq_2 ra_74 = aos_open(ra, a0, s2, mstatus, dwLoc1C, dwArg64, s1, dwArgD8, dwArg0118, dwArg0158, out s0_286, out a0_49, out a3_57, out a4_287, out a5_288, out s2_289, out s3_290, out s6_291, out mstatus_73);
	if (a0_49 < 0x00)
	{
		word32 s1_341;
		word32 a0_342;
		word32 a1_343;
		word32 a2_344;
		word32 a3_345;
		word32 a4_346;
		word32 a5_347;
		word32 a7_348;
		word32 s2_349;
		word32 s3_350;
		word32 s4_351;
		word32 s5_352;
		word32 s6_353;
		word32 s7_354;
		word32 s8_355;
		word32 s9_356;
		word32 s10_357;
		word32 s11_358;
		word32 t4_359;
		printf(ra_74, &g_t2308117C, a3_57, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_341, out a0_342, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a7_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
	}
	else
	{
		struct Eq_604 * a4_83;
		Eq_2 a3_94;
		Eq_2 a1_109;
		Eq_2 a3_111;
		Eq_2 s1_115;
		Eq_2 s10_116;
		Eq_2 a2_132;
		Eq_2 a3_133;
		Eq_2 a4_134;
		Eq_2 s0_139;
		struct Eq_7032 * s2_143;
		word32 t1_309;
		word32 a0_310;
		word32 a1_311;
		word32 a2_312;
		word32 a3_313;
		word32 a5_314;
		word32 s0_315;
		word32 a0_316;
		word32 a1_317;
		word32 a0_318;
		word32 a2_319;
		word32 a4_320;
		word32 a5_321;
		word32 a7_322;
		word32 s2_323;
		word32 s3_324;
		word32 s4_325;
		word32 s5_326;
		word32 s6_327;
		word32 s7_328;
		word32 s8_329;
		word32 s9_330;
		word32 s11_331;
		word32 t4_332;
		word32 a2_333;
		word32 a3_334;
		word32 a4_335;
		word32 a5_336;
		word32 s2_337;
		word32 s3_338;
		word32 s5_339;
		word32 s6_340;
		aos_close(utils_hexdump(printf(aos_ioctl(memset(ra_74, fp + ~0x17, 0x00, 0x08, out t1_309, out a0_310, out a1_311, out a2_312, out a3_313, out a4_83, out a5_314), a0_49, 0x01, fp + ~0x17, a4_83, dwLoc20, dwArg24, out s0_315, out a0_316, out a1_317, out a3_94), &g_t23081414, a3_94, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_115, out a0_318, out a1_109, out a2_319, out a3_111, out a4_320, out a5_321, out a7_322, out s2_323, out s3_324, out s4_325, out s5_326, out s6_327, out s7_328, out s8_329, out s9_330, out s10_116, out s11_331, out t4_332), s1_115, a1_109, a3_111, s10_116, dwArg10, dwArg14, dwArg5C, dwArg0178, out s0_139, out a2_132, out a3_133, out a4_134, out s2_143), s0_139, a2_132, a3_133, a4_134, s2_143, mstatus_73, dwArg18, out a2_333, out a3_334, out a4_335, out a5_336, out s2_337, out s3_338, out s5_339, out s6_340);
	}
}

// 2302B59A: Register Eq_2 aos_cli_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
Eq_2 aos_cli_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s3Out)
{
	Eq_2 a0_16;
	ptr32 s3_26;
	word32 s4_100;
	word32 s2_99;
	word32 a5_98;
	word32 a4_97;
	word32 a3_96;
	word32 s1_95;
	*a0_16 = aos_malloc(ra, s1, 0x0244, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_95, out a0_16, out a3_96, out a4_97, out a5_98, out s2_99, out s3_26, out s4_100);
	if (a0_16 != 0x00)
	{
		Eq_2 a4_39;
		word32 t1_101;
		word32 a0_102;
		word32 a1_103;
		word32 a2_104;
		word32 a3_105;
		word32 a5_106;
		ra = memset(ra, a0_16, 0x00, 0x0244, out t1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_39, out a5_106);
		g_t2308DED8 = a4_39;
		*((word32) a4_39 + 4) = 0x00;
		*(union Eq_2 *) 0xAAAAAC1B = a4_39;
		*(union Eq_2 *) ~0x555553E0 = a4_39;
		*(union Eq_2 *) 0x01 = a4_39;
	}
	s3Out = s3_26;
	return ra;
}

