pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302B5FC: Register word32 aos_cli_event_cb_read_get()
// Called from:
//      aos_loop_proc
word32 aos_cli_event_cb_read_get()
{
	return 587384856;
}

// 2302B606: Register word32 cli_putstr(Register Eq_2 ra, Register Eq_2 a0, Stack word32 dwArg24, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_137031) a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ps_cmd
//      aos_cli_printf
word32 cli_putstr(Eq_2 ra, Eq_2 a0, word32 dwArg24, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_137031 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a3_17;
	word32 a2_104;
	ptr32 a1_20;
	struct Eq_137031 * a4_18;
	ptr32 a5_19;
	Eq_2 a0_16 = strlen(a0, out a1_20, out a2_104, out a3_17, out a4_18, out a5_19);
	Eq_2 s0_23 = 0x00;
	while (s0_23 < a0_16)
	{
		int32 a0_36;
		word32 s0_40;
		ra = aos_write(ra, g_t4200DE1C, a0 + s0_23, a4_18, dwLoc20, dwArg24, out t1, out s0_40, out a0_36, out a1_20, out a4_18, out a5_19);
		if (a0_36 < 0x00)
			break;
		s0_23 = s0_40 + a0_36;
	}
	s1Out = a0_16;
	a1Out = a1_20;
	a2Out = dwArg48;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = a0;
	s3Out = 0x4200E000;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return t1;
}

// 2302B64C: void ps_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
void ps_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, word32 dwArg14, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgF8, word32 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	Eq_2 a0_17;
	Eq_2 s3_27;
	word32 s1_213;
	word32 a1_214;
	word32 a2_215;
	word32 a3_216;
	word32 a4_217;
	word32 a5_218;
	word32 a6_219;
	word32 s2_220;
	word32 s4_221;
	word32 s8_222;
	pvPortMalloc(ra, s1, 0x0600, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_213, out a0_17, out a1_214, out a2_215, out a3_216, out a4_217, out a5_218, out a6_219, out s2_220, out s3_27, out s4_221, out s8_222);
	if (a0_17 == 0x00)
		0x00 = dwArg38;
	else
	{
		word32 a4_223;
		word32 a5_224;
		strcpy(a0_17, &g_t23081680, out a4_223, out a5_224);
		word32 a1_225;
		word32 a2_226;
		word32 a3_227;
		word32 a4_228;
		word32 a5_229;
		word32 s0_49 = a0_17 + strlen(a0_17, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229);
		word32 a1_230;
		word32 a2_231;
		word32 a3_232;
		word32 a4_233;
		word32 a5_234;
		byte * a0_57 = strlen(0x23081680, out a1_230, out a2_231, out a3_232, out a4_233, out a5_234) - s0_49;
		while (s0_49 + a0_57 <= 0x0C)
		{
			s0_49->u1 = 0x20;
			s0_49 = (word32) s0_49 + 1;
			s0_49->u1 = 0x00;
		}
		word32 a4_235;
		word32 a5_236;
		strcpy(s0_49, &g_t23081688, out a4_235, out a5_236);
		Eq_2 a3_76;
		Eq_2 a4_77;
		Eq_2 a5_117;
		Eq_2 s1_121;
		word32 a1_237;
		word32 a2_238;
		word32 a5_239;
		word32 a1_240;
		word32 a2_241;
		word32 a3_242;
		word32 a4_243;
		word32 s2_244;
		word32 s3_245;
		word32 s4_246;
		word32 s8_247;
		cli_putstr(ra, vTaskList(ra, a0_17, strlen(0x23081688, out a1_237, out a2_238, out a3_76, out a4_77, out a5_239) + s0_49, a3_76, a4_77, s3_27, s5, s7, s9, mstatus, dwLoc08, dwArg00, dwArg04, dwArg24, dwArg68, dwArg8C, dwArgA8, dwArgB8, dwArgF8, dwArg0118, dwArg0138, dwArg0148, dwArg0188), dwArg14, out s1_121, out a1_240, out a2_241, out a3_242, out a4_243, out a5_117, out s2_244, out s3_245, out s4_246, out s8_247);
		0x00 = dwArg38;
		word32 s0_248;
		word32 s1_249;
		word32 a0_250;
		word32 a1_251;
		word32 a2_252;
		word32 a3_253;
		word32 a4_254;
		word32 a5_255;
		word32 a6_256;
		word32 s4_257;
		word32 t3_258;
		vPortFree(s1_121, dwArg10, a5_117, mstatus, dwArg0158, dwArg0198, out s0_248, out s1_249, out a0_250, out a1_251, out a2_252, out a3_253, out a4_254, out a5_255, out a6_256, out s4_257, out t3_258);
	}
}

// 2302B6DA: Register word32 aos_cli_printf(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register out ptr32 t1Out, Register out ptr32 a1Out, Register out (ptr32 Eq_137298) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_137301 a5Out, Register out ptr32 a7Out, Register out Eq_137303 s2Out, Register out (ptr32 word32) s3Out, Register out Eq_137305 s4Out, Register out ptr32 s5Out, Register out Eq_137307 s6Out, Register out (ptr32 (arr byte)) s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_137310) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      proc_onecmd
//      ls_cmd
//      uptime_cmd
//      reset_cmd
//      poweroff_cmd
//      reboot_cmd
//      version_cmd
//      devname_cmd
//      echo_cmd
//      mmem_cmd
//      pmem_cmd
//      help_cmd
//      cli_main_input
word32 aos_cli_printf(Eq_2 ra, struct Eq_274 * a0, ptr32 & t1Out, ptr32 & a1Out, struct Eq_137298 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_137301 & a5Out, ptr32 & a7Out, union Eq_137303 & s2Out, word32 & s3Out, union Eq_137305 & s4Out, ptr32 & s5Out, union Eq_137307 & s6Out, byte (& s7Out, ptr32 & s8Out, struct Eq_137310 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	word32 a0_186;
	word32 a1_187;
	word32 a2_188;
	word32 a3_189;
	word32 a4_190;
	word32 a5_191;
	ptr32 t1_103;
	Eq_2 ra_35 = memset(ra, fp + -304, 0x00, 0x0100, out t1_103, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191);
	Eq_2 a0_40 = 0x00;
	if ((word32) g_b4200DE19 != 0x00)
	{
		word32 a4_194;
		word32 a5_195;
		strcpy(fp + -304, &g_b420123EC, out a4_194, out a5_195);
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		a0_40 = strlen(1107370988, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200);
	}
	int32 a0_65;
	ptr32 a7_68;
	ptr32 s10_72;
	ptr32 s11_73;
	Eq_137307 s6_77;
	byte (* s7_78)[];
	struct Eq_137310 * s9_80;
	word32 t0_81;
	ptr32 t4_83;
	ptr32 s5_87;
	word32 s0_192;
	word32 s1_193;
	Eq_137305 s4_101;
	word32 * s3_100;
	Eq_137303 s2_155;
	Eq_137301 a5_149;
	ptr32 a3_147;
	ptr32 a4_148;
	ptr32 a1_145;
	struct Eq_137298 * a2_146;
	ptr32 s8_102;
	Eq_2 ra_69 = vsnprintf(ra_35, (word32) a0_40 + (fp + -304), 0x0100 - a0_40, a0, fp + -28, dwLocE8, dwLocC8, dwLoc9C, dwLoc80, dwLoc7C, dwLoc58, dwLoc34, out t0_81, out s0_192, out s1_193, out a0_65, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out a7_68, out s2_155, out s3_100, out s4_101, out s5_87, out s6_77, out s7_78, out s8_102, out s9_80, out s10_72, out s11_73, out t4_83);
	if (a0_65 > 0x00)
	{
		word32 s1_201;
		t1_103 = cli_putstr(ra_69, fp + -304, dwLoc011C, out s1_201, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out s2_155, out s3_100, out s4_101, out s8_102);
	}
	t1Out = t1_103;
	a1Out = a1_145;
	a2Out = a2_146;
	a3Out = a3_147;
	a4Out = a4_148;
	a5Out = a5_149;
	a7Out = a7_68;
	s2Out = s2_155;
	s3Out = s3_100;
	s4Out = s4_101;
	s5Out = s5_87;
	s6Out = s6_77;
	s7Out = s7_78;
	s8Out = s8_102;
	s9Out = s9_80;
	s10Out = s10_72;
	s11Out = s11_73;
	t4Out = t4_83;
	return t0_81;
}

