pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302BB94: void reboot_cmd(Register Eq_2 ra, Register ptr32 mstatus)
void reboot_cmd(Eq_2 ra, ptr32 mstatus)
{
	word32 t1_35;
	word32 a1_36;
	word32 a2_37;
	word32 a3_38;
	word32 a4_39;
	word32 a5_40;
	word32 a7_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s5_45;
	word32 s6_46;
	word32 s7_47;
	word32 s8_48;
	word32 s9_49;
	word32 s10_50;
	word32 s11_51;
	word32 t4_52;
	aos_cli_printf(ra, &g_t230816F0, out t1_35, out a1_36, out a2_37, out a3_38, out a4_39, out a5_40, out a7_41, out s2_42, out s3_43, out s4_44, out s5_45, out s6_46, out s7_47, out s8_48, out s9_49, out s10_50, out s11_51, out t4_52);
	hal_reboot(mstatus);
}

// 2302BBAC: void version_cmd(Register Eq_2 ra)
void version_cmd(Eq_2 ra)
{
	word32 a7_233;
	word32 s2_234;
	word32 a4_231;
	word32 a5_232;
	word32 a2_229;
	word32 a3_230;
	word32 t1_227;
	word32 a1_228;
	word32 s3_235;
	word32 s4_236;
	word32 s5_237;
	word32 s6_238;
	word32 s7_239;
	word32 s8_240;
	word32 s9_241;
	word32 s10_242;
	word32 s11_243;
	word32 t4_244;
	aos_cli_printf(ra, &g_t230818A4, out t1_227, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232, out a7_233, out s2_234, out s3_235, out s4_236, out s5_237, out s6_238, out s7_239, out s8_240, out s9_241, out s10_242, out s11_243, out t4_244);
	word32 t1_245;
	word32 a1_246;
	word32 a2_247;
	word32 a3_248;
	word32 a4_249;
	word32 a5_250;
	word32 a7_251;
	word32 s2_252;
	word32 s3_253;
	word32 s4_254;
	word32 s5_255;
	word32 s6_256;
	word32 s7_257;
	word32 s8_258;
	word32 s9_259;
	word32 s10_260;
	word32 s11_261;
	word32 t4_262;
	aos_cli_printf(ra, &g_t230724F0, out t1_245, out a1_246, out a2_247, out a3_248, out a4_249, out a5_250, out a7_251, out s2_252, out s3_253, out s4_254, out s5_255, out s6_256, out s7_257, out s8_258, out s9_259, out s10_260, out s11_261, out t4_262);
	union Eq_2 * a4_68;
	word32 t1_263;
	word32 a1_264;
	word32 a2_265;
	word32 a3_266;
	word32 a5_267;
	word32 a7_268;
	word32 s2_269;
	word32 s3_270;
	word32 s4_271;
	word32 s5_272;
	word32 s6_273;
	word32 s7_274;
	word32 s8_275;
	word32 s9_276;
	word32 s10_277;
	word32 s11_278;
	word32 t4_279;
	aos_cli_printf(ra, &g_t230727FC, out t1_263, out a1_264, out a2_265, out a3_266, out a4_68, out a5_267, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s7_274, out s8_275, out s9_276, out s10_277, out s11_278, out t4_279);
	int32 a0_90 = bl_chip_memory_ram(fp + -72, fp + -56, fp + -40, a4_68, dwLoc18);
	if (a0_90 == 0x00)
	{
		word32 t1_280;
		word32 a1_281;
		word32 a2_282;
		word32 a3_283;
		word32 a4_284;
		word32 a7_285;
		word32 s2_286;
		word32 s3_287;
		word32 s4_288;
		word32 s5_289;
		word32 s6_290;
		word32 s7_291;
		word32 s8_292;
		word32 s9_293;
		word32 s10_294;
		word32 s11_295;
		word32 t4_296;
		int32 a5_107;
		aos_cli_printf(ra, &g_t230818D4, out t1_280, out a1_281, out a2_282, out a3_283, out a4_284, out a5_107, out a7_285, out s2_286, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
		int32 s0_129;
		word32 s2_125 = 0x23082000;
		for (s0_129 = a0_90; s0_129 < a5_107; ++s0_129)
		{
			word32 t1_315;
			word32 a1_316;
			word32 a2_317;
			word32 a3_318;
			word32 a4_319;
			word32 a7_320;
			word32 s3_321;
			word32 s4_322;
			word32 s5_323;
			word32 s6_324;
			word32 s7_325;
			word32 s8_326;
			word32 s9_327;
			word32 s10_328;
			word32 s11_329;
			word32 t4_330;
			aos_cli_printf(ra, s2_125 + -1800, out t1_315, out a1_316, out a2_317, out a3_318, out a4_319, out a5_107, out a7_320, out s2_125, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325, out s8_326, out s9_327, out s10_328, out s11_329, out t4_330);
		}
	}
	xPortGetFreeHeapSize();
	word32 t1_297;
	word32 a1_298;
	word32 a2_299;
	word32 a3_300;
	word32 a4_301;
	word32 a5_302;
	word32 a7_303;
	word32 s2_304;
	word32 s3_305;
	word32 s4_306;
	word32 s5_307;
	word32 s6_308;
	word32 s7_309;
	word32 s8_310;
	word32 s9_311;
	word32 s10_312;
	word32 s11_313;
	word32 t4_314;
	aos_cli_printf(ra, &g_t230818BC, out t1_297, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a7_303, out s2_304, out s3_305, out s4_306, out s5_307, out s6_308, out s7_309, out s8_310, out s9_311, out s10_312, out s11_313, out t4_314);
}

// 2302BC4E: void devname_cmd(Register Eq_2 ra)
void devname_cmd(Eq_2 ra)
{
	word32 t1_30;
	word32 a1_31;
	word32 a2_32;
	word32 a3_33;
	word32 a4_34;
	word32 a5_35;
	word32 a7_36;
	word32 s2_37;
	word32 s3_38;
	word32 s4_39;
	word32 s5_40;
	word32 s6_41;
	word32 s7_42;
	word32 s8_43;
	word32 s9_44;
	word32 s10_45;
	word32 s11_46;
	word32 t4_47;
	aos_cli_printf(ra, &g_t23081330, out t1_30, out a1_31, out a2_32, out a3_33, out a4_34, out a5_35, out a7_36, out s2_37, out s3_38, out s4_39, out s5_40, out s6_41, out s7_42, out s8_43, out s9_44, out s10_45, out s11_46, out t4_47);
}

// 2302BC62: void echo_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2)
void echo_cmd(Eq_2 ra, Eq_2 a0, word32 a2)
{
	if (a2 != 0x01)
	{
		word32 a2_215;
		word32 a4_217;
		word32 a3_216;
		word32 a1_214;
		word32 a5_218;
		Eq_2 a0_17 = strcmp(a0, 0x2307E0B0, out a1_214, out a2_215, out a3_216, out a4_217, out a5_218);
		if (a0_17 == 0x00)
		{
			word32 t1_242;
			word32 a1_243;
			word32 a2_244;
			word32 a3_245;
			word32 a4_246;
			word32 a5_247;
			word32 a7_248;
			word32 s2_249;
			word32 s3_250;
			word32 s4_251;
			word32 s5_252;
			word32 s6_253;
			word32 s7_254;
			word32 s8_255;
			word32 s9_256;
			word32 s10_257;
			word32 s11_258;
			word32 t4_259;
			aos_cli_printf(ra, &g_t23081384, out t1_242, out a1_243, out a2_244, out a3_245, out a4_246, out a5_247, out a7_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253, out s7_254, out s8_255, out s9_256, out s10_257, out s11_258, out t4_259);
			*((word32) g_t4200DE10 + 4) = 0x00;
		}
		else
		{
			word32 a1_237;
			word32 a2_238;
			word32 a3_239;
			word32 a4_240;
			word32 a5_241;
			if (strcmp(a0_17, 587718880, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241) == 0x00)
			{
				word32 t1_260;
				word32 a1_261;
				word32 a2_262;
				word32 a3_263;
				word32 a4_264;
				word32 a5_265;
				word32 a7_266;
				word32 s2_267;
				word32 s3_268;
				word32 s4_269;
				word32 s5_270;
				word32 s6_271;
				word32 s7_272;
				word32 s8_273;
				word32 s9_274;
				word32 s10_275;
				word32 s11_276;
				word32 t4_277;
				aos_cli_printf(ra, &g_t23081394, out t1_260, out a1_261, out a2_262, out a3_263, out a4_264, out a5_265, out a7_266, out s2_267, out s3_268, out s4_269, out s5_270, out s6_271, out s7_272, out s8_273, out s9_274, out s10_275, out s11_276, out t4_277);
				*(union Eq_2 *) 0x05 = g_t4200DE10;
			}
		}
	}
	else
	{
		*((word32) g_t4200DE10 + 4) != 0x00;
		word32 t1_219;
		word32 a1_220;
		word32 a2_221;
		word32 a3_222;
		word32 a4_223;
		word32 a5_224;
		word32 a7_225;
		word32 s2_226;
		word32 s3_227;
		word32 s4_228;
		word32 s5_229;
		word32 s6_230;
		word32 s7_231;
		word32 s8_232;
		word32 s9_233;
		word32 s10_234;
		word32 s11_235;
		word32 t4_236;
		aos_cli_printf(ra, &g_t23081358, out t1_219, out a1_220, out a2_221, out a3_222, out a4_223, out a5_224, out a7_225, out s2_226, out s3_227, out s4_228, out s5_229, out s6_230, out s7_231, out s8_232, out s9_233, out s10_234, out s11_235, out t4_236);
	}
}

// 2302BCFE: void mmem_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_139474) a3, Stack word32 dwArg38)
void mmem_cmd(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_139474 * a3, word32 dwArg38)
{
	Eq_2 s0_58;
	Eq_2 s1_16;
	if (a2 != 0x03)
	{
		if (a2 != 0x04)
		{
			if (a2 != 0x02)
				goto l2302BD4C;
			s0_58.u0 = 0x00;
			s1_16.u0 = 0x04;
l2302BD3C:
			union Eq_139591 * a2_69;
			word32 a1_240;
			word32 a3_241;
			word32 a4_242;
			word32 a5_243;
			Eq_2 a0_67 = strtol(a3->t0004, null, 0x00, out a1_240, out a2_69, out a3_241, out a4_242, out a5_243);
			if (a0_67 != 0x00)
			{
				if (s1_16 != 0x01)
				{
					if (s1_16 != 0x02)
						*s0_58.u0 = *a2_69;
					else
						*a0_67 = (word16) (word32) (word16) s0_58;
				}
				else
					*a0_67 = (byte) (s0_58 & 0x00FF);
				0x00 = dwArg38;
				word32 t1_267;
				word32 a1_268;
				word32 a2_269;
				word32 a3_270;
				word32 a4_271;
				word32 a5_272;
				word32 a7_273;
				word32 s2_274;
				word32 s3_275;
				word32 s4_276;
				word32 s5_277;
				word32 s6_278;
				word32 s7_279;
				word32 s8_280;
				word32 s9_281;
				word32 s10_282;
				word32 s11_283;
				word32 t4_284;
				aos_cli_printf(ra, &g_t23081560, out t1_267, out a1_268, out a2_269, out a3_270, out a4_271, out a5_272, out a7_273, out s2_274, out s3_275, out s4_276, out s5_277, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out t4_284);
				return;
			}
l2302BD4C:
			0x00 = dwArg38;
			word32 t1_249;
			word32 a1_250;
			word32 a2_251;
			word32 a3_252;
			word32 a4_253;
			word32 a5_254;
			word32 a7_255;
			word32 s2_256;
			word32 s3_257;
			word32 s4_258;
			word32 s5_259;
			word32 s6_260;
			word32 s7_261;
			word32 s8_262;
			word32 s9_263;
			word32 s10_264;
			word32 s11_265;
			word32 t4_266;
			aos_cli_printf(ra, &g_t230814D8, out t1_249, out a1_250, out a2_251, out a3_252, out a4_253, out a5_254, out a7_255, out s2_256, out s3_257, out s4_258, out s5_259, out s6_260, out s7_261, out s8_262, out s9_263, out s10_264, out s11_265, out t4_266);
			return;
		}
		word32 a4_238;
		word32 a3_237;
		word32 a2_236;
		word32 a1_235;
		word32 a5_239;
		s1_16 = strtol(a0, null, 0x00, out a1_235, out a2_236, out a3_237, out a4_238, out a5_239);
	}
	else
		s1_16.u0 = 0x04;
	word32 a1_244;
	word32 a2_245;
	word32 a3_246;
	word32 a4_247;
	word32 a5_248;
	s0_58 = strtol(a3->t0008, null, 0x00, out a1_244, out a2_245, out a3_246, out a4_247, out a5_248);
	goto l2302BD3C;
}

// 2302BDC2: void pmem_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_139652) a3, Stack word32 dwArg0198)
void pmem_cmd(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_139652 * a3, word32 dwArg0198)
{
	Eq_2 s1_437;
	Eq_2 s2_108;
	Eq_2 a5_104;
	if (a2 != 0x03)
	{
		if (a2 != 0x04)
		{
			a5_104.u0 = 0x02;
			s2_108.u0 = 0x04;
			s1_437.u0 = 0x10;
			if (a2 != 0x02)
				goto l2302BE02;
			goto l2302BDF4;
		}
		word32 a1_795;
		word32 a5_799;
		word32 a2_796;
		word32 a3_797;
		word32 a4_798;
		s2_108 = strtol(a0, null, 0x00, out a1_795, out a2_796, out a3_797, out a4_798, out a5_799);
	}
	else
		s2_108.u0 = 0x04;
	word32 a3_806;
	word32 a4_807;
	word32 a5_808;
	word32 a2_805;
	word32 a1_804;
	Eq_2 a0_56 = strtol(a3->t0008, null, 0x00, out a1_804, out a2_805, out a3_806, out a4_807, out a5_808);
	s1_437 = a0_56;
	if (a0_56 > 0x0400)
		s1_437.u0 = 0x0400;
l2302BDF4:
	word32 a3_802;
	word32 a4_803;
	word32 a1_800;
	word32 a2_801;
	strtol(a3->t0004, fp + -52, 0x00, out a1_800, out a2_801, out a3_802, out a4_803, out a5_104);
l2302BE02:
	if (a5_104 != 0x00 && a5_104 != a3->t0004)
	{
		if (s2_108 != 0x01)
		{
			if (s2_108 != 0x02)
			{
				Eq_2 s2_294 = 0x00;
				word32 s4_295 = 0x23081000;
				word32 s5_296 = 0x23081000;
				while (s2_294 < s1_437)
				{
					if ((s2_294 & 3) == 0x00)
					{
						word32 t1_839;
						word32 a1_840;
						word32 a2_841;
						word32 a3_842;
						word32 a4_843;
						word32 a5_844;
						word32 a7_845;
						word32 s2_846;
						word32 s3_847;
						word32 s4_848;
						word32 s6_849;
						word32 s7_850;
						word32 s8_851;
						word32 s9_852;
						word32 s10_853;
						word32 s11_854;
						word32 t4_855;
						aos_cli_printf(ra, s4_295 + 1588, out t1_839, out a1_840, out a2_841, out a3_842, out a4_843, out a5_844, out a7_845, out s2_846, out s3_847, out s4_848, out s5_296, out s6_849, out s7_850, out s8_851, out s9_852, out s10_853, out s11_854, out t4_855);
					}
					word32 s3_349;
					word32 s6_352;
					word32 s7_353;
					word32 t1_827;
					word32 a3_830;
					word32 a1_828;
					word32 a2_829;
					word32 a5_832;
					word32 a7_833;
					word32 a4_831;
					word32 s9_835;
					word32 s10_836;
					word32 s8_834;
					word32 s11_837;
					word32 t4_838;
					word32 s2_348;
					aos_cli_printf(ra, s5_296 + 1612, out t1_827, out a1_828, out a2_829, out a3_830, out a4_831, out a5_832, out a7_833, out s2_348, out s3_349, out s4_295, out s5_296, out s6_352, out s7_353, out s8_834, out s9_835, out s10_836, out s11_837, out t4_838);
					if (s3_349 == s6_352)
					{
						word32 t1_856;
						word32 a1_857;
						word32 a2_858;
						word32 a3_859;
						word32 a4_860;
						word32 a5_861;
						word32 a7_862;
						word32 s3_863;
						word32 s6_864;
						word32 s7_865;
						word32 s8_866;
						word32 s9_867;
						word32 s10_868;
						word32 s11_869;
						word32 t4_870;
						aos_cli_printf(ra, s7_353 + 2044, out t1_856, out a1_857, out a2_858, out a3_859, out a4_860, out a5_861, out a7_862, out s2_348, out s3_863, out s4_295, out s5_296, out s6_864, out s7_865, out s8_866, out s9_867, out s10_868, out s11_869, out t4_870);
					}
					s2_294 = s2_348 + 0x01;
				}
			}
			else
			{
				Eq_2 s2_203 = 0x00;
				word32 s4_204 = 0x23081000;
				word32 s5_205 = 0x23081000;
				while (s2_203 < s1_437)
				{
					if ((s2_203 & 7) == 0x00)
					{
						word32 t1_912;
						word32 a1_913;
						word32 a2_914;
						word32 a3_915;
						word32 a4_916;
						word32 a5_917;
						word32 a7_918;
						word32 s2_919;
						word32 s3_920;
						word32 s4_921;
						word32 s6_922;
						word32 s7_923;
						word32 s8_924;
						word32 s9_925;
						word32 s10_926;
						word32 s11_927;
						word32 t4_928;
						aos_cli_printf(ra, s4_204 + 1588, out t1_912, out a1_913, out a2_914, out a3_915, out a4_916, out a5_917, out a7_918, out s2_919, out s3_920, out s4_921, out s5_205, out s6_922, out s7_923, out s8_924, out s9_925, out s10_926, out s11_927, out t4_928);
					}
					word32 s3_257;
					word32 s6_260;
					word32 s7_261;
					word32 t1_900;
					word32 a1_901;
					word32 a2_902;
					word32 a3_903;
					word32 a4_904;
					word32 a5_905;
					word32 a7_906;
					word32 s8_907;
					word32 s9_908;
					word32 s10_909;
					word32 s11_910;
					word32 t4_911;
					word32 s2_256;
					aos_cli_printf(ra, s5_205 + 0x0644, out t1_900, out a1_901, out a2_902, out a3_903, out a4_904, out a5_905, out a7_906, out s2_256, out s3_257, out s4_204, out s5_205, out s6_260, out s7_261, out s8_907, out s9_908, out s10_909, out s11_910, out t4_911);
					if (s3_257 == s6_260)
					{
						word32 t1_944;
						word32 a1_945;
						word32 a2_946;
						word32 a3_947;
						word32 a4_948;
						word32 a5_949;
						word32 a7_950;
						word32 s3_951;
						word32 s6_952;
						word32 s7_953;
						word32 s8_954;
						word32 s9_955;
						word32 s10_956;
						word32 s11_957;
						word32 t4_958;
						aos_cli_printf(ra, s7_261 + 2044, out t1_944, out a1_945, out a2_946, out a3_947, out a4_948, out a5_949, out a7_950, out s2_256, out s3_951, out s4_204, out s5_205, out s6_952, out s7_953, out s8_954, out s9_955, out s10_956, out s11_957, out t4_958);
					}
					s2_203 = s2_256 + 0x01;
				}
			}
		}
		else
		{
			Eq_2 s2_111 = 0x00;
			word32 s5_112 = 0x23081000;
			word32 s6_113 = 0x23081000;
			while (s2_111 < s1_437)
			{
				if ((s2_111 & 0x0F) == 0x00)
				{
					word32 t1_883;
					word32 a1_884;
					word32 a2_885;
					word32 a3_886;
					word32 a4_887;
					word32 a5_888;
					word32 a7_889;
					word32 s2_890;
					word32 s3_891;
					word32 s4_892;
					word32 s5_893;
					word32 s7_894;
					word32 s8_895;
					word32 s9_896;
					word32 s10_897;
					word32 s11_898;
					word32 t4_899;
					aos_cli_printf(ra, s5_112 + 1588, out t1_883, out a1_884, out a2_885, out a3_886, out a4_887, out a5_888, out a7_889, out s2_890, out s3_891, out s4_892, out s5_893, out s6_113, out s7_894, out s8_895, out s9_896, out s10_897, out s11_898, out t4_899);
				}
				word32 s3_165;
				word32 s7_169;
				word32 s8_170;
				word32 t1_871;
				word32 a1_872;
				word32 a2_873;
				word32 a3_874;
				word32 a4_875;
				word32 a5_876;
				word32 a7_877;
				word32 s4_878;
				word32 s9_879;
				word32 s10_880;
				word32 s11_881;
				word32 t4_882;
				word32 s2_164;
				aos_cli_printf(ra, s6_113 + 0x063C, out t1_871, out a1_872, out a2_873, out a3_874, out a4_875, out a5_876, out a7_877, out s2_164, out s3_165, out s4_878, out s5_112, out s6_113, out s7_169, out s8_170, out s9_879, out s10_880, out s11_881, out t4_882);
				if (s3_165 == s7_169)
				{
					word32 t1_929;
					word32 a1_930;
					word32 a2_931;
					word32 a3_932;
					word32 a4_933;
					word32 a5_934;
					word32 a7_935;
					word32 s3_936;
					word32 s4_937;
					word32 s7_938;
					word32 s8_939;
					word32 s9_940;
					word32 s10_941;
					word32 s11_942;
					word32 t4_943;
					aos_cli_printf(ra, s8_170 + 2044, out t1_929, out a1_930, out a2_931, out a3_932, out a4_933, out a5_934, out a7_935, out s2_164, out s3_936, out s4_937, out s5_112, out s6_113, out s7_938, out s8_939, out s9_940, out s10_941, out s11_942, out t4_943);
				}
				s2_111 = s2_164 + 0x01;
			}
		}
	}
	else
	{
		word32 s6_820;
		word32 s3_817;
		word32 s4_818;
		word32 s7_821;
		word32 s11_825;
		word32 t4_826;
		word32 s5_819;
		word32 s10_824;
		word32 s9_823;
		word32 s8_822;
		word32 s2_816;
		word32 a4_813;
		word32 a5_814;
		word32 a7_815;
		word32 a1_810;
		word32 a2_811;
		word32 a3_812;
		word32 t1_809;
		aos_cli_printf(ra, &g_t23081598, out t1_809, out a1_810, out a2_811, out a3_812, out a4_813, out a5_814, out a7_815, out s2_816, out s3_817, out s4_818, out s5_819, out s6_820, out s7_821, out s8_822, out s9_823, out s10_824, out s11_825, out t4_826);
	}
	0x00 = dwArg0198;
}

// 2302BF3A: void help_cmd(Register Eq_2 ra, Stack word32 dwArgA8)
void help_cmd(Eq_2 ra, word32 dwArgA8)
{
	word32 s5_410;
	word32 s6_411;
	word32 a4_404;
	word32 a2_402;
	word32 s2_407;
	word32 a5_405;
	word32 t1_400;
	word32 a1_401;
	word32 a3_403;
	word32 s4_409;
	word32 a7_406;
	word32 s3_408;
	word32 t4_417;
	word32 s10_415;
	word32 s8_413;
	word32 s7_412;
	word32 s9_414;
	word32 s11_416;
	aos_cli_printf(ra, &g_t230813A4, out t1_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405, out a7_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416, out t4_417);
	word32 s7_428;
	word32 s6_427;
	word32 s5_426;
	word32 s8_429;
	word32 s10_431;
	word32 s4_425;
	word32 s9_430;
	word32 s11_432;
	word32 t4_433;
	word32 a5_421;
	word32 a3_419;
	word32 t1_418;
	word32 a4_420;
	word32 s3_424;
	word32 a7_422;
	word32 s2_423;
	word32 * a1_249;
	struct Eq_140212 * a2_252;
	aos_cli_printf(ra, &g_t230813C0, out t1_418, out a1_249, out a2_252, out a3_419, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
	word32 s4_101 = 587784824;
	word32 s5_102 = 0x23081000;
	do
	{
		word32 s0_112 = *a1_249;
		if (a1_249 != null)
		{
			s0_112 = a2_252->dw0004;
			word32 s7_442;
			word32 t1_434;
			word32 a7_438;
			word32 a5_437;
			word32 s2_439;
			word32 s6_441;
			word32 s3_440;
			word32 a3_435;
			word32 a4_436;
			word32 s8_443;
			word32 s9_444;
			word32 s10_445;
			word32 s11_446;
			word32 t4_447;
			aos_cli_printf(ra, s5_102 + 1008, out t1_434, out a1_249, out a2_252, out a3_435, out a4_436, out a5_437, out a7_438, out s2_439, out s3_440, out s4_101, out s5_102, out s6_441, out s7_442, out s8_443, out s9_444, out s10_445, out s11_446, out t4_447);
		}
	} while (s0_112 + 0x0C != s4_101);
	word32 t1_448;
	word32 a1_449;
	word32 a2_450;
	word32 a3_451;
	word32 a4_452;
	word32 a5_453;
	word32 a7_454;
	word32 s2_455;
	word32 s3_456;
	word32 s4_457;
	word32 s5_458;
	word32 s6_459;
	word32 s7_460;
	word32 s8_461;
	word32 s9_462;
	word32 s10_463;
	word32 s11_464;
	word32 t4_465;
	aos_cli_printf(ra, &g_t230727FC, out t1_448, out a1_449, out a2_450, out a3_451, out a4_452, out a5_453, out a7_454, out s2_455, out s3_456, out s4_457, out s5_458, out s6_459, out s7_460, out s8_461, out s9_462, out s10_463, out s11_464, out t4_465);
	word32 t1_466;
	word32 a1_467;
	word32 a2_468;
	word32 a4_469;
	word32 a7_470;
	word32 s2_471;
	word32 s4_472;
	word32 s5_473;
	word32 s6_474;
	word32 s7_475;
	word32 s8_476;
	word32 s9_477;
	word32 s10_478;
	word32 s11_479;
	word32 t4_480;
	word32 a5_150;
	Eq_2 a3_148;
	struct Eq_137594 * s3_155;
	aos_cli_printf(ra, &g_t230813FC, out t1_466, out a1_467, out a2_468, out a3_148, out a4_469, out a5_150, out a7_470, out s2_471, out s3_155, out s4_472, out s5_473, out s6_474, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480);
	Eq_2 s2_167 = 0x10;
	Eq_2 s0_168 = 0x00;
	word32 s6_170 = 0x23081000;
	while (true)
	{
		Eq_2 a5_177 = a5_150 + 0x08;
		if (s0_168 >= a5_177 || s2_167 >= a5_177)
			break;
		word32 a2_186;
		word32 a4_481;
		struct Eq_137594 * a0_184 = cli_command_get(s0_168, 0x00, a3_148, out a2_186, out a4_481, out a5_150);
		if ((a0_184 < &g_t2308E1B8 || a0_184 >= s3_155) && false)
		{
			word32 s2_214;
			word32 t1_482;
			word32 a1_483;
			word32 a2_484;
			word32 a4_485;
			word32 a7_486;
			word32 s4_487;
			word32 s5_488;
			word32 s7_489;
			word32 s8_490;
			word32 s9_491;
			word32 s10_492;
			word32 s11_493;
			word32 t4_494;
			aos_cli_printf(ra, s6_170 + 1008, out t1_482, out a1_483, out a2_484, out a3_148, out a4_485, out a5_150, out a7_486, out s2_214, out s3_155, out s4_487, out s5_488, out s6_170, out s7_489, out s8_490, out s9_491, out s10_492, out s11_493, out t4_494);
			s2_167 = s2_214 + 0x01;
		}
		s0_168 = (word32) s0_168 + 1;
	}
	0x00 = dwArgA8;
}

