pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302C01C: Register Eq_2 cli_getchar(Register Eq_2 ra, Register ptr32 a0, Stack (ptr32 Eq_140435) dwArg34, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      cli_main_input
Eq_2 cli_getchar(Eq_2 ra, ptr32 a0, struct Eq_140435 * dwArg34, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a0_39;
	word32 a5_82;
	word32 a4_81;
	word32 a3_80;
	word32 a2_79;
	word32 a1_78;
	word32 a0_77;
	word32 t1_76;
	Eq_2 ra_20 = memset(ra, fp + -76, 0x00, 60, out t1_76, out a0_77, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82);
	up32 a0_29;
	ptr32 s4_32;
	ptr32 s8_33;
	word32 a2_83;
	word32 a4_84;
	word32 a5_85;
	ptr32 s0_30 = hal_uart_recv_II(fp + -76, a0, (struct Eq_140435 *) 0x01, fp + -80, dwArg34, out a0_29, out a2_83, out a4_84, out a5_85, out s4_32, out s8_33);
	ptr32 dwLoc4C_57 = SEQ(nLoc4B, 0x00);
	if (a0_29 == 0x00)
	{
		0x00 = dwLoc0C;
		a0_39 = (word32) (a0_29 < ~0x01);
	}
	else
		a0_39 = 0x00;
	s0Out = s0_30;
	s1Out = dwLoc4C_57;
	a0Out = a0_39;
	s4Out = s4_32;
	s8Out = s8_33;
	return ra_20;
}

// 2302C05A: void cli_main_input(Register Eq_2 ra, Register (ptr32 Eq_140435) s0, Register (ptr32 (arr byte)) a0, Register int32 a5, Register Eq_2 s6, Register word32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack word32 dwArgB8, Stack Eq_2 dwArgD8)
// Called from:
//      console_cb_read
void cli_main_input(Eq_2 ra, struct Eq_140435 * s0, byte (* a0)[], int32 a5, Eq_2 s6, word32 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg98, word32 dwArgB8, Eq_2 dwArgD8)
{
	struct Eq_274 * a0_1252;
	Eq_2 s9_113 = g_t4200DE10;
	byte bLoc50_1465 = (byte) s10;
	if (s9_113 != 0x38)
	{
		byte s7_111[] = a0;
		Eq_2 s1_103 = 0x4200DE10;
		int32 s4_108 = 0x00;
		word32 s8_112 = 0x23072000;
		do
		{
			Eq_2 s0_54;
			if (s7_111 != null)
			{
				s0_54 = dwArg74;
				if (s4_108 >= a5)
					return;
				++s4_108;
				bLoc50_1465 = (byte) (word32) s7_111[s4_108];
			}
			else
			{
				word32 a0_47;
				ra = cli_getchar(ra, fp + -80, s0, out s0_54, out s1_103, out a0_47, out s4_108, out s8_112);
				if (a0_47 != 0x01)
					return;
			}
			struct Eq_140593 * a4_72 = (word32) bLoc50_1465;
			if (a4_72 == (struct Eq_140593 *) 0x0A || a4_72 == (struct Eq_140593 *) 0x0D)
			{
				int32 s2_779 = *s1_103;
				Mem782[s0_54 + Mem71[s9_113 + 52:int32]:byte] = 0x00;
				((word32) s9_113 + 52)->u0 = 0x00;
				word32 a4_2863;
				word32 a5_2864;
				word32 a1_2860;
				word32 a3_2862;
				word32 a2_2861;
				if (strlen(s2_779 + 56, out a1_2860, out a2_2861, out a3_2862, out a4_2863, out a5_2864) != 0x00)
				{
					word32 s6_815;
					Eq_2995 a2_826;
					Eq_2 a1_827;
					int32 s3_792 = *s1_103;
					struct Eq_140608 * a5_798;
					word32 a4_2868;
					word32 a3_2867;
					word32 a2_2866;
					word32 a1_2865;
					Eq_2 a0_795 = strlen(s3_792 + 56, out a1_2865, out a2_2866, out a3_2867, out a4_2868, out a5_798);
					int32 s0_804 = a5_798->dw0140;
					a5_798->dw013C = s0_804;
					int32 s0_808 = s0_804 + ((word32) a0_795 + 1);
					Eq_2995 s4_806 = 0x0100 - s0_804;
					Eq_2 a0_809 = a5_798 + (s0_804 + 0x0144) / 0x0144;
					int32 s0_810 = s0_808 + ~0x00;
					if (s4_806 >= (word32) a0_795 + 1)
					{
						s6_815 = (word32) (&(a5_798 + (s0_808 + ~0x00) / 0x0144)->dw0140)[1];
						a2_826 = (word32) a0_795 + 1;
						a1_827 = s3_792 + 56;
					}
					else
					{
						s0_810 = s0_808 + ~0x00 | 0x0100;
						s6_815 = (word32) (&(a5_798 + s0_810 / 0x0144)->dw0140)[1];
						word32 a3_2973;
						word32 a4_2974;
						word32 a5_2975;
						strncpy(a0_809, s3_792 + 56, s4_806, out a3_2973, out a4_2974, out a5_2975);
						a2_826 = (word32) a0_795 + 1 - s4_806;
						a1_827 = (word32) s4_806.u0 + (s3_792 + 56);
						a0_809 = (word32) a0_809 + 0x0144;
					}
					struct Eq_141136 * a4_836;
					word32 a5_2977;
					word32 a3_2976;
					strncpy(a0_809, a1_827, a2_826, out a3_2976, out a4_836, out a5_2977);
					int32 s0_846 = s0_810 + 0x01;
					a4_836->dw0140 = s0_846 | 0x0100;
					ui32 s0_848 = s0_846 | 0x0100;
					if (s6_815 != 0x00)
					{
						while (true)
						{
							struct Eq_141135 * a5_856 = a4_836 + s0_848 / 0x0144;
							if ((word32) a5_856->b0144 == 0x00)
								break;
							a5_856->b0144 = 0x00;
							s0_848 = s0_848 + 0x01 | 0x0100;
						}
					}
				}
				word32 a4_2881;
				word32 a3_2886;
				word32 a3_2873;
				word32 a0_2870;
				word32 a1_2871;
				word32 a2_2872;
				word32 t1_2869;
				word32 a2_2879;
				word32 a4_2874;
				word32 a5_2882;
				word32 a1_2878;
				word32 a0_2877;
				word32 t1_2876;
				word32 a3_2880;
				word32 a5_2875;
				word32 a4_2887;
				word32 a1_2884;
				word32 a2_2885;
				word32 a5_2888;
				word32 t1_2883;
				Eq_2 a0_1013;
				ra = memset(memset(memset(ra, 1107370732, 0x00, 0x0100, out t1_2869, out a0_2870, out a1_2871, out a2_2872, out a3_2873, out a4_2874, out a5_2875), fp + -80, 0x00, 0x10, out t1_2876, out a0_2877, out a1_2878, out a2_2879, out a3_2880, out a4_2881, out a5_2882), fp + -84, 0x00, 0x04, out t1_2883, out a0_1013, out a1_2884, out a2_2885, out a3_2886, out a4_2887, out a5_2888);
				struct Eq_140705 * a5_1028 = null;
				int32 * s11_1048 = fp + -80;
				int32 s8_1044 = 0x00;
				Eq_2 s6_1123 = 32;
				do
				{
					Eq_2 a7_1002;
					ui32 a3_943;
					Eq_2 s0_924 = a5_1028 + (s2_779 + 56);
					Eq_140716 a3_926 = (word32) *s0_924;
					if (a3_926 != 32)
					{
						if (a3_926 <= 32)
						{
							if (a3_926 != 0x00)
								goto l2302C13A;
							ui32 a3_1049 = (word32) bLoc54;
							if ((a3_1049 & 2) != 0x00)
								goto l2302C80A;
							bLoc54 = (byte) (a3_1049 | 4);
							goto l2302C6C4;
						}
						if (a3_926 != 0x0022)
						{
							if (a3_926 == 59)
							{
								ui32 a3_992 = (word32) bLoc54;
								if (a5_1028 != null)
								{
									a7_1002 = (char *) a5_1028 - 1 + (s2_779 + 56);
									if ((word32) *a7_1002 == 92 && (a3_992 & 1) != 0x00)
										goto l2302C76C;
								}
								if ((a3_992 & 0x02) != 0x00)
									goto l2302C80A;
								if ((a3_992 & 0x02 & 0x03) == 0x01)
								{
									s0_924->u1 = 0x00;
									bLoc54 = (byte) ((word32) bLoc54 & ~0x01);
									if (*s11_1048 != 0x00)
									{
										++s8_1044;
										if (s8_1044 <= 0x03)
											s11_1048 = (s8_1044 << 0x02) + (fp + -80);
									}
								}
							}
							else
							{
l2302C13A:
								ui32 a3_1055 = (word32) bLoc54;
								if ((a3_1055 & 1) == 0x00)
								{
									int32 a2_1058 = *s11_1048;
									*s11_1048 = a2_1058 + 1;
									*s0_924 = ((s8_1044 << 0x04) + a2_1058 << 2) + 1107370732;
									bLoc54 = (byte) (a3_1055 | 1);
								}
							}
							goto l2302C6C4;
						}
						if (a5_1028 != null)
						{
							a7_1002 = (char *) a5_1028 - 1 + (s2_779 + 56);
							a3_926 = (word32) *a7_1002;
							if (a3_926 != 92)
								goto l2302C78A;
							ui32 a3_948 = (word32) bLoc54;
							a3_926 = a3_948 & 0x01;
							if ((a3_948 & 0x01) != 0x00)
								goto l2302C76C;
						}
l2302C78A:
						ui32 a3_954 = a3_926 & 0x03;
						if (a3_954 == 0x01)
							goto l2302C6C4;
						if (a3_954 == 0x02)
							goto l2302C80A;
						if (a3_954 == 0x00)
						{
							int32 a2_972 = *s11_1048;
							*s11_1048 = a2_972 + 1;
							(a5_1028 + 1)[s2_779 + 56] = (struct Eq_140705) (((s8_1044 << 0x04) + a2_972 << 2) + 1107370732);
							bLoc54 = (byte) ((word32) bLoc54 & ~0x03 | 3);
							goto l2302C6C4;
						}
						if (a3_954 != 0x03)
							goto l2302C6C4;
						a3_943 = (word32) bLoc54 & ~0x03;
						goto l2302C7D0;
					}
					if (a5_1028 != null)
					{
						a7_1002 = (char *) a5_1028 - 1 + (s2_779 + 56);
						a3_926 = (word32) *a7_1002;
						if (a3_926 != 92)
							goto l2302C7F4;
						ui32 a3_933 = (word32) bLoc54;
						a3_926 = a3_933 & 0x01;
						if ((a3_933 & 0x01) == 0x00)
							goto l2302C7F4;
l2302C76C:
						struct Eq_140705 * a6_1020;
						word32 a1_2967;
						word32 a2_2963;
						word32 a1_2962;
						word32 a3_2964;
						word32 a2_2968;
						word32 a3_2969;
						word32 a5_2966;
						word32 a4_2965;
						word32 a4_2970;
						word32 a5_2971;
						word32 a7_2972;
						memcpy(a7_1002, s6, (word32) strlen(s0_924, out a1_2962, out a2_2963, out a3_2964, out a4_2965, out a5_2966) + 1, out a1_2967, out a2_2968, out a3_2969, out a4_2970, out a5_2971, out a6_1020, out a7_2972);
						a0_1013 = a7_1002;
						a5_1028 = a6_1020;
					}
					else
					{
l2302C7F4:
						if ((a3_926 & 0x03) == 0x01)
						{
							a3_943 = (word32) bLoc54 & ~0x01;
l2302C7D0:
							s0_924->u1 = 0x00;
							bLoc54 = (byte) a3_943;
						}
					}
l2302C6C4:
					ui32 a3_1073 = (word32) bLoc54;
					if ((a3_1073 & 4) != 0x00)
						break;
					++a5_1028;
				} while (a5_1028 <= (struct Eq_140705 *) 0x00FF && (s8_1044 <= 0x03 && *s11_1048 <= 0x0F));
				Eq_2 a3_1098 = a3_1073 & 0x02;
				if ((a3_1073 & 0x02) == 0x00)
				{
					Eq_2 s3_1111 = 0x00;
					do
					{
						word32 s2_1137;
						ui32 s3_1138;
						int32 s4_1139;
						int32 s5_1140;
						int32 s8_1142;
						word32 s0_2907;
						ra = proc_onecmd(ra, a0_1013, a3_1098, s3_1111, s6_1123, mstatus, 0x00, 0x00, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, dwArg98, dwArgB8, dwArgD8, out s0_2907, out a0_1013, out a3_1098, out s2_1137, out s3_1138, out s4_1139, out s5_1140, out s6_1123, out s8_1142, out mstatus);
						s3_1111 = s3_1138 | a0_1013;
					} while (s8_1142 >= s4_1139 && s4_1139 != s5_1140);
					if (s3_1111 == 0x01)
					{
						if (s2_1137 != 0x00)
						{
							word32 s7_2938;
							word32 t4_2943;
							word32 a1_2927;
							word32 a2_2928;
							word32 a5_2931;
							word32 a4_2930;
							word32 a3_2929;
							word32 a7_2932;
							word32 s3_2934;
							word32 s6_2937;
							word32 s4_2935;
							word32 s5_2936;
							word32 s2_2933;
							word32 t1_2926;
							word32 s11_2942;
							word32 s10_2941;
							word32 s9_2940;
							word32 s8_2939;
							aos_cli_printf(ra, &g_t230812D0, out t1_2926, out a1_2927, out a2_2928, out a3_2929, out a4_2930, out a5_2931, out a7_2932, out s2_2933, out s3_2934, out s4_2935, out s5_2936, out s6_2937, out s7_2938, out s8_2939, out s9_2940, out s10_2941, out s11_2942, out t4_2943);
						}
						goto l2302C72C;
					}
					if (s3_1111 != 0x02)
					{
l2302C72C:
						word32 s7_2920;
						word32 s9_2922;
						word32 s8_2921;
						word32 s2_2915;
						word32 a2_2910;
						word32 t1_2908;
						word32 a1_2909;
						word32 a3_2911;
						word32 a5_2913;
						word32 s4_2917;
						word32 s3_2916;
						word32 s5_2918;
						word32 a7_2914;
						word32 s6_2919;
						word32 t4_2925;
						word32 a4_2912;
						word32 s11_2924;
						word32 s10_2923;
						aos_cli_printf(ra, &g_t230727FC, out t1_2908, out a1_2909, out a2_2910, out a3_2911, out a4_2912, out a5_2913, out a7_2914, out s2_2915, out s3_2916, out s4_2917, out s5_2918, out s6_2919, out s7_2920, out s8_2921, out s9_2922, out s10_2923, out s11_2924, out t4_2925);
						g_b420123EC = 0x00;
						g_b4200EE19 = 0x00;
						a0_1252 = (struct Eq_274 *) &g_t230812A4;
						goto l2302C170;
					}
				}
l2302C80A:
				word32 a1_2890;
				word32 a3_2892;
				word32 a2_2891;
				word32 t1_2889;
				word32 a4_2893;
				word32 t4_2906;
				word32 s8_2902;
				word32 s9_2903;
				word32 s4_2898;
				word32 s10_2904;
				word32 s6_2900;
				word32 s3_2897;
				word32 s5_2899;
				word32 s11_2905;
				word32 a5_2894;
				word32 a7_2895;
				word32 s2_2896;
				word32 s7_2901;
				aos_cli_printf(ra, &g_t230812EC, out t1_2889, out a1_2890, out a2_2891, out a3_2892, out a4_2893, out a5_2894, out a7_2895, out s2_2896, out s3_2897, out s4_2898, out s5_2899, out s6_2900, out s7_2901, out s8_2902, out s9_2903, out s10_2904, out s11_2905, out t4_2906);
				goto l2302C72C;
			}
			a5 = 0x4200E000;
			union Eq_102059 * s2_588 = &g_b4200DE18;
			if (a4_72 == (struct Eq_140593 *) 0x1B)
			{
				g_b4200DE18 = 0x01;
				g_b4200E93C = ~0x00;
				g_b4200E93D = ~0x00;
				continue;
			}
			if ((int32) g_b4200DE18 != 0x00)
			{
				struct Eq_274 * a0_632;
				Eq_2 a3_628;
				int32 a1_439 = (int32) g_b4200D93C;
				if (a1_439 >= 0x00)
				{
					if ((int32) g_b4200D93D < 0x00)
					{
						int32 a2_444 = (int32) (byte) a4_72;
						g_b4200D93D = (byte) a2_444;
						if (a2_444 == 116)
						{
							g_b420123EC = 0x1B;
							g_b420123ED = (byte) a1_439;
							g_b4200EE19 = 0x02;
						}
					}
					struct Eq_141282 * a2_456 = (int32) g_b4200D93D;
					if (((a2_456 & 0x00FF) + -65 & 0x00FF) > 0x01)
					{
						byte * s5_613 = &g_b420123EC;
						byte * s3_614 = &g_b4200DE19;
						if (a2_456 != (struct Eq_141282 *) 116)
						{
							Mem665[Mem455[s9_113 + 52:int32] + s0_54:byte] = 0x1B;
							Eq_2 a4_666 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_666 + 1;
							((word32) s0_54 + ((word32) a4_666 + 1))->u1 = (byte) a1_439;
							Eq_2 a4_672 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_672 + 1;
							((word32) s0_54 + ((word32) a4_672 + 1))->u1 = (byte) (a2_456 & 0x00FF);
							Eq_2 a4_677 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_677 + 1;
							s1_103 = *((word32) a4_677 + 1);
							if (*((word32) a4_677 + 5) == 0x00)
							{
								word32 a1_3082;
								word32 a7_3086;
								word32 a2_3083;
								word32 t4_3090;
								word32 s10_3088;
								word32 s11_3089;
								word32 s6_3087;
								word32 a3_3084;
								word32 a4_3085;
								word32 a0_3081;
								ra = printf(ra, &g_t2308125C, 0x1B, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3081, out a1_3082, out a2_3083, out a3_3084, out a4_3085, out a5, out a7_3086, out s2_588, out s3_614, out s4_108, out s5_613, out s6_3087, out s7_111, out s8_112, out s9_113, out s10_3088, out s11_3089, out t4_3090);
							}
							*s5_613 = 0x00;
							*s3_614 = 0x00;
						}
						else
						{
							Eq_2 a3_615 = (word32) g_b4200DE19;
							if (a3_615 > 63)
							{
								g_b420123EC = 0x00;
								g_b4200DE19 = 0x00;
								g_b4200DE18 = 0x00;
								word32 a7_3131;
								word32 t4_3138;
								word32 s3_3133;
								word32 s5_3134;
								word32 s6_3135;
								word32 s10_3136;
								word32 s11_3137;
								word32 s2_3132;
								word32 a3_3129;
								word32 a4_3130;
								word32 a0_3126;
								word32 a1_3127;
								word32 a2_3128;
								ra = printf(ra, &g_t2308126C, a3_615, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3126, out a1_3127, out a2_3128, out a3_3129, out a4_3130, out a5, out a7_3131, out s2_3132, out s3_3133, out s4_108, out s5_3134, out s6_3135, out s7_111, out s8_112, out s9_113, out s10_3136, out s11_3137, out t4_3138);
								continue;
							}
							((word32) a3_615 + 1107370988)->u1 = (byte) a4_72;
							word32 a2_619 = a3_615 + 1 & 0x00FF;
							g_b4200DE19 = (byte) a2_619;
							if (a4_72 != (struct Eq_140593 *) 0x006D)
								continue;
							s1_103 = a4_72->t0000;
							a2_619->b420123EC = 0x00;
							word32 a4_627 = a4_72->dw0004;
							Mem629[1107353113:byte] = SLICE(a3_615 + 0x02, byte, 0);
							a3_628 = a3_615 + 0x02;
							if (a4_627 == 0x00)
							{
								a0_632 = (struct Eq_274 *) &g_t23085CD8;
l2302C1FA:
								word32 s10_3165;
								word32 t4_3167;
								word32 s11_3166;
								word32 s6_3164;
								word32 a3_3159;
								word32 a4_3160;
								word32 a7_3161;
								word32 s3_3162;
								word32 s5_3163;
								word32 a2_3158;
								word32 a0_3156;
								word32 a1_3157;
								ra = printf(ra, a0_632, a3_628, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3156, out a1_3157, out a2_3158, out a3_3159, out a4_3160, out a5, out a7_3161, out s2_588, out s3_3162, out s4_108, out s5_3163, out s6_3164, out s7_111, out s8_112, out s9_113, out s10_3165, out s11_3166, out t4_3167);
							}
						}
					}
					else
					{
						Eq_2 a3_464;
						Eq_2 a4_492;
						if (a2_456 == (struct Eq_141282 *) 65)
						{
							a3_464 = (a2_456 & 0x00FF)->t013C;
							int32 a4_507 = (word32) a3_464 + 0x00FF;
							while (true)
							{
								Eq_2 a4_510 = a4_507 | 0x0100;
								if (CONVERT(Mem455[(a2_456 & 0x00FF) + a4_510 + 0x0144:byte], byte, word32) != 0x00)
									break;
								if (a3_464 == a4_510)
									goto l2302C2E8;
								a4_507 = (word32) a4_510 + 0x00FF;
							}
							if (a3_464 != a4_510)
							{
								do
								{
									int32 a4_518 = (word32) a4_510 + 0x00FF;
									a4_510 = a4_518 | 0x0100;
								} while ((word32) ((word32) (a2_456 & 0x00FF) + (a4_518 | 0x0100) + 0x0144) != 0x00);
								a4_510 = (a4_518 | 0x0100) + 0x01 | 0x0100;
							}
l2302C2E8:
							(a2_456 & 0x00FF)->t013C = a4_510;
							a4_492 = s0_54;
							while (true)
							{
								word32 a2_540 = CONVERT(Mem539[(a2_456 & 0x00FF) + a3_464 + 0x0144:byte], byte, word32);
								if (a2_540 == 0x00)
									break;
								++a4_492;
								((word32) a4_492 + 0x0FFF)->u1 = (byte) a2_540;
								a3_464 = (word32) a3_464 + 1 | 0x0100;
							}
						}
						else
						{
							a3_464 = a2_456->t013C;
							Eq_2 a4_465 = a3_464;
							while (CONVERT(Mem455[a2_456 + a4_465 + 0x0144:byte], byte, word32) != 0x00)
								a4_465 = (word32) a4_465 + 1 | 0x0100;
							if (a3_464 != a4_465)
							{
								do
								{
									int32 a4_477 = (word32) a4_465 + 1;
									a4_465 = a4_477 | 0x0100;
								} while ((word32) *((char *) &(a2_456 + (a4_477 | 0x0100) / 320)->t013C + 8) == 0x00);
							}
							a2_456->t013C = a4_465;
							a4_492 = s0_54;
							while (true)
							{
								word32 a1_497 = CONVERT(Mem496[a2_456 + a3_464 + 0x0144:byte], byte, word32);
								if (a1_497 == 0x00)
									break;
								++a4_492;
								((word32) a4_492 + 0x0FFF)->u1 = (byte) a1_497;
								a3_464 = (word32) a3_464 + 1 | 0x0100;
							}
						}
						a4_492->u1 = 0x00;
						word32 a1_3140;
						word32 s10_3149;
						word32 t4_3151;
						word32 s11_3150;
						word32 s5_3147;
						word32 s6_3148;
						word32 a3_3142;
						word32 a4_3143;
						word32 a5_3144;
						word32 a7_3145;
						word32 s3_3146;
						word32 a2_3141;
						word32 a0_3139;
						ra = printf(ra, &g_t23081264, a3_464, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3139, out a1_3140, out a2_3141, out a3_3142, out a4_3143, out a5_3144, out a7_3145, out s2_588, out s3_3146, out s4_108, out s5_3147, out s6_3148, out s7_111, out s8_112, out s9_113, out s10_3149, out s11_3150, out t4_3151);
						word32 a1_3152;
						word32 a2_3153;
						word32 a3_3154;
						word32 a4_3155;
						*((word32) s9_113 + 52) = strlen(s0_54, out a1_3152, out a2_3153, out a3_3154, out a4_3155, out a5);
						g_b420123EC = 0x00;
						g_b4200EE19 = 0x00;
					}
l2302C1FE:
					*s2_588 = (union Eq_102059 *) 0x00;
					continue;
				}
				else
				{
					int32 a1_711 = (int32) (byte) a4_72;
					g_b4200D93C = (byte) a1_711;
					if (a1_711 == 91)
						continue;
					Mem716[Mem712[s9_113 + 52:int32] + s0_54:byte] = 0x1B;
					Eq_2 a3_717 = *((word32) s9_113 + 52);
					*((word32) s9_113 + 52) = (word32) a3_717 + 1;
					a3_628 = (word32) s0_54 + ((word32) a3_717 + 1);
					a3_628->u1 = (byte) a4_72;
					Eq_2 a4_722 = *((word32) s9_113 + 52);
					*((word32) s9_113 + 52) = (word32) a4_722 + 1;
					s1_103 = *((word32) a4_722 + 1);
					if (*((word32) a4_722 + 5) != 0x00)
						goto l2302C1FE;
					a0_632 = (struct Eq_274 *) &g_t23081258;
					goto l2302C1FA;
				}
			}
			Mem84[Mem71[s9_113 + 52:int32] + s0_54:byte] = SLICE(a4_72, byte, 0);
			Eq_2 a3_413 = 0x08;
			if (a4_72 == (struct Eq_140593 *) 0x08)
			{
l2302C434:
				Eq_2 a4_403 = *((word32) s9_113 + 52);
				if (a4_403 != 0x00)
				{
					*((word32) s9_113 + 52) = (word32) a4_403 - 1;
					s1_103 = *((word32) a4_403 - 1);
					if (*((word32) a4_403 + 3) == 0x00)
					{
						word32 s5_2986;
						word32 s3_2985;
						word32 a3_2981;
						word32 a1_2979;
						word32 a0_2978;
						word32 a7_2983;
						word32 s2_2984;
						word32 s6_2987;
						word32 s10_2988;
						word32 s11_2989;
						word32 t4_2990;
						word32 a2_2980;
						word32 a4_2982;
						ra = printf(ra, &g_t23081290, a3_413, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_2978, out a1_2979, out a2_2980, out a3_2981, out a4_2982, out a5, out a7_2983, out s2_2984, out s3_2985, out s4_108, out s5_2986, out s6_2987, out s7_111, out s8_112, out s9_113, out s10_2988, out s11_2989, out t4_2990);
					}
				}
				continue;
			}
			a3_413.u0 = 0x007F;
			if (a4_72 == (struct Eq_140593 *) 0x007F)
				goto l2302C434;
			if (a4_72 == (struct Eq_140593 *) 0x09)
			{
				Mem178[Mem84[s9_113 + 52:int32] + s0_54:byte] = 0x00;
				word32 s5_2998;
				word32 s6_2999;
				word32 a2_2993;
				word32 t1_2991;
				word32 a1_2992;
				word32 s11_3002;
				word32 s10_3001;
				word32 s4_2997;
				word32 a7_2995;
				word32 a5_2994;
				word32 s7_3000;
				word32 t4_3003;
				word32 s2_2996;
				word32 s8_194;
				Eq_2 a3_1331;
				word32 a4_1335;
				struct Eq_141435 * s9_1340;
				Eq_2 s3_1352;
				aos_cli_printf(ra, s8_112 + 2044, out t1_2991, out a1_2992, out a2_2993, out a3_1331, out a4_1335, out a5_2994, out a7_2995, out s2_2996, out s3_1352, out s4_2997, out s5_2998, out s6_2999, out s7_3000, out s8_194, out s9_1340, out s10_3001, out s11_3002, out t4_3003);
				int32 s2_1344 = 0x00;
				Eq_2 s6_1337 = 0x00;
				Eq_2 s5_203 = 0x00;
				int32 s10_1346 = 0x01;
				int32 s11_1348 = 0x02;
				while (true)
				{
					s1_103 = *a3_1331;
					Eq_2 a4_211 = a4_1335 + 0x08;
					if (s5_203 >= a4_211)
						break;
					a3_1331 = *((word32) a4_211 + 48);
					if (s6_1337 >= a4_211)
						break;
					word32 a5_3005;
					word32 a2_3004;
					cli_command_get(s5_203, 0x00, a3_1331, out a2_3004, out a4_1335, out a5_3005);
					if (false)
					{
						word32 a2_3050;
						word32 a5_3051;
						word32 a1_3049;
						if (strncmp(s0_54, 0x00, s9_1340->t0034, out a1_3049, out a2_3050, out a3_1331, out a4_1335, out a5_3051) == 0x00)
						{
							++s2_1344;
							a4_1335 = (word32) *dwArg54;
							if (s2_1344 != s10_1346)
							{
								if (s2_1344 == s11_1348)
								{
									word32 t1_3060;
									word32 a1_3061;
									word32 a5_3063;
									word32 a7_3064;
									word32 s4_3065;
									word32 s7_3066;
									word32 t4_3067;
									word32 a2_3062;
									aos_cli_printf(ra, &g_t23081298, out t1_3060, out a1_3061, out a2_3062, out a3_1331, out a4_1335, out a5_3063, out a7_3064, out s2_1344, out s3_1352, out s4_3065, out s5_203, out s6_1337, out s7_3066, out s8_194, out s9_1340, out s10_1346, out s11_1348, out t4_3067);
								}
								else
								{
									word32 a7_3056;
									word32 t4_3059;
									word32 s4_3057;
									word32 s7_3058;
									word32 a2_3054;
									word32 a5_3055;
									word32 a1_3053;
									word32 t1_3052;
