pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
									aos_cli_printf(ra, &g_t230812A0, out t1_3052, out a1_3053, out a2_3054, out a3_1331, out a4_1335, out a5_3055, out a7_3056, out s2_1344, out s3_1352, out s4_3057, out s5_203, out s6_1337, out s7_3058, out s8_194, out s9_1340, out s10_1346, out s11_1348, out t4_3059);
								}
							}
							else
								s3_1352 = dwArg54;
						}
						s6_1337 = (word32) s6_1337 + 1;
					}
					s5_203 = (word32) s5_203 + 1;
				}
				if (s2_1344 == 0x01)
				{
					if (s3_1352 != 0x00)
					{
						word32 a3_3021;
						word32 a1_3019;
						word32 a2_3020;
						word32 a5_3023;
						word32 a4_3022;
						Eq_2 a0_334 = strlen(s3_1352, out a1_3019, out a2_3020, out a3_3021, out a4_3022, out a5_3023);
						if (a0_334 <= 0x00FF)
						{
							Eq_2 a4_343 = s9_1340->t0034;
							Eq_2 s2_344 = a0_334 - a4_343;
							word32 a4_3027;
							word32 a5_3028;
							word32 a1_3024;
							word32 a2_3025;
							word32 a7_3030;
							word32 a6_3029;
							word32 a3_3026;
							memcpy(s0_54 + a4_343, s3_1352 + a4_343, s2_344, out a1_3024, out a2_3025, out a3_3026, out a4_3027, out a5_3028, out a6_3029, out a7_3030);
							word32 s2_363 = s2_344 + Mem207[s9_1340 + 52:int32];
							s9_1340->t0034 = (word32) s2_363 + 1;
							Mem368[s2_363 + s0_54:byte] = 0x20;
							Mem371[Mem368[s9_1340 + 52:int32] + s0_54:byte] = 0x00;
						}
					}
				}
				else if (s2_1344 > 0x01)
				{
					word32 a3_3034;
					word32 s7_3043;
					word32 s9_3045;
					word32 s10_3046;
					word32 s11_3047;
					word32 t4_3048;
					word32 s8_3044;
					word32 s6_3042;
					word32 s4_3040;
					word32 s5_3041;
					word32 a2_3033;
					word32 t1_3031;
					word32 a1_3032;
					word32 a5_3036;
					word32 a4_3035;
					word32 a7_3037;
					word32 s2_3038;
					word32 s3_3039;
					aos_cli_printf(ra, s8_194 + 2044, out t1_3031, out a1_3032, out a2_3033, out a3_3034, out a4_3035, out a5_3036, out a7_3037, out s2_3038, out s3_3039, out s4_3040, out s5_3041, out s6_3042, out s7_3043, out s8_3044, out s9_3045, out s10_3046, out s11_3047, out t4_3048);
				}
				word32 a2_3008;
				word32 t1_3006;
				word32 a1_3007;
				word32 s10_3016;
				word32 a4_3010;
				word32 a3_3009;
				word32 a7_3011;
				word32 s2_3012;
				word32 s3_3013;
				word32 s5_3014;
				word32 s6_3015;
				word32 s11_3017;
				word32 t4_3018;
				aos_cli_printf(ra, &g_t230812A8, out t1_3006, out a1_3007, out a2_3008, out a3_3009, out a4_3010, out a5, out a7_3011, out s2_3012, out s3_3013, out s4_108, out s5_3014, out s6_3015, out s7_111, out s8_112, out s9_113, out s10_3016, out s11_3017, out t4_3018);
				continue;
			}
			s1_103 = *(union Eq_2 *) 0x09;
			Eq_2 a3_89 = *(union Eq_2 *) 0x0D;
			if (a3_89 == 0x00)
			{
				word32 a1_3069;
				word32 t4_3080;
				word32 a3_3071;
				word32 s5_3076;
				word32 s6_3077;
				word32 s11_3079;
				word32 s10_3078;
				word32 a4_3072;
				word32 a7_3073;
				word32 s3_3075;
				word32 s2_3074;
				word32 a2_3070;
				word32 a0_3068;
				ra = printf(ra, &g_t23081190, a3_89, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3068, out a1_3069, out a2_3070, out a3_3071, out a4_3072, out a5, out a7_3073, out s2_3074, out s3_3075, out s4_108, out s5_3076, out s6_3077, out s7_111, out s8_112, out s9_113, out s10_3078, out s11_3079, out t4_3080);
			}
			Eq_2 a4_118 = *((word32) s9_113 + 52);
			*((word32) s9_113 + 52) = (word32) a4_118 + 1;
		} while (a4_118 <= ~0xFD);
		word32 s8_3104;
		word32 s10_3106;
		word32 s11_3107;
		word32 t4_3108;
		word32 s9_3105;
		word32 t1_3091;
		word32 s6_3102;
		word32 s7_3103;
		word32 a2_3093;
		word32 s2_3098;
		word32 s3_3099;
		word32 s5_3101;
		word32 s4_3100;
		word32 a3_3094;
		word32 a4_3095;
		word32 a7_3097;
		word32 a5_3096;
		word32 a1_3092;
		aos_cli_printf(ra, &g_t230812B0, out t1_3091, out a1_3092, out a2_3093, out a3_3094, out a4_3095, out a5_3096, out a7_3097, out s2_3098, out s3_3099, out s4_3100, out s5_3101, out s6_3102, out s7_3103, out s8_3104, out s9_3105, out s10_3106, out s11_3107, out t4_3108);
		struct Eq_141903 * s9_165;
		word32 a4_3113;
		word32 s8_3122;
		word32 s11_3124;
		word32 t4_3125;
		word32 s10_3123;
		word32 s6_3120;
		word32 s7_3121;
		word32 a7_3115;
		word32 s2_3116;
		word32 s3_3117;
		word32 s4_3118;
		word32 s5_3119;
		word32 a5_3114;
		word32 a2_3111;
		word32 a3_3112;
		word32 t1_3109;
		word32 a1_3110;
		aos_cli_printf(ra, &g_t230812A4, out t1_3109, out a1_3110, out a2_3111, out a3_3112, out a4_3113, out a5_3114, out a7_3115, out s2_3116, out s3_3117, out s4_3118, out s5_3119, out s6_3120, out s7_3121, out s8_3122, out s9_165, out s10_3123, out s11_3124, out t4_3125);
		s9_165->dw0034 = 0x00;
	}
	else
	{
		a0_1252 = (struct Eq_274 *) &g_t23081248;
l2302C170:
		word32 a7_2950;
		word32 s3_2952;
		word32 a4_2948;
		word32 a3_2947;
		word32 s4_2953;
		word32 s5_2954;
		word32 a5_2949;
		word32 a1_2945;
		word32 s10_2959;
		word32 a2_2946;
		word32 s2_2951;
		word32 s8_2957;
		word32 t1_2944;
		word32 s7_2956;
		word32 s6_2955;
		word32 s9_2958;
		word32 t4_2961;
		word32 s11_2960;
		aos_cli_printf(ra, a0_1252, out t1_2944, out a1_2945, out a2_2946, out a3_2947, out a4_2948, out a5_2949, out a7_2950, out s2_2951, out s3_2952, out s4_2953, out s5_2954, out s6_2955, out s7_2956, out s8_2957, out s9_2958, out s10_2959, out s11_2960, out t4_2961);
	}
}

// 2302C818: void console_cb_read(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s6, Register word32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack word32 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8)
void console_cb_read(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s6, word32 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, word32 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8)
{
	int32 a0_13;
	struct Eq_140435 * s0_17;
	word32 a1_152;
	word32 a2_153;
	word32 a4_154;
	word32 a5_155;
	Eq_2 ra_21 = aos_read(ra, a0, fp + ~0x1F, a4, dwLoc20, dwArg24, out s0_17, out a0_13, out a1_152, out a2_153, out a4_154, out a5_155);
	if (a0_13 > 0x00)
	{
		if (a0_13 <= 0x10)
		{
			g_ptr4200EE1C = s0_17;
			cli_main_input(ra_21, s0_17, fp + ~0x1F, 0x4200E000, s6, s10, mstatus, dwLoc20, dwLoc1C, dwLoc04, dwArg08, dwArg2C, dwArg34, dwArg54, dwArg78, dwArg98, dwArgB8);
		}
		else
		{
			word32 s1_156;
			word32 a0_157;
			word32 a1_158;
			word32 a2_159;
			word32 a3_160;
			word32 a4_161;
			word32 a5_162;
			word32 a7_163;
			word32 s2_164;
			word32 s3_165;
			word32 s4_166;
			word32 s5_167;
			word32 s6_168;
			word32 s7_169;
			word32 s8_170;
			word32 s9_171;
			word32 s10_172;
			word32 s11_173;
			word32 t4_174;
			printf(ra_21, &g_t230812FC, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_156, out a0_157, out a1_158, out a2_159, out a3_160, out a4_161, out a5_162, out a7_163, out s2_164, out s3_165, out s4_166, out s5_167, out s6_168, out s7_169, out s8_170, out s9_171, out s10_172, out s11_173, out t4_174);
		}
	}
}

// 2302C858: void get_dns_request(Register Eq_2 ra, Register (ptr32 Eq_142325) a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register word32 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
void get_dns_request(Eq_2 ra, struct Eq_142325 * a0, word32 a1, Eq_2 a2, Eq_2 a3, word32 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	uint16 wLoc4C = (uint16) dwLoc4C;
	a0->dw0108 = a1;
	a0->t010C = a3;
	a0->w0110 = (word16) a4;
	Eq_2 a4_101 = (word32) *((word32) a2 + 8);
	Eq_2 s1_117 = a2;
	if (a4_101 > 11)
	{
		Eq_2 s1_43;
		word32 s8_739;
		word32 s2_736;
		word32 s4_738;
		word32 s3_737;
		word32 a0_730;
		word32 a2_732;
		word32 a1_731;
		word32 a3_733;
		word32 a5_735;
		word32 a4_734;
		Eq_2 s0_39 = pbuf_copy_partial(a2, fp + -76, 0x0C, 0x00, out s1_43, out a0_730, out a1_731, out a2_732, out a3_733, out a4_734, out a5_735, out s2_736, out s3_737, out s4_738, out s8_739);
		word32 a5_740;
		*((word32) s0_39 + 0x0100) = (word16) lwip_htons((word32) wLoc4C, out a5_740);
		word32 a5_741;
		*((word32) s0_39 + 258) = (word16) lwip_htons((word32) wLoc48, out a5_741);
		Eq_142541 a2_64 = (word32) *((word32) s1_43 + 8);
		if (a2_64 > 0x00FF)
			a2_64.u0 = 0x00FF;
		word32 s3_748;
		word32 s8_749;
		word32 a0_742;
		word32 a2_744;
		word32 a1_743;
		word32 a4_745;
		word32 s2_747;
		word32 a5_746;
		Eq_2 s0_80 = pbuf_copy_partial(s1_43, s0_39, (word32) (word16) a2_64, 0x0C, out s1_117, out a0_742, out a1_743, out a2_744, out a3, out a4_745, out a5_746, out s2_747, out s3_748, out s4, out s8_749);
		Eq_142573 a5_102;
		if (utils_dns_domain_get(s0_80, s0_80, fp + -80, out a4_101, out a5_102) == 0x00)
		{
			0x00 = dwArg94;
			if (a5_102 > 0x00)
			{
				a5_102 = (word32) a5_102 - 1;
				a3 = (word32) *((word32) s0_80 + ((word32) a5_102 - 1));
				a4_101.u0 = 46;
			}
			0x00 = dwArg94;
			Mem116[a5_102 + s0_80:byte] = 0x00;
		}
	}
	Eq_2 s0_137;
	Eq_2 a3_141;
	Eq_2 a4_142;
	Eq_2 s1_144;
	ptr32 mstatus_158;
	struct Eq_142370 * a0_163;
	struct Eq_142371 * s0_168;
	ptr32 mstatus_179;
	word32 s5_727;
	word32 s8_729;
	word32 s6_728;
	word32 s2_724;
	word32 s4_726;
	word32 s3_725;
	word32 a4_721;
	word32 a7_723;
	word32 a5_722;
	word32 s1_717;
	word32 a1_718;
	word32 a3_720;
	word32 a2_719;
	word32 s5_714;
	word32 s8_716;
	word32 s6_715;
	word32 s4_713;
	word32 s3_712;
	word32 s2_711;
	word32 a7_710;
	word32 a0_706;
	word32 a1_707;
	word32 a5_709;
	word32 a2_708;
	Eq_2 ra_180 = pbuf_alloc(pbuf_free(ra, s1_117, a3, a4_101, s4, mstatus, dwArgD8, out s0_137, out s1_144, out a0_706, out a1_707, out a2_708, out a3_141, out a4_142, out a5_709, out a7_710, out s2_711, out s3_712, out s4_713, out s5_714, out s6_715, out s8_716, out mstatus_158), s0_137, s1_144, 0x00B6, 0x0200, 640, a3_141, a4_142, mstatus_158, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_168, out s1_717, out a0_163, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722, out a7_723, out s2_724, out s3_725, out s4_726, out s5_727, out s6_728, out s8_729, out mstatus_179);
	if (a0_163 != null)
	{
		word32 a3_754;
		word32 a5_756;
		word32 a4_755;
		word32 t1_750;
		word32 a0_751;
		word32 a2_753;
		word32 a1_752;
		Eq_2 ra_198 = memset(ra_180, fp + -64, 0x00, 0x0C, out t1_750, out a0_751, out a1_752, out a2_753, out a3_754, out a4_755, out a5_756);
		word32 a5_757;
		lwip_htons((word32) s0_168->w0100, out a5_757);
		word32 a5_758;
		lwip_htons(0x08000180, out a5_758);
		word32 a5_759;
		lwip_htons(0x01, out a5_759);
		word32 a5_760;
		lwip_htons(0x01, out a5_760);
		word32 a5_761;
		lwip_htons(0x00, out a5_761);
		word32 a5_762;
		lwip_htons(0x00, out a5_762);
		word32 s8_766;
		word32 a3_763;
		word32 s4_765;
		word32 a4_764;
		byte * s3_245;
		Eq_2 s2_244;
		Eq_2 s1_235;
		Eq_2 s0_234 = pbuf_take(a0_163, fp + -64, 0x0C, out s1_235, out a3_763, out a4_764, out s2_244, out s3_245, out s4_765, out s8_766);
		do
		{
			Eq_2 s3_253 = s3_245 + 1;
			ui32 s4_255 = 0x00;
			s3_256 = s3_253;
			while (true)
			{
				Eq_2 s3_256;
				int32 a5_258 = (word32) *s3_256;
				if (a5_258 == 46 || a5_258 == 0x00)
					break;
				s4_255 = s4_255 + 0x01 & 0x00FF;
				s3_256 = (word32) s3_256 + 1;
			}
			pbuf_put_at(s0_234, s1_235, s2_244, s4_255);
			uint32 s4_320;
			word32 s8_769;
			word32 a4_768;
			word32 a3_767;
			s0_234 = pbuf_take_at(s1_235, s3_253, (word32) (word16) (s3_256 - s3_253), (word32) (word16) ((word32) s2_244 + 1), dwArgD8, out s1_235, out a3_767, out a4_768, out s3_245, out s4_320, out s8_769);
			s2_244 = (word32) (word16) ((s4_320 >> 0x10) + 1);
		} while ((word32) *s3_245 != 0x00);
		pbuf_put_at(s0_234, s1_235, s2_244, 0x00);
		word32 a5_770;
		lwip_htons(0x01, out a5_770);
		word32 a5_771;
		lwip_htons(0x01, out a5_771);
		word32 a5_772;
		lwip_htons(0x0C00000C, out a5_772);
		word32 a5_773;
		lwip_htons(0x01, out a5_773);
		word32 a5_774;
		lwip_htons(0x01, out a5_774);
		word32 a5_775;
		lwip_htons(0x00, out a5_775);
		word32 a4_777;
		word32 a5_778;
		word32 a3_776;
		Eq_2 a0_364 = lwip_htonl(0x003C0004, out a3_776, out a4_777, out a5_778);
		word32 a4_780;
		word32 a5_781;
		word32 a3_779;
		lwip_htonl(3232278785, out a3_779, out a4_780, out a5_781);
		word32 s8_783;
		Eq_2 a3_389;
		Eq_2 a4_390;
		Eq_2 s1_392;
		Eq_2 s4_401;
		word32 s3_782;
		Eq_2 s0_385 = pbuf_take_at(s1_235, fp + -52, 0x14, (word32) (word16) ((s4_320 >> 0x10) + 2), dwArgD8, out s1_392, out a3_389, out a4_390, out s3_782, out s4_401, out s8_783);
		word32 a2_784;
		word32 a3_785;
		word32 a5_787;
		word32 s2_788;
		word32 a4_786;
		word32 s5_790;
		word32 s6_791;
		word32 s3_789;
		word32 s0_793;
		word32 a0_794;
		word32 s8_792;
		word32 s9_797;
		word32 s5_796;
		word32 s3_795;
		word32 s1_799;
		word32 a0_800;
		word32 a1_801;
		word32 s0_798;
		word32 a2_802;
		Eq_2 s1_417;
		ptr32 mstatus_423;
		Eq_2 s4_427;
		Eq_2 a3_444;
		Eq_2 a4_445;
		ptr32 mstatus_449;
		Eq_2 s1_452;
		Eq_2 s4_455;
		word32 a3_803;
		word32 a4_804;
		word32 a5_805;
		word32 a7_806;
		word32 s2_807;
		word32 s3_808;
		word32 s4_809;
		word32 s5_810;
		word32 s6_811;
		word32 s8_812;
		word32 mstatus_813;
		pbuf_free(udp_sendto(pbuf_realloc(ra_198, s1_392, (word32) (word16) ((word32) s4_401 + 22), a3_389, a4_390, s4_401, mstatus_179, dwArgC8, out s1_417, out a2_784, out a3_785, out a4_786, out a5_787, out s2_788, out s3_789, out s4_427, out s5_790, out s6_791, out s8_792, out mstatus_423), *((word32) s0_385 + 264), s1_417, *((word32) s0_385 + 268), (word32) *((word32) s0_385 + 272), s4_427, mstatus_423, a0_364, dwLoc28, dwLoc08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgD8, out s0_793, out s1_452, out a0_794, out a3_444, out a4_445, out s3_795, out s4_455, out s5_796, out s9_797, out mstatus_449), s1_452, a3_444, a4_445, s4_455, mstatus_449, dwArgD8, out s0_798, out s1_799, out a0_800, out a1_801, out a2_802, out a3_803, out a4_804, out a5_805, out a7_806, out s2_807, out s3_808, out s4_809, out s5_810, out s6_811, out s8_812, out mstatus_813);
	}
}

// 2302CA78: Register Eq_2 dns_server_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a4Out)
// Called from:
//      stateGlobalGuard_AP
Eq_2 dns_server_init(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a4Out)
{
	ptr32 a4_15;
	Eq_2 s1_17;
	word32 a5_142;
	word32 a3_141;
	Eq_2 ra_20 = udp_new(ra, s1, a3, a4, mstatus, out s1_17, out a3_141, out a4_15, out a5_142);
	if (a0 == 0x00)
	{
		a4Out = a4_15;
		return ra_20;
	}
	else
	{
		Eq_2 s0_31 = a0;
		Eq_2 a4_33;
		Eq_2 a5_35;
		Eq_2 a3_34;
		if (udp_bind(a0, 587783820, (union Eq_2 *) 53, out a3_34, out a4_33, out a5_35) == 0x00)
		{
			Eq_2 a0_40;
			word32 s1_143;
			word32 a1_144;
			word32 a2_145;
			word32 a4_146;
			word32 a5_147;
			word32 a6_148;
			word32 s2_149;
			word32 s3_150;
			word32 s4_151;
			word32 s8_152;
			s0_31 = pvPortMalloc(ra_20, s1_17, 0x0114, a3_34, a4_33, a5_35, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_143, out a0_40, out a1_144, out a2_145, out a3_34, out a4_146, out a5_147, out a6_148, out s2_149, out s3_150, out s4_151, out s8_152);
			if (a0_40 != 0x00)
			{
				ptr32 a4_80;
				word32 t1_153;
				word32 a0_154;
				word32 a1_155;
				word32 a2_156;
				word32 a3_157;
				word32 a5_158;
				Eq_2 ra_82 = memset(ra_20, a0_40, 0x00, 0x04, out t1_153, out a0_154, out a1_155, out a2_156, out a3_157, out a4_80, out a5_158);
				udp_recv(s0_31, &g_t2302C858, a0_40);
				a4Out = a4_80;
				return ra_82;
			}
		}
		ptr32 a4_70;
		word32 a0_159;
		word32 a2_160;
		word32 a3_161;
		word32 a5_162;
		udp_remove(s0_31, a3_34, mstatus, out a0_159, out a2_160, out a3_161, out a4_70, out a5_162);
		a4Out = a4_70;
		return ra_20;
	}
}

// 2302CADE: Register Eq_2 easyflash_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 s10Out)
// Called from:
//      aos_loop_proc
Eq_2 easyflash_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & s10Out)
{
	struct Eq_274 * a0_83;
	ptr32 a0_19;
	word32 a1_20;
	Eq_2 a3_22;
	Eq_2 ra_27 = ef_port_init(ra, s0, a3, a4, a5, s2, s3, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg64, ra, dwArg78, dwArgB8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out a0_19, out a1_20, out a3_22);
	if (a0_19 == 0x00)
	{
		word32 a0_52;
		ra_27 = ef_env_init(ra_27, a0_19, a1_20, mstatus, 0x00, dwLoc08, dwLoc04, dwArg18, dwArg38, dwArg40, dwArg44, dwArg58, s1, dwArg8C, dwArg98, dwArgD8, out a0_52, out a3_22);
		if (a0_52 == 0x00)
		{
			a0_83 = (struct Eq_274 *) &g_t23081920;
l2302CB10:
			Eq_2 a3_99;
			ptr32 s10_129;
			word32 s2_218;
			word32 s3_219;
			word32 a4_216;
			word32 a5_217;
			word32 a0_214;
			word32 a1_215;
			word32 s1_213;
			word32 s4_220;
			word32 s5_221;
			word32 s6_222;
			word32 s7_223;
			word32 s9_224;
			word32 s10_225;
			word32 s11_226;
			word32 s1_227;
			word32 a0_228;
			word32 a1_229;
			word32 a3_230;
			word32 a4_231;
			word32 a5_232;
			word32 s2_233;
			word32 s3_234;
			word32 s4_235;
			word32 s5_236;
			word32 s6_237;
			word32 s7_238;
			word32 s9_239;
			word32 s11_240;
			Eq_2 ra_127 = ef_log_info(ef_log_info(ra_27, a0_83, a3_22, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_213, out a0_214, out a1_215, out a3_99, out a4_216, out a5_217, out s2_218, out s3_219, out s4_220, out s5_221, out s6_222, out s7_223, out s9_224, out s10_225, out s11_226), &g_t2308196C, a3_99, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_227, out a0_228, out a1_229, out a3_230, out a4_231, out a5_232, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s7_238, out s9_239, out s10_129, out s11_240);
			s10Out = s10_129;
			return ra_127;
		}
	}
	a0_83 = (struct Eq_274 *) &g_t23081948;
	goto l2302CB10;
}

// 2302CB3A: Register Eq_143271 get_status(Register Eq_143271 a0, Register word32 a1, Register out Eq_143271 a1Out, Register out ptr32 a3Out, Register out Eq_143271 a5Out)
// Called from:
//      read_env
//      read_sector_meta_data
//      del_env
Eq_143271 get_status(Eq_143271 a0, word32 a1, union Eq_143271 & a1Out, ptr32 & a3Out, union Eq_143271 & a5Out)
{
	Eq_143271 a1_13 = a1 + ~0x00;
	while (true)
	{
		Eq_143271 a5_7 = (word32) a1_13.u0 - 1;
		if (a5_7 == ~0x00)
			break;
		a3 = CONVERT(Mem0[a0 + a5_7:byte], byte, word32);
		if (a3 == 0x00)
			break;
		a1_13 = a5_7;
	}
	a1Out = a1_13;
	a3Out = a3;
	a5Out = a5_7;
	return a1_13;
}

