pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302CB58: Register Eq_143290 update_sector_cache(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_143290 a4Out, Register out (ptr32 Eq_143294) a5Out)
// Called from:
//      update_sec_status
//      format_sector.constprop.16
//      read_sector_meta_data
//      move_env
//      create_env_blob
Eq_143290 update_sector_cache(Eq_2 a0, Eq_2 a1, union Eq_143290 & a4Out, struct Eq_143294 & a5Out)
{
	struct Eq_143295 * a2_13 = g_a4201251C;
	Eq_143290 a3_30 = 0x04;
	Eq_143290 a4_22 = 0x00;
	struct Eq_143294 * a5_44 = g_a4201251C;
	do
	{
		Eq_2 a7_15 = a2_13->dw0000;
		if (a0 < a1 && a1 < (word32) a0 + 0x01000000)
		{
			if (a0 == a7_15)
			{
				a4_22 <<= 3;
				a5_44 = (word32) a4_22 + 1107371292;
				goto l2302CB84;
			}
			if (a7_15 == ~0x00 && a3_30 == 0x04)
				a3_30 = a4_22;
		}
		else if (a0 == a7_15)
		{
			ui32 a4_23 = a4_22 << 3;
			*(union Eq_2 *) ~0x00 = a4_23 + 0x4201251C;
			a4Out.u0 = ~0x00;
			a5Out = a4_23 + 0x4201251C;
			return a3_30;
		}
		a4_22 = (word32) a4_22 + 1;
		++a2_13;
	} while (a4_22 != 0x04);
	if (a3_30 != a4_22)
	{
		a3_30 <<= 3;
		*a0 = (word32) a3_30 + 1107371292;
		a5_44 = (word32) a3_30 + 1107371292;
l2302CB84:
		*((word32) a1 + 4) = a5_44;
	}
	a4Out = a4_22;
	a5Out = a5_44;
	return a3_30;
}

// 2302CBB4: Register Eq_2 get_next_sector_addr(Register (ptr32 Eq_143349) a5, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_143349) a5Out)
// Called from:
//      sector_iterator
//      env_iterator
Eq_2 get_next_sector_addr(struct Eq_143349 * a5, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_143349 & a5Out)
{
	Eq_2 a0_15;
	struct Eq_143354 * a0_5 = a5->ptr0004;
	Eq_2 a4_18 = g_t4200DE28;
	if (a5 != (struct Eq_143349 *) ~0x00)
	{
		ui32 a0_11;
		ui32 a0_10 = a0_5->dw000C;
		if (a0_10 == ~0x00)
			a0_11 = 0x01000000;
		else
			a0_11 = a0_10 << 0x0C;
		a0_15 = a5 + a0_11 / 8;
		a5 = (struct Eq_143349 *) 0x08000000;
		a4_18 = (word32) a4_18 + 0x08000000;
		if (a0_15 >= (word32) a4_18 + 0x08000000)
		{
			a3Out.u0 = <invalid>;
			a4Out = (word32) a4_18 + 0x08000000;
			a5Out = (struct Eq_143349 *) 0x08000000;
			return ~0x00;
		}
	}
	else
		a0_15 = a4_18;
	a3Out.u0 = <invalid>;
	a4Out = a4_18;
	a5Out = a5;
	return a0_15;
}

// 2302CBE2: void gc_check_cb(Register (ptr32 byte) a0)
void gc_check_cb(byte * a0)
{
	struct Eq_143383 * a5_5 = (word32) *a0;
	if (a5_5 != null)
		a5_5->dw0001 = a5_5->dw0000;
}

// 2302CBF2: Register ui32 update_env_cache(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out (ptr32 Eq_143400) a4Out, Register out (ptr32 Eq_143401) a5Out)
// Called from:
//      find_env
//      del_env
//      move_env
//      create_env_blob
ui32 update_env_cache(Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_143400 & a4Out, struct Eq_143401 & a5Out)
{
	word32 a2_144;
	word32 a5_146;
	word32 a4_145;
	struct Eq_143405 * a0_15 = ef_calc_crc32(null, a0, a1, out a2_144, out a4_145, out a5_146);
	struct Eq_143419 * a2_23 = g_a42012484;
	struct Eq_143400 * a7_101 = (struct Eq_143400 *) 0x0FFFFFFF;
	ui32 a6_25 = 0x10;
	ui32 a1_26 = 0x10;
	ui32 a3_122;
	struct Eq_143401 * a5_129 = g_a42012484;
	for (a3_122 = 0x00; a3_122 != 0x10; ++a3_122)
	{
		struct Eq_143400 * a4_125 = (word32) a2_23->w0000;
		if (a2 != ~0x00)
		{
			if (a4_125 == a0_15 >> 16)
			{
				a3_122 <<= 3;
				*((word32) a2 + 4) = a3_122 + 1107371140;
				a5_129 = a3_122 + 1107371140;
				goto l2302CC32;
			}
			a2_23 = a4_125->dw0004;
			if (a4_125 == (struct Eq_143400 *) ~0x00)
			{
				if (a1_26 == 0x10)
					a1_26 = a3_122;
			}
			else
			{
				word32 a4_43 = (word32) a2_23->w0002;
				if (a4_43 != 0x00)
					a2_23->w0002 = (word16) (a4_43 + ~0x00);
				a4_125 = (word32) a2_23->w0002;
				if (a4_125 < a7_101)
				{
					a7_101 = a4_125;
					a6_25 = a3_122;
				}
			}
		}
		else if (a4_125 == a0_15 >> 16)
		{
			a3_122 <<= 3;
			*((word32) a2 + 4) = a3_122 + 1107371140;
			a5_129 = a3_122 + 1107371140;
			goto l2302CC82;
		}
		++a2_23;
	}
	if (a1_26 != a3_122)
		a5_129 = (a1_26 << 3) + 1107371140;
	else
	{
		if (a6_25 == a1_26)
			goto l2302CC32;
		a5_129 = (a6_25 << 3) + 1107371140;
	}
	*((word32) a2 + 4) = a5_129;
	a5_129->w0000 = (word16) (a0_15 >> 16);
l2302CC82:
	a5_129->w0002 = 0x00;
l2302CC32:
	a4Out = a4_125;
	a5Out = a5_129;
	return a3_122;
}

// 2302CC92: void find_env_cb(Register (ptr32 Eq_143512) a0, Register Eq_2 a1, Register (ptr32 byte) a2, Stack Eq_2 dwArg44)
void find_env_cb(struct Eq_143512 * a0, Eq_2 a1, byte * a2, Eq_2 dwArg44)
{
	Eq_2 a1_23;
	word32 a4_95;
	word32 a5_96;
	word32 a2_93;
	word32 a3_94;
	if (dwArg44 != strlen(a1, out a1_23, out a2_93, out a3_94, out a4_95, out a5_96) || ((word32) a0->b0001 == 0x00 || (word32) a0->b0000 != 0x02))
		return;
	word32 a1_97;
	word32 a2_98;
	word32 a3_99;
	word32 a4_100;
	word32 a5_101;
	if (strncmp(&a0->b0001 + 0x0F, a1_23, dwArg44, out a1_97, out a2_98, out a3_99, out a4_100, out a5_101) != 0x00)
		return;
	*a2 = 0x01;
}

// 2302CCE4: void sector_statistics_cb(Register (ptr32 Eq_143561) a0)
void sector_statistics_cb(struct Eq_143561 * a0)
{
	if ((word32) a0->b0000 != 0x00)
	{
		struct Eq_143568 * a5_6 = (word32) a0->b0001;
		if (a5_6 == (struct Eq_143568 *) 0x01)
			a5_6->dw0001 = a5_6->dw0000;
		else if (a5_6 == (struct Eq_143568 *) 0x02)
			a5_6->dw0001 = a5_6->dw0000;
	}
}

// 2302CD0C: void alloc_env_cb(Register (ptr32 byte) a0, Register word32 a2, Register (ptr32 Eq_143591) a3, Register (ptr32 Eq_143591) a4)
void alloc_env_cb(byte * a0, word32 a2, struct Eq_143591 * a3, struct Eq_143591 * a4)
{
	if ((word32) *a0 == 0x00)
		return;
	struct Eq_143599 * a0_7 = a3->ptr0010;
	if (a4 >= a3)
		return;
	word32 * a4_10 = (word32) a0_7->b0002;
	if (a4_10 != (word32 *) 0x01)
	{
		if (a4_10 != (word32 *) 0x02)
			return;
		a4_10 = (word32) g_b4200DE2C;
		if (a4_10 != null)
			return;
	}
	*a4_10 = a2;
}

// 2302CD40: Register Eq_2 write_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register uint32 a2, Register uint32 a3, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_143636) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      read_env
//      update_sec_status
//      del_env
//      move_env
//      check_and_recovery_env_cb
//      do_gc
//      create_env_blob
Eq_2 write_status(Eq_2 ra, Eq_2 a0, Eq_2 a1, uint32 a2, uint32 a3, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_143636 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a3 < a2)
	{
		if (a1 != 0x00)
		{
			word32 a3_25;
			word32 t1_171;
			word32 a0_172;
			word32 a1_173;
			word32 a2_174;
			word32 a4_175;
			word32 a5_176;
			Eq_2 ra_28 = memset(ra, a1, 0x00FF, (a2 << 3) + ~0x00 >> 3, out t1_171, out a0_172, out a1_173, out a2_174, out a3_25, out a4_175, out a5_176);
			Eq_2 a1_34 = (word32) a1 + (a3_25 + ~0x00);
			a1_34->u1 = 0x00;
			Eq_2 a0_38 = (word32) a0 + (a3_25 + ~0x00);
			ptr32 a0_42;
			ptr32 a1_43;
			ptr32 a3_45;
			ptr32 a4_46;
			ptr32 a5_47;
			struct Eq_143636 * s0_51;
			ptr32 s1_52;
			ptr32 s10_53;
			ptr32 s11_54;
			byte * s2_55;
			ptr32 s3_56;
			ptr32 s4_57;
			ptr32 s6_59;
			ptr32 s7_60;
			word32 s5_187;
			Eq_2 ra_50 = ef_port_write(ra_28, a0, a0_38, a1_34, 0x01, s2, dwArg00, dwArg04, dwArg28, dwArg4C, out s0_51, out s1_52, out a0_42, out a1_43, out a3_45, out a4_46, out a5_47, out s2_55, out s3_56, out s4_57, out s5_187, out s6_59, out s7_60, out s10_53, out s11_54);
			s0Out = s0_51;
			s1Out = s1_52;
			a0Out = a0_42;
			a1Out = a1_43;
			a3Out = a3_45;
			a4Out = a4_46;
			a5Out = a5_47;
			s2Out = s2_55;
			s3Out = s3_56;
			s4Out = s4_57;
			s6Out = s6_59;
			s7Out = s7_60;
			s10Out = s10_53;
			s11Out = s11_54;
			return ra_50;
		}
		else
		{
			word32 s1_177;
			word32 a0_178;
			word32 a1_179;
			word32 a3_180;
			word32 a4_181;
			word32 s2_182;
			word32 s3_183;
			word32 s4_184;
			word32 s5_185;
			word32 s6_186;
			ef_log_debug(ra, &g_t23081F80, 587735020, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_177, out a0_178, out a1_179, out a3_180, out a4_181, out s2_182, out s3_183, out s4_184, out s5_185, out s6_186);
			while (true)
				;
		}
	}
	else
	{
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a3_164;
		word32 a4_165;
		word32 s2_166;
		word32 s3_167;
		word32 s4_168;
		word32 s5_169;
		word32 s6_170;
		ef_log_debug(ra, &g_t23081F80, 587734884, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_161, out a0_162, out a1_163, out a3_164, out a4_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170);
		while (true)
			;
	}
}

// 2302CDD6: Register Eq_2 read_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_143829) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      read_sector_meta_data
//      env_iterator
//      find_env
//      do_gc
Eq_2 read_env(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg5C, Eq_2 dwArg84, union Eq_2 & s0Out, ptr32 & a3Out, struct Eq_143829 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a5_104;
	word32 a4_365;
	word32 a1_363;
	word32 a3_364;
	word32 a0_362;
	Eq_2 ra_103 = ef_port_read(ra, *((word32) a0 + 80), fp + -92, 0x1C, out a0_362, out a1_363, out a3_364, out a4_365);
	Eq_2 a3_32;
	struct Eq_143867 * a5_34;
	word32 a1_366;
	ui32 a0_30 = get_status(fp + -92, 0x06, out a1_366, out a3_32, out a5_34);
	a0->u1 = (byte) (a0_30 & 0x00FF);
	a5_34->t0008 = a0;
	Eq_2 s0_17 = a0;
	struct Eq_143405 * a0_36 = a0_30 & 0x00FF;
	word32 s2_191 = a5_34 + -20;
	struct Eq_143829 * a4_101 = (struct Eq_143829 *) 0x07FFFFEC;
	if (a5_34 > (struct Eq_143867 *) 0xF8000000)
	{
		*(union Eq_2 *) 0x24 = a0;
		a5_104.u0 = 0x05;
		if ((a0_30 & 0x00FF) != 0x05)
		{
			(*((word32) a3_32 + 80))->u1 = 0x05;
			word32 a1_368;
			Eq_2 a0_152;
			Eq_2 s2_163;
			word32 s1_367;
			word32 a3_369;
			word32 a4_370;
			word32 s4_372;
			word32 s3_371;
			word32 s5_373;
			word32 s6_374;
			word32 s1_375;
			word32 a0_376;
			word32 a1_377;
			word32 a3_378;
			ra_103 = write_status(ef_log_debug(ra_103, &g_t23081F04, a3_32, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_367, out a0_152, out a1_368, out a3_369, out a4_370, out s2_163, out s3_371, out s4_372, out s5_373, out s6_374), a0_152, fp + -92, 0x06, 0x05, s2_163, dwLoc60, dwLoc5C, dwLoc58, s2, dwLoc14, dwLoc10, dwLoc0C, dwArg18, dwArg3C, out s0_17, out s1_375, out a0_376, out a1_377, out a3_378, out a4_101, out a5_104, out s2_191, out s3, out s4, out s6, out s7, out s10, out s11);
		}
	}
	else
	{
		a5_104 = (char *) a5_34 - 0x00FFFFED;
		a4_101 = (struct Eq_143829 *) 0x07000012;
		if (a5_34 <= (struct Eq_143867 *) 0xF8000001)
		{
			word32 s1_379;
			word32 a0_380;
			word32 a1_381;
			word32 a3_382;
			word32 a4_383;
			word32 s2_384;
			word32 s3_385;
			word32 s4_386;
			word32 s5_387;
			word32 s6_388;
			ef_log_debug(ra_103, &g_t23081F80, 587687784, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_379, out a0_380, out a1_381, out a3_382, out a4_383, out s2_384, out s3_385, out s4_386, out s5_387, out s6_388);
			while (true)
				;
		}
		struct Eq_143980 * s1_47;
		struct Eq_143405 * s4_48 = null;
		for (s1_47 = null; s1_47 <u a5_34 + -20; s1_47 += s3)
		{
			s3.u0 = 32;
			if (s1_47 + 32 >=u a5_34 + -20)
				s3 = a5_34 + -20 - s1_47;
			s0_17 = a0_36->t0050;
			word32 a0_392;
			word32 a1_393;
			word32 a3_394;
			word32 a4_395;
			ra_103 = ef_port_read(ra_103, a0_36 + 0x14 + s1_47, fp + -64, s3, out a0_392, out a1_393, out a3_394, out a4_395);
			word32 a2_396;
			a0_36 = ef_calc_crc32(s4_48, fp + -64, s3, out a2_396, out a4_101, out a5_104);
			s4_48 = a0_36;
		}
		s4 = dwArg84;
		if (a5_104 == dwArg84)
		{
			s0_17 = s1_47->t0050;
			((word32) s0_17 + 1)->u1 = 0x01;
			Eq_2 s1_93 = (char *) &s1_47->t0008 + 20;
			a5_104 = (word32) bLoc48;
			word32 a0_389;
			word32 a1_390;
			word32 a3_391;
			ra_103 = ef_port_read(ra_103, s1_93, (word32) s0_17 + 16, (word32) bLoc48, out a0_389, out a1_390, out a3_391, out a4_101);
			Mem108[s1_93 + a5_104 + 84:word32] = s0_17;
			a4_101->t000C = s0_17;
			*((word32) s0_17 + 2) = (byte) a5_104;
l2302CE4A:
			s0Out = s0_17;
			a3Out = dwArg08;
			a4Out = a4_101;
			a5Out = a5_104;
			s2Out = s2_191;
			s3Out = s3;
			s4Out = s4;
			s6Out = s6;
			s7Out = s7;
			s10Out = s10;
			s11Out = s11;
			return ra_103;
		}
	}
	((word32) s0_17 + 1)->u1 = 0x00;
	goto l2302CE4A;
}

// 2302CEFA: Register Eq_2 update_sec_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out (ptr32 byte) s1Out, Register out Eq_2 a0Out, Register out Eq_144094 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      move_env
//      create_env_blob
Eq_2 update_sec_status(Eq_2 ra, Eq_2 a0, Eq_2 a1, byte * a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, byte & s1Out, union Eq_2 & a0Out, union Eq_144094 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	Eq_2 s2_106;
	Eq_144094 a4_13 = (word32) *((word32) a0 + 1);
	if (a4_13 == 0x01)
	{
		Eq_2 a0_79;
		word32 s0_188;
		word32 a1_189;
		word32 a3_190;
		word32 a5_191;
		word32 s2_192;
		word32 s4_193;
		word32 s7_194;
		word32 s10_195;
		word32 s11_196;
		ra = write_status(ra, *((word32) a0 + 4), fp + ~0x13, 0x04, 0x02, s2, dwLoc20, dwLoc1C, s2, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_188, out s1, out a0_79, out a1_189, out a3_190, out a4_13, out a5_191, out s2_192, out s3, out s4_193, out s6, out s7_194, out s10_195, out s11_196);
		s2_106 = a0_79;
	}
	else
	{
		s2_106.u0 = 0x00;
		if (a4_13 == 0x02)
		{
			Eq_2 a0_18 = *(union Eq_2 *) 0x12;
			a4_13.u0 = 91;
			s1 = a2;
			if (false && 0x02 - a1 > 91)
			{
				if (a2 != null)
					*a2 = 0x00;
			}
			else
			{
				Eq_2 a0_34;
				word32 s0_197;
				word32 a1_198;
				word32 a3_199;
				word32 a4_200;
				word32 a5_201;
				word32 s2_202;
				word32 s4_203;
				word32 s7_204;
				word32 s10_205;
				word32 s11_206;
				ra = write_status(ra, a0_18, fp + ~0x13, 0x04, 0x03, 0x00, dwLoc20, dwLoc1C, s2, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_197, out s1, out a0_34, out a1_198, out a3_199, out a4_200, out a5_201, out s2_202, out s3, out s4_203, out s6, out s7_204, out s10_205, out s11_206);
				word32 a5_207;
				update_sector_cache(a0_34, (word32) a0_34 + 0x01000000, out a4_13, out a5_207);
				s2_106 = a0_34;
				if (s1 != null)
					*s1 = 0x01;
			}
		}
	}
	s1Out = s1;
	a0Out = s2_106;
	a4Out = a4_13;
	s2Out = s2_106;
	s3Out = s3;
	s6Out = s6;
	return ra;
}

