pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302CF70: Register Eq_2 format_sector.constprop.16(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Register out ptr32 a3Out)
// Called from:
//      check_sec_hdr_cb
//      do_gc
//      psm_erase_cmd
Eq_2 format_sector.constprop.16(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg1C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, ptr32 & a3Out)
{
	if (a0 << 0x14 == 0x00)
	{
		Eq_2 a0_14;
		Eq_2 ra_184 = ef_port_erase(ra, a0, 0x01000000, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out a0_14);
		if (a0_14 == 0x00)
		{
			Eq_2 s0_78;
			word32 t1_227;
			word32 a0_228;
			word32 a1_229;
			word32 a2_230;
			word32 a3_231;
			word32 a4_232;
			word32 a5_233;
			word32 t1_234;
			word32 a0_235;
			word32 a1_236;
			word32 a2_237;
			word32 a3_238;
			word32 a4_239;
			word32 a5_240;
			word32 t1_241;
			word32 a0_242;
			word32 a1_243;
			word32 a2_244;
			word32 a3_245;
			word32 a4_246;
			word32 a5_247;
			word32 s1_248;
			word32 a0_249;
			word32 a1_250;
			word32 a3_251;
			word32 a4_252;
			word32 a5_253;
			word32 s2_254;
			word32 s3_255;
			word32 s4_256;
			word32 s5_257;
			word32 s6_258;
			word32 s7_259;
			word32 s10_260;
			word32 s11_261;
			ra_184 = ef_port_write(memset(memset(memset(ra_184, fp + -36, 0x00FF, 0x14, out t1_227, out a0_228, out a1_229, out a2_230, out a3_231, out a4_232, out a5_233), fp + -36, 0x00FF, 0x03, out t1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240), fp + -33, 0x00FF, 0x03, out t1_241, out a0_242, out a1_243, out a2_244, out a3_245, out a4_246, out a5_247), a0_14, a0, fp + -36, 0x14, s2, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s0_78, out s1_248, out a0_249, out a1_250, out a3_251, out a4_252, out a5_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s10_260, out s11_261);
			word32 a4_262;
			word32 a5_263;
			a3 = update_sector_cache(s0_78, (word32) s0_78 + 0x01000000, out a4_262, out a5_263);
		}
		a3Out = a3;
		return ra_184;
	}
	else
	{
		word32 s1_217;
		word32 a0_218;
		word32 a1_219;
		word32 a3_220;
		word32 a4_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		ef_log_debug(ra, &g_t23081F80, 587734540, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_217, out a0_218, out a1_219, out a3_220, out a4_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226);
		while (true)
			;
	}
}

// 2302D014: void check_sec_hdr_cb(Register Eq_2 ra, Register (ptr32 byte) a0, Register Eq_2 a3, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void check_sec_hdr_cb(Eq_2 ra, byte * a0, Eq_2 a3, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) *a0 != 0x00)
		return;
	Eq_2 a0_21;
	struct Eq_144402 * a5_26;
	Eq_2 s2_32;
	word32 s1_150;
	word32 a1_151;
	word32 a3_152;
	word32 a4_153;
	word32 s3_154;
	word32 s4_155;
	word32 s5_156;
	word32 s6_157;
	word32 s7_158;
	word32 s9_159;
	word32 s10_160;
	word32 s11_161;
	Eq_2 ra_28 = ef_log_info(ra, &g_t23081B08, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_150, out a0_21, out a1_151, out a3_152, out a4_153, out a5_26, out s2_32, out s3_154, out s4_155, out s5_156, out s6_157, out s7_158, out s9_159, out s10_160, out s11_161);
	a5_26->dw0001 = a5_26->dw0000;
	word32 a3_162;
	format_sector.constprop.16(ra_28, a0_21, s2_32, dwArg0C, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, out a3_162);
}

// 2302D050: void print_env_cb(Register Eq_2 ra, Register (ptr32 Eq_144448) a0, Register Eq_2 a3, Register (ptr32 Eq_144450) a4, Register (ptr32 word32) a5, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C)
void print_env_cb(Eq_2 ra, struct Eq_144448 * a0, Eq_2 a3, struct Eq_144450 * a4, word32 * a5, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C)
{
	if ((word32) a0->b0001 != 0x00)
	{
		byte * a0_25 = a4->ptr0008;
		Mem29[a5 + a4:word32] = Mem21[a5 + 0x00:word32];
		if ((word32) *a0_25 == 0x02)
		{
			up32 a4_42;
			word32 s7_414;
			word32 s6_413;
			word32 s2_411;
			word32 s3_412;
			word32 a5_410;
			word32 a1_409;
			word32 s1_408;
			word32 s4_161;
			Eq_2 a3_117;
			word32 a0_148;
			Eq_2 ra_115 = ef_print(ra, &g_t23081EDC, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_408, out a0_148, out a1_409, out a3_117, out a4_42, out a5_410, out s2_411, out s3_412, out s4_161, out s6_413, out s7_414);
			Eq_2 a5_142 = 0x00FFFF8B;
			if (a4_42 <= 0x00FFFF8B)
			{
				word32 s3_160 = 0x02;
				word32 s5_180 = 0x00;
				Eq_144558 s6_163 = 94;
				word32 s7_146 = 0x23082000;
				while (true)
				{
					Eq_2 s1_156;
					for (s1_156 = 0x00; s1_156 < a5_142; s1_156 += s2_159)
					{
						Eq_2 s2_159 = 32;
						if ((word32) s1_156 + 32 >= a5_142)
							s2_159 = a5_142 - s1_156;
						word32 a1_436;
						word32 a4_437;
						ra_115 = ef_port_read(ra_115, (word32) s1_156 + a0_148, fp + -80, s2_159, out a0_148, out a1_436, out a3_117, out a4_437);
						a5_142.u0 = 0x00;
						if (s5_180 != 0x00)
						{
							word32 a1_438;
							word32 a4_439;
							ra_115 = ef_print(ra_115, s7_146 + -0x011C, a3_117, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_156, out a0_148, out a1_438, out a3_117, out a4_439, out a5_142, out s2_159, out s3_160, out s4_161, out s6_163, out s7_146);
							s5_180 = s5_162;
						}
						else
						{
							while (s2_159 != a5_142)
							{
								if (s6_163 < (word32) (*((word16) a5_142.u0 + (fp + -80))) + ~0x1F)
									goto l2302D108;
								a5_142 = (word16) a5_142.u0 + 1;
							}
						}
					}
					a5_142.u0 = 0x01;
					s5_180 = s4_161;
					if (s3_160 == 0x01)
						break;
					s3_160 = 0x01;
				}
			}
			else
			{
l2302D108:
				word32 s6_423;
				word32 s4_422;
				word32 s3_421;
				word32 a5_419;
				word32 s2_420;
				word32 a4_418;
				word32 a1_417;
				word32 s1_415;
				word32 a0_416;
				word32 s7_424;
				ra_115 = ef_print(ra_115, &g_t23081EEC, a3_117, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_415, out a0_416, out a1_417, out a3_117, out a4_418, out a5_419, out s2_420, out s3_421, out s4_422, out s6_423, out s7_424);
			}
			word32 s4_433;
			word32 s7_435;
			word32 s1_425;
			word32 a5_430;
			word32 a3_428;
			word32 s2_431;
			word32 a0_426;
			word32 s6_434;
			word32 a4_429;
			word32 s3_432;
			word32 a1_427;
			ef_print(ra_115, &g_t230727FC, a3_117, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_425, out a0_426, out a1_427, out a3_428, out a4_429, out a5_430, out s2_431, out s3_432, out s4_433, out s6_434, out s7_435);
		}
	}
}

// 2302D13C: Register Eq_2 get_next_env_addr(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_144650) a1Out, Register out (ptr32 Eq_144651) a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_144650) s5Out)
// Called from:
//      read_sector_meta_data
//      env_iterator
//      do_gc
Eq_2 get_next_env_addr(Eq_2 ra, Eq_2 a0, Eq_2 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, struct Eq_144650 & a1Out, struct Eq_144651 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, struct Eq_144650 & s5Out)
{
	struct Eq_144655 * a4_5 = (word32) *((word32) a0 + 1);
	if (a4_5 == (struct Eq_144655 *) 0x01)
	{
l2302D146:
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = ~0x00;
		a1Out = a1;
		a5Out = (struct Eq_144651 *) 0x01;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return ra;
	}
	a1 = (struct Eq_144650 *) a4_5->ptr0050;
	Eq_2 a0_9 = *(union Eq_2 *) 0x05;
	if (a4_5 == (struct Eq_144655 *) ~0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = 0x15;
		a1Out = a1;
		a5Out = (struct Eq_144651 *) 0x01;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return ra;
	}
	if (a4_5 > (struct Eq_144655 *) 0x01000001)
		goto l2302D146;
	word32 s0_30 = a4_5 + 1;
	if ((word32) a1->b0001 != 0x00)
	{
		a1 = (struct Eq_144650 *) a4_5->ptr0009;
		s0_30 = a4_5 + 1 + a4_5;
	}
	struct Eq_144691 * a2_41 = g_a4201251C;
	struct Eq_144650 * a1_298 = s0_30 & 0xFF000000;
	ui32 a4_46;
	for (a4_46 = 0x00; a4_46 != 0x04; ++a4_46)
	{
		Eq_2 a0_105;
		Eq_2 s1_113;
		if (a1_298 == a2_41->dw0000)
		{
			s1_113 = s0_30;
			if (s0_30 == g_a42012520[a4_46])
				goto l2302D1B4;
			break;
		}
		++a2_41;
	}
	s1_113 = s0_30;
	s2 = 0x00FFFFE5;
	while (s1_113 < 0x00FFFFED)
	{
		word32 a3_392;
		word32 a0_391;
		word32 a4_393;
		ra = ef_port_read(ra, s1_113, fp + -64, 32, out a0_391, out a1_298, out a3_392, out a4_393);
		struct Eq_144746 * a4_107 = fp + -64;
		a0_105 = (word32) s1_113 - 8;
		Eq_2 a2_87 = (word32) s1_113 + 20;
		while (a0_105 != 0x00FFFFE5)
		{
			if (((word32) a4_107[1] << 8) + (word32) a4_107->b0000 + ((word32) a4_107[2] << 16) + ((word32) a4_107[3] << 24) == 808736331 && a0_105 >= s0_30)
				goto l2302D1B6;
			a0_105 = (word32) a0_105 + 1;
			++a4_107;
			if (a2_87 == a0_105)
				break;
		}
		s1_113 = (word32) s1_113 + 28;
	}
l2302D1B4:
	a0_105.u0 = ~0x00;
l2302D1B6:
	Eq_144788 a4_129 = *((word32) a0_9 + 4);
	struct Eq_144651 * a5_131 = (word32) a4_129 + 0x01000000;
	if ((word32) a4_129 + 0x01000000 >= a0_105)
	{
		a5_131 = a1->ptr0008;
		if (a5_131 != null)
		{
l2302D1CA:
			0x00 = (uint16) dwArg0198;
			s0Out = dwArg0158;
			s1Out = s1_113;
			a0Out = a0_105;
			a1Out = a1_298;
			a5Out = a5_131;
			s2Out = s2;
			s3Out = a0_9;
			s5Out = a1;
			return ra;
		}
	}
	a0_105.u0 = ~0x00;
	goto l2302D1CA;
}

// 2302D246: Register Eq_2 read_sector_meta_data(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 a2, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_144811) a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      sector_iterator
//      env_iterator
Eq_2 read_sector_meta_data(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, ptr32 a2, Eq_2 dwArgD8, Eq_2 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_144811 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a0 << 0x14 != 0x00)
	{
		word32 a0_700;
		word32 s3_705;
		word32 s4_706;
		word32 s2_704;
		word32 s5_707;
		word32 s1_699;
		word32 a1_701;
		word32 a3_702;
		word32 a4_703;
		word32 s6_708;
		ef_log_debug(ra, &g_t23081F80, 587734540, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_699, out a0_700, out a1_701, out a3_702, out a4_703, out s2_704, out s3_705, out s4_706, out s5_707, out s6_708);
		while (true)
			;
	}
	struct Eq_144811 * a5_277;
	ptr32 s1_173;
	struct Eq_144826 * a4_39;
	word32 a0_698;
	Eq_2 a1_101;
	ptr32 a3_275;
	Eq_2 ra_107 = ef_port_read(ra, a0, fp + -188, 0x14, out a0_698, out a1_101, out a3_275, out a4_39);
	*((word32) a1 + 4) = a0;
	a4_39->t0008 = a1;
	Eq_2 s0_156 = a1;
	ptr32 s4_198 = a2;
	if (a4_39 != (struct Eq_144826 *) 0x30344645)
	{
		a1->u1 = 0x00;
		*(union Eq_2 *) 11 = a1;
		a5_277 = (struct Eq_144811 *) ~0x00;
		s1_173 = 0x07;
		goto l2302D2BA;
	}
	*(union Eq_2 *) 0x30344651 = a1;
	a1->u1 = 0x01;
	word32 a3_710;
	word32 a5_711;
	word32 a1_709;
	ui32 a0_53 = get_status(fp + -188, 0x04, out a1_709, out a3_710, out a5_711);
	((word32) a1 + 1)->u1 = (byte) (a0_53 & 0x00FF);
	*((word32) a1 + 2) = (byte) get_status(fp + -0x00B9, 0x04, out a1_101, out a3_275, out a5_277);
	s3.u0 = 0x01;
	if (a2 != 0x00)
	{
		*((word32) a1 + 16) = 0x00;
		*((word32) a0 + 40) = a1;
		if ((a0_53 & 0x00FF) == 0x01)
		{
			*(union Eq_2 *) 0x00FFFFFC = a1;
			a5_277 = (struct Eq_144811 *) 0x00FFFFEC;
		}
		else
		{
			a5_277 = (struct Eq_144811 *) 0x02;
			if ((a0_53 & 0x00FF) == 0x02)
			{
				ui32 a5_74;
				for (a5_74 = 0x00; a5_74 != 0x04; ++a5_74)
				{
					a3_275 = (ptr32) *a1_101;
					if (a0 == a1_101)
					{
						a5_277 = (struct Eq_144811 *) g_a42012520[a5_74];
						a5_277->t0014 = a1;
						Mem290[a1 + 16:word32] = a0 + 0x01000000 - a5_277;
						goto l2302D302;
					}
				}
				*(union Eq_2 *) 0x00FFFFFC = a1;
				while (true)
				{
					byte bLoc87_391 = SLICE(dwLoc88, byte, 8);
					byte bLoc88_392 = (byte) dwLoc88;
					Eq_2 s2_110;
					word32 s3_728;
					word32 s0_726;
					word32 s1_727;
					word32 s5_729;
					struct Eq_145025 * a5_105;
					Eq_2 a0_100;
					ra_107 = get_next_env_addr(ra_107, s0_156, dwArgD8, out s0_726, out s1_727, out a0_100, out a1_101, out a5_105, out s2_110, out s3_728, out s5_729);
					if (a0_100 == s2_110)
						break;
					Eq_2 a3_123;
					ptr32 a4_124;
					struct Eq_144987 * s0_129;
					ui32 s3_132;
					word32 s10_716;
					word32 a5_712;
					word32 s2_713;
					word32 s6_715;
					word32 s4_714;
					Eq_2 ra_128 = read_env(ra_107, fp + -0x0088, s2_110, dwLocB0, dwLocAC, dwLocA8, dwLoc88, dwLoc84, s0, dwLoc3C, out s0_129, out a3_123, out a4_124, out a5_712, out s2_713, out s3_132, out s4_714, out s6_715, out s7, out s10_716, out s11);
					struct Eq_145018 * a5_147 = (word32) bLoc87_391;
					if (a5_147 == null)
					{
						ui32 a5_148 = (word32) bLoc88_392;
						a5_147 = a5_148 & 0x00FB;
						if ((a5_148 & 0x00FB) != s3_132)
						{
							word32 s2_719;
							word32 s3_720;
							word32 a4_718;
							word32 a3_717;
							word32 s10_725;
							word32 s9_724;
							word32 s4_721;
							word32 s5_722;
							word32 s6_723;
							ra_107 = ef_log_info(ra_128, &g_t23081F34, a3_123, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_173, out a0_100, out a1_101, out a3_717, out a4_718, out a5_105, out s2_719, out s3_720, out s4_721, out s5_722, out s6_723, out s7, out s9_724, out s10_725, out s11);
							s0_129->dw0010 = 0x00;
							goto l2302D3A0;
						}
					}
					s0_156 = a5_147->t0010;
					(word32) a3_123 + a4_124 + 20 = (word32) s0_156;
					(a5_147 - a3_123)->t0010 = s0_156;
					ra_107 = dwLoc1C;
				}
				s1_173 = 0x00;
l2302D3A0:
				Eq_2 s2_192 = a5_105->ptr0004->t0014;
				s5 = (char *) &a5_105->ptr0004 + 0x00FFFFFC;
				s3 = s2_192;
				int32 s6_197 = 0x00;
				s4_198 = (char *) &a5_105->ptr0004 + 0x0100001C;
				while (s3 < s5)
				{
					s7 = (word16) s3.u0 + 32;
					Eq_2 s8_203 = 32;
					if (s7 >= s5)
						s8_203 = s4_198 - s7;
					word32 a4_732;
					word32 a3_731;
					ra_107 = ef_port_read(ra_107, s3, fp + -0x00A8, s8_203, out a0_100, out a1_101, out a3_731, out a4_732);
					Eq_2 a5_222 = 0x00;
					while (s8_203 != a5_222)
					{
						int32 a4_229 = (word32) *((word32) a5_222 + (fp + -0x00A8));
						if (s6_197 != 0x00FF && a4_229 == 0x00FF)
							s2_192 = s3 + a5_222;
						a5_222 = (word32) a5_222 + 1;
						s6_197 = a4_229;
					}
					s3 = s7;
				}
				if (s6_197 != 0x00FF)
					s2_192 = s5;
				struct Eq_145096 * s0_254 = *((word32) a0_100 + 4);
				if (s2_192 != 0x00FF)
				{
					s0_254->t0014 = s2_192;
					s0_254->dw0010 = (word32) a0_100 + 0x01000000 - s2_192;
				}
				s0_156 = *((word32) a1_101 + 20);
				word32 a4_730;
				a3_275 = update_sector_cache(a0_100, a1_101, out a4_730, out a5_277);
l2302D2BA:
				ptr32 s10_314 = *((word32) dwArg0118 + 0x0C);
				Eq_2 s6_315 = *((word32) dwArg0118 + 44);
				s0Out = s0_156;
				s1Out = s1_173;
				a0Out = dwArgD8;
				a1Out = a1_101;
				a3Out = a3_275;
				a4Out = dwArgB8;
				a5Out = a5_277;
				s2Out = dwArg98;
				s3Out = s3;
				s4Out = s4_198;
				s5Out = s5;
				s6Out = s6_315;
				s7Out = s7;
				s10Out = s10_314;
				s11Out = s11;
				return ra_107;
			}
		}
	}
l2302D302:
	s1_173 = 0x00;
	goto l2302D2BA;
}

// 2302D436: Register Eq_2 sector_iterator(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_143349) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_143349) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_143349) a5Out, Register out Eq_2 s2Out, Register out (ptr32 code) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      alloc_env
//      gc_collect
//      ef_load_env
Eq_2 sector_iterator(Eq_2 ra, Eq_2 a0, Eq_2 dwArg0128, struct Eq_143349 & s1Out, union Eq_2 & a0Out, struct Eq_143349 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_143349 & a5Out, union Eq_2 & s2Out, <anonymous> & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	*(union Eq_2 *) 0x03 = a0;
	struct Eq_145181 * sp_141 = fp + -48;
	ptr32 s6_106 = a5;
	struct Eq_143349 * a5_134 = (struct Eq_143349 *) ~0x00;
	Eq_2 s0_123 = a0;
	struct Eq_143349 * s1_127 = a1;
	ptr32 s5_105 = a3;
	<anonymous> * s3_103 = a4;
	Eq_2 s7_107 = ~0x00;
	do
	{
		ptr32 a4_156;
		ptr32 a3_155;
		Eq_2 a0_152 = get_next_sector_addr(a5_134, out a3_155, out a4_156, out a5_134);
		Eq_2 s2_150 = a0_152;
		if (a0_152 == s7_107)
			break;
		word32 s10_291;
		word32 s11_292;
		word32 a0_290;
		word32 s4_104;
		Eq_2 s2_102;
		word32 a3_136;
		word32 a4_138;
		ra = read_sector_meta_data(ra, s0_123, a0_152, s0_123, 0x00, sp_141->t00D8, sp_141->t0118, out s0_123, out s1_127, out a0_290, out a1, out a3_136, out a4_138, out a5_134, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out s7_107, out s10_291, out s11_292);
		if (s1_127 != null)
		{
			a5_134 = (word32) *((word32) s0_123 + 1);
			if (a5_134 != s1_127)
				continue;
		}
		if (s6_106 != 0x00)
		{
			word32 s10_295;
			word32 s11_296;
			word32 a0_293;
			word32 a1_294;
			ra = read_sector_meta_data(ra, s0_123, s2_102, s0_123, 0x01, sp_141->t00D8, sp_141->t0118, out s0_123, out s1_127, out a0_293, out a1_294, out a3_136, out a4_138, out a5_134, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out s7_107, out s10_295, out s11_296);
		}
		word32 a7_161;
		word32 s10_162;
		word32 s11_163;
		word32 s9_164;
		word32 t0_165;
		word32 t1_166;
		word32 t4_167;
		word32 t5_168;
		word32 t6_169;
		s3_103();
	} while (a0_152 == 0x00);
	0x00 = (uint16) dwArg0128;
	s1Out = s1_127;
	a0Out = a0_152;
	a1Out = a1;
	a3Out = a3_155;
	a4Out = a4_156;
	a5Out = a5_134;
	s2Out = s2_150;
	s3Out = s3_103;
	s4Out = dwArg78;
	s5Out = s5_105;
	s6Out = s6_106;
	return ra;
}

// 2302D4AA: Register Eq_2 alloc_env(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      new_env
//      move_env
Eq_2 alloc_env(Eq_2 ra, Eq_2 a0, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	word32 s4_278;
	up32 a5_31;
	ptr32 s5_121;
	ptr32 s3_119;
	Eq_2 s2_118;
	ptr32 s1_115;
	ptr32 a4_111;
	Eq_2 a3_110;
	ptr32 a1_108;
	ptr32 a0_107;
	ptr32 s6_122;
	Eq_2 ra_106 = sector_iterator(ra, a0, dwArgF8, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_31, out s2_118, out s3_119, out s4_278, out s5_121, out s6_122);
	if (a5_31 != 0x00)
	{
		word32 s4_279;
		ra_106 = sector_iterator(ra_106, s2_118, dwArgF8, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_31, out s2_118, out s3_119, out s4_279, out s5_121, out s6_122);
	}
	if (a5_31 != 0x00)
	{
		a4_111 = ~0x00;
		if (a3_110 == ~0x00)
		{
			if (a5_31 <= 0x01 && (word32) g_b4200DE2C == 0x00)
			{
				word32 s4_282;
				ra_106 = ef_log_debug(ra_106, &g_t23081A1C, a3_110, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out s2_118, out s3_119, out s4_282, out s5_121, out s6_122);
				g_b4200DE2C = (byte) s1_115;
			}
			else
			{
				word32 a5_280;
				word32 s4_281;
				ra_106 = sector_iterator(ra_106, s2_118, dwArgF8, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_280, out s2_118, out s3_119, out s4_281, out s5_121, out s6_122);
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_115;
	a0Out = a0_107;
	a1Out = a1_108;
	a3Out = a3_110;
	a4Out = a4_111;
	s2Out = s2_118;
	s3Out = s3_119;
	s4Out = dwArg14;
	s5Out = s5_121;
	s6Out = s6_122;
	return ra_106;
}

// 2302D550: Register Eq_2 gc_collect(Register Eq_2 ra, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      new_env
//      check_and_recovery_gc_cb
//      ef_set_env
//      ef_load_env
Eq_2 gc_collect(Eq_2 ra, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 a3_17;
	word32 s1_157;
	word32 a0_158;
	word32 a1_159;
	word32 a4_160;
	word32 a5_161;
	word32 s2_162;
	word32 s3_163;
	word32 s4_164;
	word32 s5_165;
	word32 s6_166;
	word32 a0_167;
	word32 a1_168;
	word32 a3_169;
	word32 s3_170;
	word32 s5_171;
	word32 s6_172;
	ptr32 a4_130;
	ptr32 s1_135;
	ptr32 s2_138;
	ptr32 s4_140;
	Eq_2 ra_133 = ef_log_debug(sector_iterator(ra, fp + -40, dwArgF8, out s1_157, out a0_158, out a1_159, out a3_17, out a4_160, out a5_161, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166), &g_t23081E24, a3_17, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_135, out a0_167, out a1_168, out a3_169, out a4_130, out s2_138, out s3_170, out s4_140, out s5_171, out s6_172);
	if (a4_130 <= 0x01)
	{
		word32 a0_173;
		word32 a1_174;
		word32 a3_175;
		word32 a5_176;
		word32 s3_177;
		word32 s5_178;
		word32 s6_179;
		ra_133 = sector_iterator(ra_133, fp + -40, dwArgF8, out s1_135, out a0_173, out a1_174, out a3_175, out a4_130, out a5_176, out s2_138, out s3_177, out s4_140, out s5_178, out s6_179);
	}
	g_b4200EE2C = 0x00;
	s1Out = s1_135;
	a4Out = a4_130;
	s2Out = s2_138;
	s4Out = s4_140;
	return ra_133;
}

