pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302D5B4: Register Eq_2 new_env(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      create_env_blob
//      ef_set_env
Eq_2 new_env(Eq_2 ra, Eq_2 a0, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 s0_23;
	word32 a3_191;
	ptr32 a1_104;
	ptr32 a0_103;
	ptr32 a4_107;
	ptr32 s1_113;
	ptr32 s2_116;
	ptr32 s3_117;
	ptr32 s4_118;
	ptr32 s5_119;
	ptr32 s6_120;
	Eq_2 ra_111 = alloc_env(ra, a0, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118, out s0_23, out s1_113, out a0_103, out a1_104, out a3_191, out a4_107, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120);
	if (a0_103 == ~0x00 && (word32) g_b4200DE2C != 0x00)
	{
		Eq_2 s1_83;
		word32 s1_192;
		word32 a0_193;
		word32 a1_194;
		word32 a3_195;
		word32 a4_196;
		word32 s2_197;
		word32 s3_198;
		word32 s4_199;
		word32 s5_200;
		word32 s6_201;
		word32 a4_202;
		word32 s2_203;
		word32 s4_204;
		word32 s0_205;
		word32 a3_206;
		ra_111 = alloc_env(gc_collect(ef_log_debug(ra_111, &g_t23081E8C, s0_23, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_192, out a0_193, out a1_194, out a3_195, out a4_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201), dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, out s1_83, out a4_202, out s2_203, out s4_204), s1_83, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118, out s0_205, out s1_113, out a0_103, out a1_104, out a3_206, out a4_107, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120);
	}
	s1Out = s1_113;
	a0Out = a0_103;
	a1Out = a1_104;
	a4Out = a4_107;
	s2Out = s2_116;
	s3Out = s3_117;
	s4Out = s4_118;
	s5Out = s5_119;
	s6Out = s6_120;
	return ra_111;
}

// 2302D604: void check_and_recovery_gc_cb(Register Eq_2 ra, Register (ptr32 Eq_145597) a0, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8)
void check_and_recovery_gc_cb(Eq_2 ra, struct Eq_145597 * a0, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgE8)
{
	if ((word32) a0->b0000 == 0x00 || (word32) a0->b0002 != 0x03)
		return;
	g_b4200EE2C = 0x01;
	word32 s4_138;
	word32 s2_137;
	word32 a4_136;
	word32 s1_135;
	gc_collect(ra, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, out s1_135, out a4_136, out s2_137, out s4_138);
}

// 2302D632: Register Eq_2 env_iterator(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register (ptr32 Eq_145631) s4, Stack word32 dwArg1C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_143349) s5Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      find_env
//      move_env
//      ef_load_env
//      psm_dump_cmd
Eq_2 env_iterator(Eq_2 ra, Eq_2 a0, Eq_2 s2, struct Eq_145631 * s4, word32 dwArg1C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_143349 & s5Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_143349 * a5_32 = (struct Eq_143349 *) ~0x00;
	Eq_2 s0_20 = a0;
	ptr32 s2_142 = a1;
	ptr32 s3_143 = a2;
	Eq_2 s1_28 = ~0x00;
	struct Eq_143349 * s5_145 = (struct Eq_143349 *) 0x01;
	do
	{
l2302D652:
		ptr32 a4_135;
		ptr32 a5_136;
		ptr32 a3_134;
		Eq_2 a0_33 = get_next_sector_addr(a5_32, out a3_134, out a4_135, out a5_136);
		if (a0_33 == s1_28)
			goto l2302D694;
		word32 a0_43;
		word32 a1_297;
		word32 a3_298;
		word32 a4_299;
		word32 s4_300;
		word32 s6_301;
		word32 s7_302;
		ra = read_sector_meta_data(ra, s0_20, a0_33, fp + -56, 0x00, dwArg98, dwArgD8, out s0_20, out s1_28, out a0_43, out a1_297, out a3_298, out a4_299, out a5_32, out s2_142, out s3_143, out s4_300, out s5_145, out s6_301, out s7_302, out s10, out s11);
		if (a0_43 != 0x00)
			continue;
		a5_32 = (word32) bLoc37 + ~0x01 & 0x00FF;
	} while (s5_145 < a5_32);
	*((word32) s1_28 + 80) = s0_20;
	do
	{
		Eq_2 a0_81;
		word32 a1_311;
		ra = get_next_env_addr(ra, fp + -56, dwArg0158, out s0_20, out s1_28, out a0_81, out a1_311, out a5_32, out s2_142, out s3_143, out s5_145);
		*((word32) a0_81 + 80) = s0_20;
		if (a0_81 == s1_28)
			goto l2302D652;
		word32 s0_110;
		word32 s2_112;
		<anonymous> * s4_114;
		word32 a0_131;
		s4_114();
	} while (a0_131 == 0x00);
l2302D694:
	s0Out = dwArg0158;
	a3Out = a3_134;
	a4Out = a4_135;
	a5Out = a5_136;
	s2Out = s2_142;
	s3Out = s3_143;
	s5Out = s5_145;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 2302D6A6: Register Eq_2 find_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_145745) s3Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      del_env
//      ef_get_env_blob
//      ef_set_env
Eq_2 find_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_145745 & s3Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a2_342;
	word32 a4_344;
	word32 a5_345;
	word32 a3_343;
	word32 a1_341;
	Eq_2 a0_28 = strlen(a0, out a1_341, out a2_342, out a3_343, out a4_344, out a5_345);
	word32 a2_346;
	word32 a5_348;
	word32 a4_347;
	struct Eq_143405 * a0_39 = ef_calc_crc32(null, a0, a0_28, out a2_346, out a4_347, out a5_348);
	struct Eq_145631 * s4_44 = g_a42012484;
	ui32 s0_46;
	for (s0_46 = 0x00; s0_46 != 0x10; ++s0_46)
	{
		ptr32 a5_105;
		ptr32 a4_104;
		ptr32 s10_119;
		Eq_2 s2_109;
		ptr32 s11_120;
		struct Eq_145745 * s3_110;
		ptr32 s0_129;
		int32 a0_52 = s4_44->dw0004;
		if (a0_52 != ~0x00 && (word32) s4_44->w0000 == a0_39 >> 0x10)
		{
			word32 a1_350;
			word32 a3_351;
			word32 a4_352;
			word32 a0_349;
			ra = ef_port_read(ra, a0_52 + 0x1C, fp + -112, 64, out a0_349, out a1_350, out a3_351, out a4_352);
			Eq_2 a4_76;
			word32 a5_356;
			word32 a1_353;
			word32 a2_354;
			word32 a3_355;
			if (strncmp(a0, fp + -112, a0_28, out a1_353, out a2_354, out a3_355, out a4_76, out a5_356) == 0x00)
			{
				struct Eq_145821 * a5_144 = *((word32) a4_76 + 4);
				*((word32) a1 + 80) = a4_76;
				struct Eq_145828 * s0_143 = s0_46 << 3;
				up32 a4_146 = (word32) a5_144->w0002;
				word32 a5_149 = 0x0FFFFFFF;
				if (a4_146 <= 0x0FFFFFEE)
					a5_149 = (word32) (word16) (a4_146 + 16);
				s0_143->w42012486 = (word16) a5_149;
				word32 s4_359;
				word32 s6_360;
				word32 s7_361;
				word32 s0_357;
				word32 a3_358;
				read_env(ra, a1, a0, dwLoc60, dwLoc5C, dwLoc58, dwLoc38, dwLoc34, dwLoc14, dwArg14, out s0_357, out a3_358, out a4_104, out a5_105, out s2_109, out s3_110, out s4_359, out s6_360, out s7_361, out s10_119, out s11_120);
				s0_129 = 0x01;
				goto l2302D740;
			}
		}
		++s4_44;
	}
	Eq_2 s5_112;
	word32 s0_362;
	word32 a3_363;
	env_iterator(ra, a1, a0, s4_44, dwLoc54, dwArg28, dwArg68, dwArgE8, out s0_362, out a3_363, out a4_104, out a5_105, out s2_109, out s3_110, out s5_112, out s10_119, out s11_120);
	s0_129 = 0x00;
	if (false)
		update_env_cache(s2_109, s5_112, s3_110->t0050, out a4_104, out a5_105);
l2302D740:
	s0Out = s0_129;
	s1Out = dwLoc64;
	a0Out = s0_129;
	a4Out = a4_104;
	a5Out = a5_105;
	s2Out = s2_109;
	s3Out = s3_110;
	s9Out = dwArg18;
	s10Out = s10_119;
	s11Out = s11_120;
	return dwArgE8;
}

// 2302D78C: Register Eq_2 del_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 s3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg58, Register out (ptr32 Eq_145921) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      move_env
//      ef_del_env
//      ef_set_env
Eq_2 del_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 s3, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg58, struct Eq_145921 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 a3_138;
	Eq_2 ra_159;
	struct Eq_145921 * s0_160;
	Eq_2 s3_104;
	Eq_2 s2_103;
	ptr32 s4_105;
	ptr32 s1_118;
	if (a1 == 0x00)
	{
		Eq_2 s3_35;
		word32 s10_420;
		word32 s11_421;
		word32 s2_418;
		word32 s9_419;
		word32 a4_416;
		word32 a5_417;
		word32 s1_415;
		ra = find_env(ra, a0, fp + -0x0078, dwLoc7C, dwLoc68, dwLoc28, dwArg58, out s0_160, out s1_415, out a0, out a4_416, out a5_417, out s2_418, out s3_35, out s9_419, out s10_420, out s11_421);
		if (a0 == 0x00)
		{
			word32 a0_423;
			word32 s1_422;
			word32 a4_425;
			word32 a1_424;
			word32 s5_426;
			word32 s6_427;
			ra_159 = ef_log_debug(ra, &g_t23081BC8, s3_35, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_422, out a0_423, out a1_424, out a3_138, out a4_425, out s2_103, out s3_104, out s4_105, out s5_426, out s6_427);
			s1_118 = 0x04;
			goto l2302D818;
		}
	}
	ui32 a5_117;
	if (a2 == 0x00)
	{
		ptr32 a0_151;
		word32 s1_436;
		word32 a1_437;
		word32 a4_438;
		word32 a5_439;
		word32 s6_440;
		word32 s7_441;
		word32 s10_442;
		word32 s11_443;
		ra_159 = write_status(ra, a0, fp + -0x0080, 0x06, 0x03, 1107353135, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_436, out a0_151, out a1_437, out a3_138, out a4_438, out a5_439, out s2_103, out s3_104, out s4_105, out s6_440, out s7_441, out s10_442, out s11_443);
		s2_103->u1 = 0x01;
		a5_117 = 0x01;
		s1_118 = a0_151;
	}
	else
	{
		ptr32 a0_90;
		word32 s1_428;
		word32 a1_429;
		word32 a4_430;
		word32 a5_431;
		word32 s6_432;
		word32 s7_433;
		word32 s11_435;
		word32 s10_434;
		ra_159 = write_status(ra, a0, fp + -0x0080, 0x06, 0x04, 1107353135, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_428, out a0_90, out a1_429, out a3_138, out a4_430, out a5_431, out s2_103, out s3_104, out s4_105, out s6_432, out s7_433, out s10_434, out s11_435);
		a5_117 = (word32) *s2_103;
		s1_118 = a0_90;
		if (a5_117 == 0x00 && a0_90 == 0x00)
		{
			Eq_2 a0_121;
			Eq_2 a1_120;
			if (s3_104 != 0x00)
			{
				word32 a1_458;
				word32 a2_459;
				word32 a3_460;
				word32 a4_461;
				word32 a5_462;
				a1_120 = strlen(s3_104, out a1_458, out a2_459, out a3_460, out a4_461, out a5_462);
				a0_121 = s3_104;
			}
			else
			{
				a1_120 = (word32) s0_160->t0002;
				a0_121 = (char *) &s0_160->t0008 + 8;
			}
			word32 a4_463;
			a3_138 = update_env_cache(a0_121, a1_120, ~0x00, out a4_463, out a5_117);
		}
		s2_103->u1 = 0x00;
	}
	if (s1_118 == 0x00)
	{
		ui32 s0_190 = a5_117 & 0xFF000000;
		word32 a0_444;
		word32 a1_445;
		word32 a3_446;
		word32 a4_447;
		ra_159 = ef_port_read(ra_159, s0_190 + 0x03, fp + -0x0080, 0x03, out a0_444, out a1_445, out a3_446, out a4_447);
		s0_160 = s0_190 + 0x03;
		word32 a1_448;
		word32 a5_449;
		if (get_status(fp + -0x0080, 0x04, out a1_448, out a3_138, out a5_449) == 0x01)
		{
			ptr32 a0_220;
			word32 s1_450;
			word32 a1_451;
			word32 a4_452;
			word32 a5_453;
			word32 s6_454;
			word32 s7_455;
			word32 s10_456;
			word32 s11_457;
			ra_159 = write_status(ra_159, s0_190 + 0x03, fp + -0x0080, 0x04, 0x02, s2_103, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_450, out a0_220, out a1_451, out a3_138, out a4_452, out a5_453, out s2_103, out s3_104, out s4_105, out s6_454, out s7_455, out s10_456, out s11_457);
			s1_118 = a0_220;
		}
	}
l2302D818:
	s0Out = s0_160;
	s1Out = s1_118;
	a0Out = s1_118;
	a3Out = a3_138;
	a4Out = dwLoc70;
	s2Out = s2_103;
	s3Out = s3_104;
	s4Out = s4_105;
	return ra_159;
}

// 2302D862: Register Eq_2 move_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Register out Eq_2 s0Out, Register out (ptr32 Eq_145631) a0Out, Register out ptr32 a3Out, Register out ptr32 s3Out)
// Called from:
//      check_and_recovery_env_cb
//      do_gc
Eq_2 move_env(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg68, union Eq_2 & s0Out, struct Eq_145631 & a0Out, ptr32 & a3Out, ptr32 & s3Out)
{
	word24 nLocE8_466 = (word24) dwLocE8;
	if ((word32) *a0 == 0x02)
	{
		word32 a3_640;
		word32 a4_641;
		word32 s2_642;
		word32 s4_644;
		word32 s3_643;
		word32 s0_637;
		word32 a0_639;
		word32 s1_638;
		ra = del_env(ra, 0x00, a0, 0x00, s3, dwLocE8, dwLocE4, dwLoc98, out s0_637, out s1_638, out a0_639, out a3_640, out a4_641, out s2_642, out s3_643, out s4_644);
	}
	word32 a0_65;
	word32 s5_635;
	word32 s6_636;
	word32 s3_634;
	word32 s1_631;
	word32 a4_633;
	word32 a1_632;
	Eq_2 s2_136;
	struct Eq_145631 * s4_404;
	ptr32 a3_392;
	Eq_2 s0_134;
	Eq_2 ra_145 = alloc_env(ra, fp + -228, dwLocB0, dwLocAC, s6, dwLoc64, dwArg08, dwArg38, out s0_134, out s1_631, out a0_65, out a1_632, out a3_392, out a4_633, out s2_136, out s3_634, out s4_404, out s5_635, out s6_636);
	if (a0_65 == ~0x00)
	{
l2302D964:
		s0Out = s0_134;
		a0Out = s4_404;
		a3Out = a3_392;
		s3Out = dwLoc28;
		return ra_145;
	}
	Eq_2 s3_137;
	if ((word32) g_b4200DE2D != 0x00)
	{
		word32 a2_663;
		word32 a3_664;
		word32 a5_666;
		word32 a4_665;
		word32 a1_662;
		word32 a0_661;
		word32 t1_660;
		Eq_2 ra_107 = memset(ra_145, fp + -0x00CC, 0x00, 65, out t1_660, out a0_661, out a1_662, out a2_663, out a3_664, out a4_665, out a5_666);
		word32 a4_668;
		word32 a5_669;
		word32 a3_667;
		strncpy(fp + -0x00CC, (word32) s0_134 + 16, (word32) *((word32) s0_134 + 2), out a3_667, out a4_668, out a5_669);
		word32 s11_675;
		word32 a4_671;
		word32 s5_673;
		word32 s10_674;
		word32 a5_672;
		word32 a3_670;
		ra_145 = env_iterator(ra_107, fp + -0x0088, s2_136, s4_404, dwLocD4, dwLoc58, dwLoc18, dwArg68, out s0_134, out a3_670, out a4_671, out a5_672, out s2_136, out s3_137, out s5_673, out s10_674, out s11_675);
		dwLocE8 = (uint32) nLocE8_466;
		if (false)
			goto l2302D95A;
	}
	Eq_2 s2_172;
	Eq_2 s1_181;
	word32 s3_212;
	word32 s7_657;
	word32 s10_658;
	word32 s11_659;
	word32 a3_651;
	word32 s6_656;
	word32 a4_652;
	word32 a5_653;
	word32 s4_655;
	word32 s2_654;
	word32 a0_645;
	word32 a1_650;
	word32 a4_646;
	word32 s3_647;
	word32 s0_649;
	word32 s6_648;
	word32 a0_198;
	Eq_2 s1_208;
	Eq_2 ra_206 = write_status(update_sec_status(ra_145, fp + -228, *((word32) s0_134 + 8), null, s2_136, dwLocE8, dwLocC4, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_181, out a0_645, out a4_646, out s2_172, out s3_647, out s6_648), s1_181, fp + -0x00CC, 0x06, 0x01, s2_172, dwLocF0, dwLocEC, dwLocE8, dwLocC8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s0_649, out s1_208, out a0_198, out a1_650, out a3_651, out a4_652, out a5_653, out s2_654, out s3_212, out s4_655, out s6_656, out s7_657, out s10_658, out s11_659);
	Eq_2 s3_225 = s3_212 + ~0x07;
	Eq_2 s2_226 = 0x00;
	word32 s7_228 = (word32) s1_208 + 8;
	while (s2_226 < s3_225)
	{
		Eq_2 s5_232 = 32;
		if ((word32) s2_226 + 32 >= s3_225)
			s5_232 = s3_225 - s2_226;
		word32 s2_276;
		word32 s5_279;
		word32 s11_716;
		word32 s6_714;
		word32 s10_715;
		word32 a5_712;
		word32 s4_713;
		word32 a3_710;
		word32 a4_711;
		word32 s0_708;
		word32 a1_709;
		word32 a3_706;
		word32 a4_707;
		word32 a0_704;
		word32 a1_705;
		ra_206 = ef_port_write(ef_port_read(ra_206, (word32) s2_226 + (a0_198 + 0x08), fp + -0x0088, s5_232, out a0_704, out a1_705, out a3_706, out a4_707), s1_208, (word32) s2_226 + s7_228, fp + -0x0088, s5_232, s2_226, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s0_708, out s1_208, out a0_198, out a1_709, out a3_710, out a4_711, out a5_712, out s2_276, out s3_225, out s4_713, out s5_279, out s6_714, out s7_228, out s10_715, out s11_716);
		s2_226 = s2_276 + s5_279;
	}
	struct Eq_146412 * a1_297;
	Eq_2 s1_306;
	Eq_2 s6_313;
	word32 s10_690;
	word32 s11_691;
	word32 s4_688;
	word32 s7_689;
	word32 s2_686;
	word32 s3_687;
	word32 a0_682;
	word32 a4_684;
	word32 a5_685;
	word32 a3_683;
	word32 s0_681;
	Eq_2 ra_304 = write_status(ra_206, s1_208, fp + -0x00CC, 0x06, 0x02, s2_226, dwLocF0, dwLocEC, dwLocE8, dwLocC8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s0_681, out s1_306, out a0_682, out a1_297, out a3_683, out a4_684, out a5_685, out s2_686, out s3_687, out s4_688, out s6_313, out s7_689, out s10_690, out s11_691);
	struct Eq_146447 * s0_323 = a1_297->ptr000C;
	word32 a4_692;
	word32 a5_693;
	update_sector_cache(s1_306 & 0xFF000000, a1_297 + 0x1C + CONVERT(Mem159[s0_323 + 2:byte], byte, word32) + s1_306, out a4_692, out a5_693);
	struct Eq_146467 * a5_346;
	word32 a4_694;
	update_env_cache(s6_313, (word32) s0_323->b0002, s1_306, out a4_694, out a5_346);
	s0_134 = a5_346->t0050;
	word32 s5_702;
	word32 s6_703;
	word32 s2_700;
	word32 s4_701;
	word32 a4_699;
	word32 a3_698;
	word32 a1_697;
	word32 a0_696;
	word32 s1_695;
	ra_145 = ef_log_debug(ra_304, &g_t23081E5C, (word32) *((word32) s0_134 + 2), dwLocE8, dwLocC8, s2, s0, dwLoc58, dwLoc34, out s1_695, out a0_696, out a1_697, out a3_698, out a4_699, out s2_700, out s3_137, out s4_701, out s5_702, out s6_703);
l2302D95A:
	word32 a4_678;
	word32 s3_680;
	word32 s2_679;
	word32 a0_677;
	word32 s1_676;
	ra_145 = del_env(ra_145, 0x00, s0_134, 0x01, s3_137, dwLocE8, dwLocE4, dwLoc98, out s0_134, out s1_676, out a0_677, out a3_392, out a4_678, out s2_679, out s3_680, out s4_404);
	goto l2302D964;
}

// 2302D9AC: void check_and_recovery_env_cb(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C)
void check_and_recovery_env_cb(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C)
{
	word32 a5_13 = (word32) *a0;
	if ((word32) *((word32) a0 + 1) != 0x00 && a5_13 == 0x03)
	{
		Eq_2 s2_72;
		Eq_2 s3_73;
		Eq_2 s6_76;
		word32 a0_84;
		Eq_2 a3_87;
		word32 s3_289;
		word32 s0_288;
		word32 s11_287;
		word32 s10_286;
		word32 s9_285;
		word32 s7_284;
		word32 s5_283;
		word32 s4_282;
		word32 a5_281;
		word32 a4_280;
		word32 a3_279;
		word32 a1_278;
		word32 a0_277;
		word32 s1_276;
		Eq_2 ra_93 = move_env(ef_log_info(ra, &g_t23081A4C, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_276, out a0_277, out a1_278, out a3_279, out a4_280, out a5_281, out s2_72, out s3_73, out s4_282, out s5_283, out s6_76, out s7_284, out s9_285, out s10_286, out s11_287), a0, a0, s2_72, s3_73, s6_76, dwLoc18, dwArg18, dwArg48, out s0_288, out a0_84, out a3_87, out s3_289);
		if (a0_84 == 0x00)
		{
			word32 s1_300;
			word32 a0_301;
			word32 a1_302;
			word32 a3_303;
			word32 a4_304;
			word32 s2_305;
			word32 s3_306;
			word32 s4_307;
			word32 s5_308;
			word32 s6_309;
			ef_log_debug(ra_93, &g_t23081A98, a3_87, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_300, out a0_301, out a1_302, out a3_303, out a4_304, out s2_305, out s3_306, out s4_307, out s5_308, out s6_309);
		}
		else
		{
			word32 a3_293;
			word32 a4_294;
			word32 s2_295;
			word32 s3_296;
			word32 a1_292;
			word32 a0_291;
			word32 s1_290;
			word32 s4_297;
			word32 s5_298;
			word32 s6_299;
			ef_log_debug(ra_93, &g_t23081AB8, a3_87, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_290, out a0_291, out a1_292, out a3_293, out a4_294, out s2_295, out s3_296, out s4_297, out s5_298, out s6_299);
		}
	}
	else if (a5_13 == 0x01)
	{
		word32 s0_310;
		word32 s1_311;
		word32 a0_312;
		word32 a1_313;
		word32 a3_314;
		word32 a4_315;
		word32 a5_316;
		word32 s2_317;
		word32 s3_318;
		word32 s4_319;
		word32 s6_320;
		word32 s7_321;
		word32 s10_322;
		word32 s11_323;
		write_status(ra, a0, fp + ~0x17, 0x06, 0x05, s2, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_310, out s1_311, out a0_312, out a1_313, out a3_314, out a4_315, out a5_316, out s2_317, out s3_318, out s4_319, out s6_320, out s7_321, out s10_322, out s11_323);
	}
}

