pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302DA38: void do_gc(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_146720) a0, Register Eq_2 s2, Register Eq_2 s4, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg0118)
void do_gc(Eq_2 ra, Eq_2 s0, struct Eq_146720 * a0, Eq_2 s2, Eq_2 s4, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg0118)
{
	byte bLoc78_269 = (byte) dwLoc78;
	if ((word32) a0->b0000 == 0x00 || ((word32) a0->b0002 + ~0x01 & 0x00FF) > 0x01)
		return;
	word32 s11_431;
	word32 s10_430;
	word32 s7_429;
	word32 s6_428;
	word32 s4_427;
	word32 s3_426;
	word32 s2_425;
	word32 a5_424;
	word32 a4_423;
	word32 a3_422;
	word32 a1_421;
	word32 a0_420;
	word32 s1_419;
	Eq_2 s0_131;
	Eq_2 ra_130 = write_status(ra, a0->dw0004 + 0x03, fp + -0x007C, 0x04, 0x03, s2, dwLoc80, dwLoc7C, dwLoc78, dwLoc58, dwLoc34, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s0_131, out s1_419, out a0_420, out a1_421, out a3_422, out a4_423, out a5_424, out s2_425, out s3_426, out s4_427, out s6_428, out s7_429, out s10_430, out s11_431);
	while (true)
	{
		Eq_2 dwLoc78_272;
		byte bLoc77_268 = (byte) nLoc77_466;
		Eq_2 a0_69;
		Eq_2 s1_78;
		Eq_2 s2_79;
		word32 s0_449;
		word32 a1_450;
		word32 a5_451;
		word32 s3_452;
		word32 s5_453;
		Eq_2 ra_76 = get_next_env_addr(ra_130, s0_131, dwArg0118, out s0_449, out s1_78, out a0_69, out a1_450, out a5_451, out s2_79, out s3_452, out s5_453);
		if (a0_69 == s1_78)
			break;
		Eq_2 s2_100;
		Eq_2 s3_101;
		Eq_2 s6_109;
		word32 s4_435;
		word32 s7_436;
		word32 s10_437;
		word32 s11_438;
		word32 a5_434;
		word32 a4_433;
		word32 a3_432;
		ra_130 = read_env(ra_76, fp + -0x0078, s2_79, dwLoc70, dwLoc6C, dwLoc68, s2, s0, dwLoc24, dwArg04, out s0_131, out a3_432, out a4_433, out a5_434, out s2_100, out s3_101, out s4_435, out s6_109, out s7_436, out s10_437, out s11_438);
		dwLoc78 = nLoc77_466;
		nLoc77_466 = dwLoc78;
		if ((word32) bLoc77_268 != 0x00)
		{
			dwLoc78_272 = SEQ(nLoc77_466, bLoc78_465);
			word16 wLoc78_278 = (word16) dwLoc78_272;
			byte bLoc77_317 = SLICE(wLoc78_278, byte, 8);
			bLoc78_269 = bLoc78_465;
			bLoc78_269 = (byte) wLoc78_278;
			word16 wLoc76_323 = SLICE(dwLoc78_272, word16, 16);
			dwLoc78 = nLoc77_466;
			if (s2_100 >= ((word32) bLoc78_465 + ~0x01 & 0x00FF))
			{
				word32 a0_121;
				word32 s3_136;
				word32 a3_454;
				ra_130 = move_env(ra_130, s0_131, fp + -0x0078, s2_100, s3_101, s6_109, dwLoc78_272, s2, dwLoc18, out s0_131, out a0_121, out a3_454, out s3_136);
				dwLoc78 = SEQ(wLoc76_323, bLoc78_465);
				bLoc78_465 = bLoc78_269;
				if (a0_121 != 0x00)
				{
					word32 s1_455;
					word32 a0_456;
					word32 a1_457;
					word32 a3_458;
					word32 a4_459;
					word32 s2_460;
					word32 s3_461;
					word32 s4_462;
					word32 s5_463;
					word32 s6_464;
					ra_130 = ef_log_debug(ra_130, s3_136 + -0x041C, (word32) bLoc78_465, SEQ(bLoc78_465, bLoc78_465, wLoc78_278), dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_455, out a0_456, out a1_457, out a3_458, out a4_459, out s2_460, out s3_461, out s4_462, out s5_463, out s6_464);
					dwLoc78 = SEQ(SEQ(bLoc78_465, bLoc78_465), bLoc77_317);
				}
			}
		}
	}
	Eq_2 a3_188;
	word32 s1_439;
	word32 a0_440;
	word32 a1_441;
	word32 a3_442;
	word32 a4_443;
	word32 s2_444;
	word32 s3_445;
	word32 s4_446;
	word32 s5_447;
	word32 s6_448;
	ef_log_debug(format_sector.constprop.16(ra_76, a0_69, s2_79, dwLoc64, dwLoc50, s4, dwLoc40, dwLoc3C, dwLoc28, dwLoc18, dwLoc04, dwArg0C, out a3_188), &g_t23081C14, a3_188, dwLoc78_272, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_439, out a0_440, out a1_441, out a3_442, out a4_443, out s2_444, out s3_445, out s4_446, out s5_447, out s6_448);
}

// 2302DAFA: Register Eq_2 create_env_blob(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Register out Eq_2 s1Out, Register out (ptr32 Eq_143405) a0Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s6Out)
// Called from:
//      ef_set_env
//      psm_erase_cmd
Eq_2 create_env_blob(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgD8, union Eq_2 & s1Out, struct Eq_143405 & a0Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s6Out)
{
	ptr32 a4_106;
	Eq_2 ra_102;
	Eq_2 s1_119;
	Eq_2 s3_122;
	ptr32 s6_124;
	struct Eq_143405 * s0_132;
	Eq_2 a0_18 = *((word32) s1 + 20);
	Eq_2 dwLoc40_512 = (uint32) nLoc40;
	word24 nLoc27_493 = SLICE(s2, word24, 8);
	Eq_2 s4_100 = a0_18;
	Eq_2 s2_103 = a1;
	byte bLoc3D_526 = SLICE(dwLoc40_512, byte, 24);
	Eq_2 a3_29;
	word32 a1_619;
	word32 a2_620;
	word32 a4_621;
	word32 a5_622;
	if (strlen(a1, out a1_619, out a2_620, out a3_29, out a4_621, out a5_622) > 64)
	{
		word32 s11_643;
		word32 s10_642;
		word32 s9_641;
		word32 s7_640;
		word32 s5_639;
		word32 s4_638;
		word32 a5_637;
		word32 a3_636;
		word32 a1_635;
		word32 a0_634;
		ra_102 = ef_log_info(ra, &g_t23081B4C, a3_29, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_634, out a1_635, out a3_636, out a4_106, out a5_637, out s2_103, out s3_122, out s4_638, out s5_639, out s6_124, out s7_640, out s9_641, out s10_642, out s11_643);
		s0_132 = (struct Eq_143405 *) 0x04;
		goto l2302DB38;
	}
	word32 a4_628;
	word32 a5_629;
	word32 a3_627;
	word32 a2_626;
	word32 a1_625;
	word32 a0_624;
	word32 t1_623;
	ra_102 = memset(ra, fp + -60, 0x00FF, 0x1C, out t1_623, out a0_624, out a1_625, out a2_626, out a3_627, out a4_628, out a5_629);
	Eq_2 a3_52;
	word32 a5_633;
	word32 a4_632;
	word32 a2_631;
	word32 a1_630;
	Eq_2 a0_51 = strlen(a1, out a1_630, out a2_631, out a3_52, out a4_632, out a5_633);
	byte bLoc28_481 = (byte) a0_51;
	Eq_2 a1_60 = (word32) a3 + 28 + (a0_51 & 0x00FF);
	Eq_2 dwLoc28_494 = SEQ(nLoc27_493, bLoc28_481);
	if (a1_60 > 0x00FFFFEC)
	{
		word32 a5_647;
		word32 a3_646;
		word32 a1_645;
		word32 a0_644;
		word32 s4_648;
		word32 s5_649;
		word32 s7_650;
		word32 s9_651;
		word32 s10_652;
		word32 s11_653;
		ra_102 = ef_log_info(ra_102, &g_t23081B7C, a3_52, a1_60, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_644, out a1_645, out a3_646, out a4_106, out a5_647, out s2_103, out s3_122, out s4_648, out s5_649, out s6_124, out s7_650, out s9_651, out s10_652, out s11_653);
		s0_132 = (struct Eq_143405 *) 0x06;
		goto l2302DB38;
	}
	Eq_2 a1_104;
	a1_104 = a1_60;
	if (s1 == ~0x00)
	{
		Eq_2 a0_67;
		Eq_2 s5_82;
		word32 s1_654;
		ra_102 = new_env(ra_102, a0_18, dwLoc28_494, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg6C, dwArgA8, dwArgD8, out s1_654, out a0_67, out a1_104, out a4_106, out s2_103, out s3_122, out s4_100, out s5_82, out s6_124);
		s1_119 = a0_67;
		s0_132 = (struct Eq_143405 *) 0x06;
		if (a0_67 == s5_82)
		{
l2302DB38:
			s1Out = s1_119;
			a0Out = s0_132;
			a4Out = a4_106;
			s2Out = s2_103;
			s3Out = s3_122;
			s6Out = s6_124;
			return ra_102;
		}
	}
	struct Eq_143405 * a0_105;
	ra_102 = update_sec_status(ra_102, s4_100, a1_104, fp + -61, s2_103, a1_60, dwLoc14, dwLoc10, dwLoc0C, dwArg18, dwArg3C, out s1_119, out a0_105, out a4_106, out s2_103, out s3_122, out s6_124);
	s0_132 = a0_105;
	if (a0_105 == null)
	{
		Eq_2 a2_145;
		word32 a2_655;
		word32 a4_656;
		word32 a5_657;
		word32 a4_658;
		word32 a5_659;
		word32 a2_660;
		word32 a4_661;
		word32 a5_662;
		ef_calc_crc32(ef_calc_crc32(ef_calc_crc32(a0_105, fp + -40, 0x08, out a2_655, out a4_656, out a5_657), s2_103, (word32) bLoc28_481, out a2_145, out a4_658, out a5_659), s3_122, a2_145, out a2_660, out a4_661, out a5_662);
		struct Eq_143405 * a0_161;
		word32 s0_663;
		word32 a1_664;
		word32 a3_665;
		word32 a5_666;
		word32 s4_667;
		word32 s7_668;
		word32 s10_669;
		word32 s11_670;
		ra_102 = write_status(ra_102, s1_119, fp + -60, 0x06, 0x01, s2_103, dwLoc40_512, dwLoc3C, a1_60, dwLoc18, dwArg0C, dwArg10, dwArg14, dwArg38, ra, out s0_663, out s1_119, out a0_161, out a1_664, out a3_665, out a4_106, out a5_666, out s2_103, out s3_122, out s4_667, out s6_124, out s7_668, out s10_669, out s11_670);
		s0_132 = a0_161;
		if (a0_161 == null)
		{
			struct Eq_143405 * a0_192;
			word32 s0_671;
			word32 a1_672;
			word32 a3_673;
			word32 a5_674;
			word32 s4_675;
			word32 s5_676;
			word32 s7_677;
			word32 s10_678;
			word32 s11_679;
			ra_102 = ef_port_write(ra_102, s1_119, (word32) s1_119 + 8, fp + -52, 0x14, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_671, out s1_119, out a0_192, out a1_672, out a3_673, out a4_106, out a5_674, out s2_103, out s3_122, out s4_675, out s5_676, out s6_124, out s7_677, out s10_678, out s11_679);
			s0_132 = a0_192;
			if (a0_192 == null)
			{
				struct Eq_143405 * a0_236;
				word32 a1_237;
				struct Eq_147241 * s4_251;
				word32 t1_680;
				word32 a0_681;
				word32 a1_682;
				word32 a2_683;
				word32 a3_684;
				word32 a4_685;
				word32 a5_686;
				word32 s0_687;
				word32 a3_688;
				word32 a4_689;
				word32 a5_690;
				word32 s5_691;
				word32 s7_692;
				word32 s10_693;
				word32 s11_694;
				ra_102 = ef_port_write(memset(ra_102, fp + -64, 0x00FF, 0x01, out t1_680, out a0_681, out a1_682, out a2_683, out a3_684, out a4_685, out a5_686), s1_119, (word32) s1_119 + 28, s2_103, (word32) bLoc28_481, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_687, out s1_119, out a0_236, out a1_237, out a3_688, out a4_689, out a5_690, out s2_103, out s3_122, out s4_251, out s5_691, out s6_124, out s7_692, out s10_693, out s11_694);
				s0_132 = a0_236;
				if ((word32) bLoc3D_526 == 0x00)
				{
					word32 a4_696;
					word32 a5_697;
					update_sector_cache(s4_251->t0004, (word32) s1_119 + ((a1_237 + 0x1C) + (word32) bLoc28_481), out a4_696, out a5_697);
				}
				word32 a5_695;
				update_env_cache(s2_103, (word32) bLoc28_481, s1_119, out a4_106, out a5_695);
				if (a0_236 == null)
				{
					struct Eq_143405 * a0_318;
					word32 t1_698;
					word32 a0_699;
					word32 a1_700;
					word32 a2_701;
					word32 a3_702;
					word32 a4_703;
					word32 a5_704;
					word32 s0_705;
					word32 a1_706;
					word32 a3_707;
					word32 a5_708;
					word32 s4_709;
					word32 s5_710;
					word32 s7_711;
					word32 s10_712;
					word32 s11_713;
					ra_102 = ef_port_write(memset(ra_102, fp + -64, 0x00FF, 0x01, out t1_698, out a0_699, out a1_700, out a2_701, out a3_702, out a4_703, out a5_704), s1_119, (word32) s1_119 + ((word32) bLoc28_481 + 0x1C), s3_122, s2_103, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_705, out s1_119, out a0_318, out a1_706, out a3_707, out a4_106, out a5_708, out s2_103, out s3_122, out s4_709, out s5_710, out s6_124, out s7_711, out s10_712, out s11_713);
					s0_132 = a0_318;
					if (a0_318 == null)
					{
						struct Eq_143405 * a0_350;
						Eq_2 a3_353;
						word32 s0_714;
						word32 a1_715;
						word32 a5_716;
						word32 s4_717;
						word32 s7_718;
						word32 s10_719;
						word32 s11_720;
						ra_102 = write_status(ra_102, s1_119, fp + -60, 0x06, 0x02, s2_103, dwLoc40_512, dwLoc3C, a1_60, dwLoc18, dwArg0C, dwArg10, dwArg14, dwArg38, ra, out s0_714, out s1_119, out a0_350, out a1_715, out a3_353, out a4_106, out a5_716, out s2_103, out s3_122, out s4_717, out s6_124, out s7_718, out s10_719, out s11_720);
						s0_132 = a0_350;
						if (a0_350 == null && (word32) bLoc3D_526 != 0x00)
						{
							word32 a0_721;
							word32 a1_722;
							word32 a3_723;
							word32 a4_724;
							word32 s4_725;
							word32 s5_726;
							ra_102 = ef_log_debug(ra_102, &g_t23081BA0, a3_353, a1_60, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_721, out a1_722, out a3_723, out a4_724, out s2_103, out s3_122, out s4_725, out s5_726, out s6_124);
							g_b4200EE2C = 0x01;
							a4_106 = 0x01;
						}
					}
				}
			}
		}
	}
	goto l2302DB38;
}

// 2302DC9C: Register Eq_2 ef_get_env_blob(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      event_cb_wifi_event
//      psm_test_cmd
Eq_2 ef_get_env_blob(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s10_203;
	ptr32 s1_120;
	Eq_2 ra_104;
	ptr32 s11_204;
	ptr32 s2_121;
	ptr32 s5_124;
	ptr32 s4_123;
	ptr32 s9_212;
	if ((word32) g_b4200DE2E == 0x00)
	{
		word32 a1_411;
		word32 a3_412;
		word32 a4_413;
		word32 a0_410;
		word32 s6_416;
		word32 a5_414;
		word32 s3_415;
		word32 s7_417;
		ra_104 = ef_log_info(ra, &g_t23081D50, a3, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_120, out a0_410, out a1_411, out a3_412, out a4_413, out a5_414, out s2_121, out s3_415, out s4_123, out s5_124, out s6_416, out s7_417, out s9_212, out s10_203, out s11_204);
		goto l2302DCBE;
	}
	struct Eq_274 * a0_159;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a3_26;
		Eq_2 a4_27;
		Eq_2 a2_30;
		word32 a1_418;
		word32 a5_419;
		if (strlen(a0, out a1_418, out a2_30, out a3_26, out a4_27, out a5_419) <= 64)
		{
			Eq_2 a0_50;
			Eq_2 a5_55;
			ptr32 s1_60;
			union Eq_2 * s2_63;
			Eq_2 s3_64;
			word32 s0_426;
			word32 s2_423;
			word32 s1_422;
			word32 s3_424;
			word32 s4_425;
			Eq_2 a4_102;
			ra_104 = find_env(ra, ef_port_env_lock(a2_30, a3_26, a4_27, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, out s1_422, out s2_423, out s3_424, out s4_425), fp + -0x0078, dwLoc7C, dwLoc68, dwLoc28, dwArg58, out s0_426, out s1_60, out a0_50, out a4_102, out a5_55, out s2_63, out s3_64, out s9_212, out s10_203, out s11_204);
			if (a0_50 != 0x00)
			{
				if (s2_63 != null)
					*s2_63 = (union Eq_2 *) a5_55;
				Eq_2 s0_81 = s3_64;
				if (a5_55 < s3_64)
					s0_81 = a5_55;
				word32 a0_446;
				word32 a1_447;
				word32 a3_448;
				ra_104 = ef_port_read(ra_104, a0_50, s1_60, s0_81, out a0_446, out a1_447, out a3_448, out a4_102);
			}
			word32 s3_445;
			word32 a3_444;
			ef_port_env_unlock(a4_102, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, dwArg0108, out s1_120, out a3_444, out s2_121, out s3_445, out s4_123, out s5_124);
l2302DCBE:
			s1Out = s1_120;
			a0Out = dwLoc8C;
			s2Out = s2_121;
			s4Out = s4_123;
			s5Out = s5_124;
			s9Out = s9_212;
			s10Out = s10_203;
			s11Out = s11_204;
			return ra_104;
		}
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_428;
			xTaskGetTickCountFromISR(out a5_428);
		}
		else
		{
			word32 a5_427;
			xTaskGetTickCount(out a5_427);
		}
		word32 a1_439;
		word32 a2_440;
		word32 a5_443;
		word32 a3_441;
		word32 a4_442;
		strlen(a0, out a1_439, out a2_440, out a3_441, out a4_442, out a5_443);
		a0_159 = (struct Eq_274 *) &g_t23081D28;
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_421;
			xTaskGetTickCountFromISR(out a5_421);
		}
		else
		{
			word32 a5_420;
			xTaskGetTickCount(out a5_420);
		}
		a0_159 = (struct Eq_274 *) &g_t23081CF8;
	}
	word32 a5_434;
	word32 a4_433;
	word32 a3_432;
	word32 s7_437;
	word32 s3_435;
	word32 s6_436;
	word32 s8_438;
	word32 a0_429;
	word32 a1_430;
	word32 a2_431;
	ra_104 = bl_printk(ra, a0_159, 0x23081CDC, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_120, out a0_429, out a1_430, out a2_431, out a3_432, out a4_433, out a5_434, out s2_121, out s3_435, out s4_123, out s5_124, out s6_436, out s7_437, out s8_438, out s9_212, out s10_203, out s11_204);
	goto l2302DCBE;
}

// 2302DD92: void ef_del_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      psm_test_cmd
//      psm_unset_cmd
void ef_del_env(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg9C, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if ((word32) g_b4200DE2E != 0x00)
	{
		if (a0 != 0x00)
		{
			Eq_2 a3_14;
			Eq_2 a4_15;
			Eq_2 a2_18;
			word32 a1_262;
			word32 a5_263;
			if (strlen(a0, out a1_262, out a2_18, out a3_14, out a4_15, out a5_263) <= 64)
			{
				Eq_2 s3_31;
				Eq_2 a4_42;
				word32 s1_283;
				word32 s2_284;
				word32 s4_285;
				word32 s0_286;
				word32 s1_287;
				word32 a0_288;
				word32 a3_289;
				word32 s2_290;
				word32 s3_291;
				word32 s4_292;
				del_env(ra, ef_port_env_lock(a2_18, a3_14, a4_15, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_283, out s2_284, out s3_31, out s4_285), 0x00, 0x01, s3_31, dwLoc18, s0, dwArg38, out s0_286, out s1_287, out a0_288, out a3_289, out a4_42, out s2_290, out s3_291, out s4_292);
				word32 s1_293;
				word32 a3_294;
				word32 s2_295;
				word32 s3_296;
				word32 s4_297;
				word32 s5_298;
				ef_port_env_unlock(a4_42, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_293, out a3_294, out s2_295, out s3_296, out s4_297, out s5_298);
				return;
			}
		}
		if (g_t4200DE84 == 0x00)
		{
			word32 a5_265;
			xTaskGetTickCount(out a5_265);
		}
		else
		{
			word32 a5_264;
			xTaskGetTickCountFromISR(out a5_264);
		}
		word32 s1_266;
		word32 a0_267;
		word32 a1_268;
		word32 a2_269;
		word32 a3_270;
		word32 a4_271;
		word32 a5_272;
		word32 s2_273;
		word32 s3_274;
		word32 s4_275;
		word32 s5_276;
		word32 s6_277;
		word32 s7_278;
		word32 s8_279;
		word32 s9_280;
		word32 s10_281;
		word32 s11_282;
		bl_printk(ra, &g_t23081C54, 0x23081CDC, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_266, out a0_267, out a1_268, out a2_269, out a3_270, out a4_271, out a5_272, out s2_273, out s3_274, out s4_275, out s5_276, out s6_277, out s7_278, out s8_279, out s9_280, out s10_281, out s11_282);
	}
	else
	{
		word32 s4_255;
		word32 s5_256;
		word32 s2_253;
		word32 s3_254;
		word32 a4_251;
		word32 a5_252;
		word32 a1_249;
		word32 a3_250;
		word32 s1_247;
		word32 a0_248;
		word32 s6_257;
		word32 s7_258;
		word32 s9_259;
		word32 s10_260;
		word32 s11_261;
		ef_log_info(ra, &g_t23081C30, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_247, out a0_248, out a1_249, out a3_250, out a4_251, out a5_252, out s2_253, out s3_254, out s4_255, out s5_256, out s6_257, out s7_258, out s9_259, out s10_260, out s11_261);
	}
}

