pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302DE16: Register Eq_2 ef_set_env_blob(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s8Out)
// Called from:
//      ef_set_env
//      psm_test_cmd
Eq_2 ef_set_env_blob(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s8Out)
{
	Eq_2 ra_105;
	ptr32 s2_280;
	ptr32 s3_281;
	if ((word32) g_b4200DE2E == 0x00)
	{
		word32 a3_671;
		word32 s1_668;
		word32 s11_680;
		word32 a0_669;
		word32 s4_674;
		word32 a4_672;
		word32 a5_673;
		word32 a1_670;
		word32 s9_678;
		word32 s6_676;
		word32 s7_677;
		word32 s10_679;
		word32 s5_675;
		ra_105 = ef_log_info(ra, &g_t23081D50, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_668, out a0_669, out a1_670, out a3_671, out a4_672, out a5_673, out s2_280, out s3_281, out s4_674, out s5_675, out s6_676, out s7_677, out s9_678, out s10_679, out s11_680);
		goto l2302DE3E;
	}
	struct Eq_274 * a0_311;
	if (a0 == 0x00 || a1 == 0x00)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_681;
			xTaskGetTickCountFromISR(out a5_681);
		}
		else
		{
			word32 a5_697;
			xTaskGetTickCount(out a5_697);
		}
		a0_311 = (struct Eq_274 *) &g_t23081CF8;
l2302DE8C:
		word32 s5_690;
		word32 s9_694;
		word32 s11_696;
		word32 s10_695;
		word32 s6_691;
		word32 s7_692;
		word32 s8_693;
		word32 a2_685;
		word32 a5_688;
		word32 s4_689;
		word32 a4_687;
		word32 a3_686;
		word32 s1_682;
		word32 a0_683;
		word32 a1_684;
		ra_105 = bl_printk(ra, a0_311, 0x23081CDC, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_682, out a0_683, out a1_684, out a2_685, out a3_686, out a4_687, out a5_688, out s2_280, out s3_281, out s4_689, out s5_690, out s6_691, out s7_692, out s8_693, out s9_694, out s10_695, out s11_696);
		goto l2302DE3E;
	}
	Eq_2 a3_30;
	Eq_2 a4_31;
	Eq_2 a2_34;
	word32 a5_699;
	word32 a1_698;
	if (strlen(a0, out a1_698, out a2_34, out a3_30, out a4_31, out a5_699) > 64)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_700;
			xTaskGetTickCountFromISR(out a5_700);
		}
		else
		{
			word32 a5_706;
			xTaskGetTickCount(out a5_706);
		}
		word32 a4_704;
		word32 a5_705;
		word32 a2_702;
		word32 a3_703;
		word32 a1_701;
		strlen(a0, out a1_701, out a2_702, out a3_703, out a4_704, out a5_705);
		a0_311 = (struct Eq_274 *) &g_t23081D28;
		goto l2302DE8C;
	}
	if (a2 > 0x00FFFF8C)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_707;
			xTaskGetTickCountFromISR(out a5_707);
		}
		else
		{
			word32 a5_708;
			xTaskGetTickCount(out a5_708);
		}
		a0_311 = (struct Eq_274 *) &g_t23081DE0;
		goto l2302DE8C;
	}
	Eq_2 s1_47;
	word32 s2_709;
	word32 s4_711;
	word32 s3_710;
	ef_port_env_lock(a2_34, a3_30, a4_31, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_47, out s2_709, out s3_710, out s4_711);
	word32 a3_714;
	word32 a5_716;
	word32 a4_715;
	word32 a1_712;
	word32 a2_713;
	strlen(s1_47, out a1_712, out a2_713, out a3_714, out a4_715, out a5_716);
	word32 a0_65;
	Eq_2 s1_74;
	word32 s3_719;
	word32 s6_722;
	word32 s5_721;
	word32 s4_720;
	word32 a1_717;
	word32 s2_718;
	Eq_2 a4_131;
	ra_105 = new_env(ra, 0x42012504, dwLoc18, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg4C, s5, dwArg7C, dwArgB8, dwArgE8, out s1_74, out a0_65, out a1_717, out a4_131, out s2_718, out s3_719, out s4_720, out s5_721, out s6_722);
	if (a0_65 == ~0x00)
	{
l2302DFA8:
		word32 a3_740;
		word32 s4_741;
		word32 s5_742;
		word32 s1_739;
		ef_port_env_unlock(a4_131, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_739, out a3_740, out s2_280, out s3_281, out s4_741, out s5_742);
l2302DE3E:
		0x00 = (uint16) dwArg0128;
		s2Out = s2_280;
		s3Out = s3_281;
		s8Out = s5;
		return ra_105;
	}
	word32 a0_97;
	word32 a4_724;
	word32 s10_727;
	word32 s11_728;
	word32 s9_726;
	word32 a5_725;
	word32 s0_723;
	Eq_2 s3_111;
	Eq_2 s1_107;
	Eq_2 s2_110;
	ra_105 = find_env(ra_105, s1_74, 0x4201242C, s0, dwLoc08, dwArg38, dwArgB8, out s0_723, out s1_107, out a0_97, out a4_724, out a5_725, out s2_110, out s3_111, out s9_726, out s10_727, out s11_728);
	if (a0_97 != 0x00)
	{
		word32 a0_154;
		word32 s0_743;
		word32 a3_744;
		word32 s4_745;
		ra_105 = del_env(ra_105, s1_107, (word32) s2_110 + 0x042C, 0x00, s3_111, s6, s4, dwArg28, out s0_743, out s1_107, out a0_154, out a3_744, out a4_131, out s2_110, out s3_111, out s4_745);
		if (a0_154 != 0x00)
		{
l2302DF9A:
			if ((word32) g_b4200DE2C != 0x00)
			{
				word32 s2_737;
				word32 s4_738;
				word32 s1_736;
				ra_105 = gc_collect(ra_105, dwArg10, dwArg14, dwArg38, s3, dwArgC8, out s1_736, out a4_131, out s2_737, out s4_738);
			}
			goto l2302DFA8;
		}
	}
	Eq_2 s1_178;
	word32 s2_181;
	Eq_2 s3_182;
	word32 s6_185;
	word32 a0_196;
	ra_105 = create_env_blob(ra_105, s1_107, s1_107, s3_111, s2_110, s4, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg3C, dwArg4C, dwArg78, dwArgA8, out s1_178, out a0_196, out a4_131, out s2_181, out s3_182, out s6_185);
	if (s6_185 != 0x00 && a0_196 == 0x00)
	{
		word32 s3_734;
		word32 s4_735;
		word32 a3_732;
		word32 s2_733;
		word32 s1_730;
		word32 a0_731;
		word32 s0_729;
		ra_105 = del_env(ra_105, s1_178, s2_181 + 0x042C, 0x01, s3_182, s6, s4, dwArg28, out s0_729, out s1_730, out a0_731, out a3_732, out a4_131, out s2_733, out s3_734, out s4_735);
	}
	goto l2302DF9A;
}

// 2302DFAC: void ef_set_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      event_cb_wifi_event
//      psm_set_cmd
void ef_set_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a3_14;
	Eq_2 a1_17;
	word32 a2_88;
	word32 a4_89;
	word32 a5_90;
	strlen(a1, out a1_17, out a2_88, out a3_14, out a4_89, out a5_90);
	word32 s2_91;
	word32 s3_92;
	word32 s8_93;
	ef_set_env_blob(ra, a0, a0, a1_17, dwArg44, a3_14, s2, s3, s4, s5, s6, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg4C, dwArg68, dwArg74, dwArg78, dwArg7C, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0128, dwArg0168, out s2_91, out s3_92, out s8_93);
}

// 2302DFCC: void ef_save_env()
// Called from:
//      event_cb_wifi_event
//      psm_unset_cmd
//      psm_set_cmd
void ef_save_env()
{
}

