pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302DFD0: Register Eq_2 ef_env_set_default(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      ef_load_env
//      psm_erase_cmd
Eq_2 ef_env_set_default(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	if (g_dw4200DE20 != 0x00)
	{
		if (g_t4200DE24 != 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg8 = <invalid>;
			Eq_2 stackArg36 = <invalid>;
			Eq_2 stackArg164 = <invalid>;
			Eq_2 stackArg280 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			word32 s1_260;
			word32 s2_261;
			word32 s3_262;
			word32 s4_263;
			ef_port_env_lock(a2, a3, a4, mstatus, stackArg8, stackArg36, stackArg164, stackArg280, stackArg344, out s1_260, out s2_261, out s3_262, out s4_263);
			Eq_2 s1_24 = g_t4200DE28;
			a0_162 = a0;
			while (true)
			{
				Eq_2 a4_158;
				Eq_2 a0_162;
				if (s1_24 >= (word32) g_t4200DE28 + 0x08000000)
					break;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg28 = <invalid>;
				Eq_2 stackArg48 = <invalid>;
				Eq_2 stackArg52 = <invalid>;
				Eq_2 stackArg64 = <invalid>;
				Eq_2 stackArg68 = <invalid>;
				Eq_2 stackArg88 = <invalid>;
				Eq_2 stackArg104 = <invalid>;
				Eq_2 stackArg124 = <invalid>;
				Eq_2 stackArg140 = <invalid>;
				word32 a3_310;
				format_sector.constprop.16(ra, a0, s2, stackArg28, stackArg48, stackArg52, stackArg64, stackArg68, stackArg88, stackArg104, stackArg124, stackArg140, out a3_310);
				a0_162 = s1_24;
				a4_158 = a4;
				if (s1_24 != 0x00)
					goto l2302E078;
				s1_24 = (word32) s1_24 + 0x01000000;
			}
			Eq_148219 s1_38 = 0x00;
			a4_158 = a4;
			a3_161 = a3;
			while (true)
			{
				Eq_2 a3_161;
				if (s1_38 >= g_t4200DE24)
					break;
				a4_158 = *((word32) a3_161 + 8);
				if (a3_161 == 0x00)
				{
					word32 a1_276;
					word32 a2_277;
					word32 a3_278;
					word32 a5_279;
					a3_161 = strlen(a0_162, out a1_276, out a2_277, out a3_278, out a4_158, out a5_279);
				}
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg12 = <invalid>;
				Eq_2 stackArg16 = <invalid>;
				Eq_2 stackArg20 = <invalid>;
				Eq_2 stackArg24 = <invalid>;
				Eq_2 stackArg32 = <invalid>;
				Eq_2 stackArg36 = <invalid>;
				Eq_2 stackArg48 = <invalid>;
				Eq_2 stackArg52 = <invalid>;
				Eq_2 stackArg56 = <invalid>;
				Eq_2 stackArg60 = <invalid>;
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg108 = <invalid>;
				Eq_2 stackArg124 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				Eq_2 stackArg216 = <invalid>;
				word32 s1_295;
				word32 a0_296;
				word32 a4_297;
				word32 s2_298;
				word32 s3_299;
				word32 s6_300;
				create_env_blob(ra, s1, a1, a3, s2, stackArg12, stackArg16, stackArg20, stackArg24, stackArg32, stackArg36, stackArg48, stackArg52, stackArg56, stackArg60, stackArg72, stackArg108, stackArg124, stackArg168, stackArg216, out s1_295, out a0_296, out a4_297, out s2_298, out s3_299, out s6_300);
				a0_162 = fp + -56;
				s1_38 = (word32) s1_38.u1 + 1;
			}
l2302E078:
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg8 = <invalid>;
			Eq_2 stackArg36 = <invalid>;
			Eq_2 stackArg164 = <invalid>;
			Eq_2 stackArg280 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			Eq_2 stackArg408 = <invalid>;
			word32 s1_270;
			word32 a3_271;
			word32 s2_272;
			word32 s3_273;
			word32 s4_274;
			word32 s5_275;
			ef_port_env_unlock(a4, mstatus, stackArg8, stackArg36, stackArg164, stackArg280, stackArg344, stackArg408, out s1_270, out a3_271, out s2_272, out s3_273, out s4_274, out s5_275);
			a2Out = dwLoc0C;
			a3Out = s2;
			a4Out = a4_158;
			return dwLoc08;
		}
		else
		{
			word32 s3_250;
			word32 a4_248;
			word32 a3_247;
			word32 s6_253;
			word32 s4_251;
			word32 a1_246;
			word32 s1_244;
			word32 s2_249;
			word32 s5_252;
			word32 a0_245;
			ef_log_debug(ra, &g_t23081F80, 0x23081CC4, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_244, out a0_245, out a1_246, out a3_247, out a4_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253);
			while (true)
				;
		}
	}
	else
	{
		word32 s6_243;
		word32 s2_239;
		word32 s3_240;
		word32 s5_242;
		word32 s4_241;
		word32 a0_235;
		word32 a1_236;
		word32 a4_238;
		word32 a3_237;
		word32 s1_234;
		ef_log_debug(ra, &g_t23081F80, 0x23081CB4, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_234, out a0_235, out a1_236, out a3_237, out a4_238, out s2_239, out s3_240, out s4_241, out s5_242, out s6_243);
		while (true)
			;
	}
}

// 2302E0C4: void ef_print_env(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
// Called from:
//      psm_dump_cmd
void ef_print_env(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	if ((word32) g_b4200DE2E == 0x00)
	{
		word32 s1_215;
		word32 a0_216;
		word32 a1_217;
		word32 a3_218;
		word32 a4_219;
		word32 a5_220;
		word32 s2_221;
		word32 s3_222;
		word32 s4_223;
		word32 s5_224;
		word32 s6_225;
		word32 s7_226;
		word32 s9_227;
		word32 s10_228;
		word32 s11_229;
		ef_log_info(ra, &g_t23081D50, a3, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_215, out a0_216, out a1_217, out a3_218, out a4_219, out a5_220, out s2_221, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s9_227, out s10_228, out s11_229);
	}
	else
	{
		Eq_2 s2_23;
		struct Eq_145631 * s4_25;
		word32 s1_230;
		word32 s3_231;
		ef_port_env_lock(a2, a3, a4, mstatus, dwLoc68, dwLoc4C, dwArg34, dwArgA8, dwArgE8, out s1_230, out s2_23, out s3_231, out s4_25);
		Eq_2 a3_36;
		Eq_2 a3_67;
		Eq_2 a4_95;
		word32 s0_232;
		word32 a4_233;
		word32 a5_234;
		word32 s2_235;
		word32 s3_236;
		word32 s5_237;
		word32 s10_238;
		word32 s11_239;
		word32 s1_240;
		word32 a0_241;
		word32 a1_242;
		word32 a4_243;
		word32 a5_244;
		word32 s2_245;
		word32 s3_246;
		word32 s4_247;
		word32 s6_248;
		word32 s7_249;
		word32 s1_250;
		word32 a0_251;
		word32 a1_252;
		word32 a3_253;
		word32 a5_254;
		word32 s2_255;
		word32 s3_256;
		word32 s4_257;
		word32 s6_258;
		word32 s7_259;
		ef_print(ef_print(env_iterator(ra, fp + -0x0068, s2_23, s4_25, dwLoc54, dwArg28, dwArg68, dwArgE8, out s0_232, out a3_36, out a4_233, out a5_234, out s2_235, out s3_236, out s5_237, out s10_238, out s11_239), &g_t23081DAC, a3_36, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_240, out a0_241, out a1_242, out a3_67, out a4_243, out a5_244, out s2_245, out s3_246, out s4_247, out s6_248, out s7_249), &g_t23081DC8, a3_67, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_250, out a0_251, out a1_252, out a3_253, out a4_95, out a5_254, out s2_255, out s3_256, out s4_257, out s6_258, out s7_259);
		word32 s1_260;
		word32 a3_261;
		word32 s2_262;
		word32 s3_263;
		word32 s4_264;
		word32 s5_265;
		ef_port_env_unlock(a4_95, mstatus, dwLoc68, dwLoc4C, dwArg34, dwArgA8, dwArgE8, dwArg0128, out s1_260, out a3_261, out s2_262, out s3_263, out s4_264, out s5_265);
	}
}

// 2302E118: Register Eq_2 ef_load_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      ef_env_init
Eq_2 ef_load_env(Eq_2 ra, Eq_2 s0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out)
{
	g_b4200EE2D = 0x01;
	word32 s5_323;
	word32 s3_321;
	word32 a5_319;
	word32 a0_317;
	word32 s6_324;
	word32 s4_322;
	word32 s2_320;
	word32 a1_318;
	word32 s1_316;
	Eq_2 a4_27;
	Eq_2 a3_26;
	Eq_2 ra_123 = sector_iterator(ra, fp + -0x0080, dwArg98, out s1_316, out a0_317, out a1_318, out a3_26, out a4_27, out a5_319, out s2_320, out s3_321, out s4_322, out s5_323, out s6_324);
	Eq_2 a2_51 = ra;
	if (a4_27 == 0x08)
	{
		Eq_2 a0_56;
		Eq_2 a3_59;
		Eq_2 s5_70;
		word32 s7_347;
		word32 s6_346;
		word32 s4_345;
		word32 s3_344;
		word32 s2_343;
		word32 a5_342;
		word32 a4_341;
		word32 s1_339;
		word32 a1_340;
		word32 s9_348;
		word32 s10_349;
		word32 s11_350;
		ra_123 = ef_env_set_default(ef_log_info(ra_123, &g_t23081D6C, a3_26, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, dwArg2C, out s1_339, out a0_56, out a1_340, out a3_59, out a4_341, out a5_342, out s2_343, out s3_344, out s4_345, out s5_70, out s6_346, out s7_347, out s9_348, out s10_349, out s11_350), a0_56, a3_59, s5_70, dwLoc70, dwLoc6C, dwLoc24, out a2_51, out a3_26, out a4_27);
	}
	word32 s3_327;
	word32 s1_325;
	word32 s4_328;
	word32 s2_326;
	ef_port_env_lock(a2_51, a3_26, a4_27, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, out s1_325, out s2_326, out s3_327, out s4_328);
	word32 s5_337;
	word32 s2_335;
	word32 a5_334;
	word32 a4_333;
	word32 a1_331;
	word32 a0_330;
	word32 s1_329;
	word32 s6_338;
	word32 s3_336;
	word32 a3_332;
	struct Eq_145631 * s4_139;
	Eq_2 ra_132 = sector_iterator(ra_123, fp + -0x0080, dwArg98, out s1_329, out a0_330, out a1_331, out a3_332, out a4_333, out a5_334, out s2_335, out s3_336, out s4_139, out s5_337, out s6_338);
	Eq_2 s2_153 = 0x4200E000;
	while (true)
	{
		Eq_2 a4_167;
		byte * s0_170;
		struct Eq_148692 * s2_172;
		word32 a3_358;
		word32 a5_359;
		word32 s3_360;
		word32 s5_361;
		word32 s10_362;
		word32 s11_363;
		Eq_2 ra_181 = env_iterator(ra_132, fp + -0x0068, s2_153, s4_139, dwLoc74, dwArg08, dwArg48, dwArgC8, out s0_170, out a3_358, out a4_167, out a5_359, out s2_172, out s3_360, out s5_361, out s10_362, out s11_363);
		if ((word32) s2_172->bFFFFFE2C == 0x00)
			break;
		word32 s1_356;
		word32 a4_357;
		ra_132 = gc_collect(ra_181, s2, s0, dwLoc28, dwLoc04, dwArg68, out s1_356, out a4_357, out s2_153, out s4_139);
	}
	*s0_170 = 0x00;
	ptr32 a3_198;
	word32 s1_351;
	word32 s2_352;
	word32 s3_353;
	word32 s4_354;
	word32 s5_355;
	s0Out = ef_port_env_unlock(a4_167, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, dwArg0108, out s1_351, out a3_198, out s2_352, out s3_353, out s4_354, out s5_355);
	a0Out = 0x00;
	a3Out = a3_198;
	return ra_181;
}

// 2302E1AC: Register Eq_2 ef_env_init(Register Eq_2 ra, Register ptr32 a0, Register word32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      easyflash_init
Eq_2 ef_env_init(Eq_2 ra, ptr32 a0, word32 a1, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a3Out)
{
	if (a0 != 0x00)
	{
		ptr32 a3_11 = a0;
		ptr32 a0_13 = 0x00;
		if ((word32) g_b4200DE2E == 0x00)
		{
			((union Eq_2 *) ~0x00)->u0 = 0x4201251C;
			((union Eq_2 *) 0x07)->u0 = 0x4201251C;
			((union Eq_2 *) 0x0F)->u0 = 0x4201251C;
			((union Eq_2 *) 0x17)->u0 = 0x4201251C;
			Eq_2 a5_22 = 1107371140;
			do
			{
				*(union Eq_2 *) 0x03 = a5_22;
				a5_22 = (word32) a5_22 + 8;
			} while (a5_22 != 0x42012504);
			g_dw4200EE28 = 0x00;
			g_ptr4200EE20 = a0;
			g_dw4200EE24 = a1;
			Eq_2 s2_59;
			byte * s0_82;
			word32 s1_230;
			word32 a0_231;
			word32 a1_232;
			word32 a3_233;
			word32 a4_234;
			word32 s3_235;
			word32 s4_236;
			word32 s5_237;
			word32 s6_238;
			ra = ef_load_env(ef_log_debug(ra, &g_t23081C80, 0x00, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_230, out a0_231, out a1_232, out a3_233, out a4_234, out s2_59, out s3_235, out s4_236, out s5_237, out s6_238), 0x4200DE2E, s2_59, mstatus, dwLoc08, dwArg04, dwArg1C, dwArg38, dwArg58, dwArg78, dwArg88, dwArgB8, dwArgF8, out s0_82, out a0_13, out a3_11);
			if (a0_13 == 0x00)
				*s0_82 = 0x01;
		}
		a0Out = a0_13;
		a3Out = a3_11;
		return ra;
	}
	else
	{
		word32 s1_220;
		word32 a0_221;
		word32 a1_222;
		word32 a3_223;
		word32 a4_224;
		word32 s2_225;
		word32 s3_226;
		word32 s4_227;
		word32 s5_228;
		word32 s6_229;
		ef_log_debug(ra, &g_t23081F80, 587734132, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_220, out a0_221, out a1_222, out a3_223, out a4_224, out s2_225, out s3_226, out s4_227, out s5_228, out s6_229);
		while (true)
			;
	}
}

// 2302E25C: Register Eq_2 ef_port_read(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register out (ptr32 Eq_143850) a0Out, Register out (ptr32 Eq_143851) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      read_env
//      print_env_cb
//      get_next_env_addr
//      read_sector_meta_data
//      find_env
//      del_env
//      move_env
//      ef_get_env_blob
Eq_2 ef_port_read(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, struct Eq_143850 & a0Out, struct Eq_143851 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	int32 a0_14;
	struct Eq_143851 * a1_15;
	ptr32 a3_17;
	ptr32 a4_18;
	Eq_2 ra_20 = bl_mtd_read(ra, g_ptr4200DE34, a0, a2, a1, out a0_14, out a1_15, out a3_17, out a4_18);
	a0Out = (word32) (a0_14 < 0) << 1;
	a1Out = a1_15;
	a3Out = a3_17;
	a4Out = a4_18;
	return ra_20;
}

// 2302E27C: Register Eq_2 ef_port_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      write_status
//      format_sector.constprop.16
//      move_env
//      create_env_blob
Eq_2 ef_port_write(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_43;
	int32 a0_16;
	ptr32 a1_17;
	ptr32 a3_19;
	ptr32 a4_20;
	ptr32 a5_21;
	ptr32 s0_24;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s5_27;
	ptr32 s3_33;
	ptr32 s4_34;
	ptr32 s6_35;
	ptr32 s7_36;
	Eq_2 ra_23 = bl_mtd_write(ra, s1, a0, a2, a1, s2, dwArg00, dwArg04, dwArg28, dwArg4C, out s0_24, out s1_25, out a0_16, out a1_17, out a3_19, out a4_20, out a5_21, out s2_26, out s3_33, out s4_34, out s5_27, out s6_35, out s7_36);
	if (a0_16 < 0x00)
		a0_43 = 0x03;
	else
		a0_43 = 0x00;
	s0Out = s0_24;
	s1Out = s1_25;
	a0Out = a0_43;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_26;
	s3Out = s3_33;
	s4Out = s4_34;
	s5Out = s5_27;
	s6Out = s6_35;
	s7Out = s7_36;
	s10Out = s10_31;
	s11Out = s11_32;
	return ra_23;
}

// 2302E2A0: Register Eq_2 ef_port_env_lock(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_load_env
//      psm_erase_cmd
//      psm_dump_cmd
Eq_2 ef_port_env_lock(Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a0_5 = g_t4200DE30;
	ptr32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	word32 a0_35;
	word32 a1_36;
	word32 a2_37;
	word32 a3_38;
	word32 a4_39;
	word32 a5_40;
	Eq_2 s0_18 = xQueueSemaphoreTake(a0_5, ~0x00, a2, a3, a4, 0x4200E000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, out s1_19, out a0_35, out a1_36, out a2_37, out a3_38, out a4_39, out a5_40, out s2_20, out s3_21, out s4_22);
	s1Out = s1_19;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	return s0_18;
}

// 2302E2AE: Register word32 ef_port_env_unlock(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_load_env
//      psm_erase_cmd
//      psm_dump_cmd
word32 ef_port_env_unlock(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_5 = g_t4200DE30;
	ptr32 a3_14;
	word32 s0_19;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s5_24;
	word32 a0_46;
	word32 a1_47;
	word32 a2_48;
	word32 a4_49;
	word32 a5_50;
	word32 a7_51;
	word32 s6_52;
	word32 s8_53;
	xQueueGenericSend(a0_5, 0x00, 0x00, a4, 0x4200E000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s0_19, out s1_20, out a0_46, out a1_47, out a2_48, out a3_14, out a4_49, out a5_50, out a7_51, out s2_21, out s3_22, out s4_23, out s5_24, out s6_52, out s8_53);
	s1Out = s1_20;
	a3Out = a3_14;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s5Out = s5_24;
	return s0_19;
}

