pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302E2C0: Register Eq_2 ef_log_debug(Register Eq_2 ra, Register (ptr32 Eq_274) a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      write_status
//      read_env
//      format_sector.constprop.16
//      read_sector_meta_data
//      alloc_env
//      gc_collect
//      new_env
//      del_env
//      move_env
//      check_and_recovery_env_cb
//      do_gc
//      create_env_blob
//      ef_env_init
//      ef_port_erase
//      psm_erase_cmd
Eq_2 ef_log_debug(Eq_2 ra, struct Eq_274 * a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_21;
	ptr32 a1_22;
	ptr32 a3_24;
	ptr32 a4_25;
	ptr32 s1_28;
	ptr32 s2_31;
	ptr32 s3_32;
	ptr32 s4_33;
	ptr32 s5_34;
	ptr32 s6_35;
	word32 a2_68;
	word32 a5_69;
	word32 a7_70;
	word32 s7_71;
	word32 s8_72;
	word32 s9_73;
	word32 s10_74;
	word32 s11_75;
	word32 t4_76;
	Eq_2 ra_27 = vprint(ra, a2, fp + -20, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_28, out a0_21, out a1_22, out a2_68, out a3_24, out a4_25, out a5_69, out a7_70, out s2_31, out s3_32, out s4_33, out s5_34, out s6_35, out s7_71, out s8_72, out s9_73, out s10_74, out s11_75, out t4_76);
	s1Out = s1_28;
	a0Out = a0_21;
	a1Out = a1_22;
	a3Out = a3_24;
	a4Out = a4_25;
	s2Out = s2_31;
	s3Out = s3_32;
	s4Out = s4_33;
	s5Out = s5_34;
	s6Out = s6_35;
	return ra_27;
}

// 2302E2DE: Register Eq_2 ef_port_erase(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_144238 a0Out)
// Called from:
//      format_sector.constprop.16
Eq_2 ef_port_erase(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_144238 & a0Out)
{
	if (a0 << 0x14 == 0x00)
	{
		uint32 a0_13;
		Eq_2 ra_18 = bl_mtd_erase(ra, g_ptr4200DE34, a0, a1, out a0_13);
		a0Out = a0_13 >> 31;
		return ra_18;
	}
	else
	{
		word32 s1_62;
		word32 a0_63;
		word32 a1_64;
		word32 a3_65;
		word32 a4_66;
		word32 s2_67;
		word32 s3_68;
		word32 s4_69;
		word32 s5_70;
		word32 s6_71;
		ef_log_debug(ra, &g_t23081F80, 0x23082018, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_62, out a0_63, out a1_64, out a3_65, out a4_66, out s2_67, out s3_68, out s4_69, out s5_70, out s6_71);
		while (true)
			;
	}
}

// 2302E32A: Register Eq_2 ef_log_info(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 ptr32) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_143226) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      easyflash_init
//      check_sec_hdr_cb
//      read_sector_meta_data
//      check_and_recovery_env_cb
//      create_env_blob
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_load_env
//      ef_port_init
//      psm_dump_cmd
Eq_2 ef_log_info(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_143226 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_143226 * a5_23;
	ptr32 a0_24;
	ptr32 * a1_25;
	ptr32 a3_27;
	ptr32 a4_28;
	ptr32 s1_31;
	ptr32 s10_32;
	ptr32 s11_33;
	ptr32 s2_34;
	ptr32 s3_35;
	ptr32 s4_36;
	ptr32 s5_37;
	ptr32 s6_38;
	ptr32 s7_39;
	ptr32 s9_41;
	word32 a2_78;
	word32 a7_79;
	word32 s8_80;
	word32 t4_81;
	Eq_2 ra_30 = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_31, out a0_24, out a1_25, out a2_78, out a3_27, out a4_28, out a5_23, out a7_79, out s2_34, out s3_35, out s4_36, out s5_37, out s6_38, out s7_39, out s8_80, out s9_41, out s10_32, out s11_33, out t4_81);
	s1Out = s1_31;
	a0Out = a0_24;
	a1Out = a1_25;
	a3Out = a3_27;
	a4Out = a4_28;
	a5Out = a5_23;
	s2Out = s2_34;
	s3Out = s3_35;
	s4Out = s4_36;
	s5Out = s5_37;
	s6Out = s6_38;
	s7Out = s7_39;
	s9Out = s9_41;
	s10Out = s10_32;
	s11Out = s11_33;
	return ra_30;
}

// 2302E34A: Register Eq_2 ef_port_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      easyflash_init
Eq_2 ef_port_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out)
{
	int32 a0_27;
	Eq_2 a3_30;
	Eq_2 s0_34;
	union Eq_133241 ** s2_36;
	word32 s5_227;
	word32 s6_228;
	Eq_2 ra_43 = bl_mtd_open(ra, 0x23082084, a3, a4, a5, s3, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, dwArg5C, dwArg84, dwArg98, dwArgD8, dwArgF8, dwArg0118, out s0_34, out a0_27, out a3_30, out s2_36, out s5_227, out s6_228);
	if (a0_27 >= 0x00)
	{
		Eq_2 a3_60;
		word32 t1_229;
		word32 a0_230;
		word32 a1_231;
		word32 a2_232;
		word32 a4_233;
		word32 a5_234;
		Eq_2 ra_63 = memset(ra_43, fp + -44, 0x00, 0x1C, out t1_229, out a0_230, out a1_231, out a2_232, out a3_60, out a4_233, out a5_234);
		bl_mtd_info(*s2_36, fp + -44);
		Eq_2 a3_82;
		word32 s1_87;
		word32 a0_235;
		word32 a1_236;
		word32 a4_237;
		word32 a5_238;
		word32 s2_239;
		word32 s3_240;
		word32 s4_241;
		word32 s5_242;
		word32 s6_243;
		word32 s7_244;
		word32 s9_245;
		word32 s10_246;
		word32 s11_247;
		Eq_2 ra_86 = ef_log_info(ra_63, &g_t23082100, a3_60, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_87, out a0_235, out a1_236, out a3_82, out a4_237, out a5_238, out s2_239, out s3_240, out s4_241, out s5_242, out s6_243, out s7_244, out s9_245, out s10_246, out s11_247);
		g_dw2308200C = s1_87;
		*(union Eq_2 *) 0x01 = s0_34;
		Eq_2 a5_110;
		Eq_2 a3_114;
		Eq_2 a4_115;
		word32 s1_248;
		word32 a0_249;
		word32 a1_250;
		word32 a2_251;
		word32 a7_252;
		word32 s2_253;
		word32 s3_254;
		word32 s4_255;
		word32 s5_256;
		word32 s6_257;
		word32 s7_258;
		word32 s8_259;
		word32 s9_260;
		word32 s10_261;
		word32 s11_262;
		word32 t4_263;
		Eq_2 ra_117 = printf(ra_86, &g_t23082144, a3_82, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_248, out a0_249, out a1_250, out a2_251, out a3_114, out a4_115, out a5_110, out a7_252, out s2_253, out s3_254, out s4_255, out s5_256, out s6_257, out s7_258, out s8_259, out s9_260, out s10_261, out s11_262, out t4_263);
		ptr32 a1_132;
		ptr32 a3_134;
		word32 a0_145;
		word32 a4_264;
		word32 a5_265;
		word32 s2_266;
		word32 s3_267;
		word32 s4_268;
		word32 s5_269;
		word32 s6_270;
		xQueueCreateMutex(ra_117, a3_114, a4_115, a5_110, mstatus, s2, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_145, out a1_132, out a3_134, out a4_264, out a5_265, out s2_266, out s3_267, out s4_268, out s5_269, out s6_270);
		g_dw4200EE30 = a0_145;
		0x00 = (uint16) dwArg0128;
		a0Out = 0x00;
		a1Out = a1_132;
		a3Out = a3_134;
		return ra_117;
	}
	else
	{
		word32 s1_271;
		word32 a0_272;
		word32 a1_273;
		word32 a3_274;
		word32 a4_275;
		word32 a5_276;
		word32 s2_277;
		word32 s3_278;
		word32 s4_279;
		word32 s5_280;
		word32 s6_281;
		word32 s7_282;
		word32 s9_283;
		word32 s10_284;
		word32 s11_285;
		ef_log_info(ra_43, &g_t23082088, a3_30, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_271, out a0_272, out a1_273, out a3_274, out a4_275, out a5_276, out s2_277, out s3_278, out s4_279, out s5_280, out s6_281, out s7_282, out s9_283, out s10_284, out s11_285);
		word32 a0_286;
		word32 a1_287;
		word32 a2_288;
		word32 a4_289;
		word32 a5_290;
		word32 s4_291;
		word32 s8_292;
		puts(587735228, out a0_286, out a1_287, out a2_288, out a4_289, out a5_290, out s4_291, out s8_292);
		while (true)
			;
	}
}

// 2302E3EE: Register Eq_2 ef_print(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_144506 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_144509 s6Out, Register out ptr32 s7Out)
// Called from:
//      print_env_cb
//      psm_dump_cmd
Eq_2 ef_print(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_144506 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_144509 & s6Out, ptr32 & s7Out)
{
	ptr32 a5_23;
	ptr32 a0_24;
	ptr32 a1_25;
	ptr32 a3_27;
	ptr32 a4_28;
	ptr32 s1_31;
	Eq_144506 s2_34;
	ptr32 s3_35;
	ptr32 s4_36;
	Eq_144509 s6_38;
	ptr32 s7_39;
	word32 a2_74;
	word32 a7_75;
	word32 s5_76;
	word32 s8_77;
	word32 s9_78;
	word32 s10_79;
	word32 s11_80;
	word32 t4_81;
	Eq_2 ra_30 = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_31, out a0_24, out a1_25, out a2_74, out a3_27, out a4_28, out a5_23, out a7_75, out s2_34, out s3_35, out s4_36, out s5_76, out s6_38, out s7_39, out s8_77, out s9_78, out s10_79, out s11_80, out t4_81);
	s1Out = s1_31;
	a0Out = a0_24;
	a1Out = a1_25;
	a3Out = a3_27;
	a4Out = a4_28;
	a5Out = a5_23;
	s2Out = s2_34;
	s3Out = s3_35;
	s4Out = s4_36;
	s6Out = s6_38;
	s7Out = s7_39;
	return ra_30;
}

// 2302E40E: Register (ptr32 Eq_143405) ef_calc_crc32(Register (ptr32 Eq_143405) a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a2Out, Register out (ptr32 Eq_143412) a4Out, Register out Eq_143413 a5Out)
// Called from:
//      update_env_cache
//      read_env
//      find_env
//      create_env_blob
struct Eq_143405 * ef_calc_crc32(struct Eq_143405 * a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a2Out, struct Eq_143412 & a4Out, union Eq_143413 & a5Out)
{
	uint32 a0_15 = ~a0;
	word32 a2_8 = a2 + a1;
	while (a1 != a2_8)
	{
		a1 = (word32) a1 + 1;
		a5 = *((char *) g_a23082170 + (((word32) (*((word32) a1 - 1)) ^ a0_15) & 0x00FF) * 0x04);
		a0_15 = a0_15 >> 8 ^ a5;
	}
	a2Out = a2_8;
	a4Out = (struct Eq_143412 *) g_a23082170;
	a5Out = a5;
	return ~a0_15;
}

