pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302E43E: void psm_get_cmd()
void psm_get_cmd()
{
}

// 2302E440: void psm_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void psm_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s7, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 a6_1145;
	word32 a1_1143;
	word32 a7_1146;
	word32 a2_1144;
	Eq_2 a5_36;
	Eq_2 a3_367;
	Eq_2 a4_35;
	memcpy(fp + -88, 0x23082570, 0x18, out a1_1143, out a2_1144, out a3_367, out a4_35, out a5_36, out a6_1145, out a7_1146);
	Eq_2 s0_34 = fp + -88;
	Eq_2 s5_142 = 0x23082000;
	s1_247 = s1;
	do
	{
		Eq_2 a2_242;
		Eq_2 a5_238;
		Eq_2 s2_250;
		Eq_2 s1_247;
		Eq_2 s6_55 = *s0_34;
		Eq_2 a0_66;
		Eq_2 a3_69;
		Eq_2 a4_70;
		Eq_2 a5_71;
		Eq_2 s3_76;
		word32 s1_1184;
		word32 a1_1185;
		word32 a2_1186;
		word32 s2_1188;
		word32 s8_1190;
		word32 s4_1189;
		word32 a6_1187;
		pvPortMalloc(ra, s1_247, (word32) s6_55 + 1, a3_367, a4_35, a5_36, mstatus, dwLoc20, dwLoc1C, dwArg2C, dwArgD8, dwArg0118, out s1_1184, out a0_66, out a1_1185, out a2_1186, out a3_69, out a4_70, out a5_71, out a6_1187, out s2_1188, out s3_76, out s4_1189, out s8_1190);
		Eq_2 a0_83;
		Eq_2 s1_91;
		Eq_2 s3_93;
		Eq_2 s4_94;
		word32 s8_95;
		word32 a4_1194;
		word32 a5_1195;
		word32 a6_1196;
		word32 s2_1197;
		word32 a2_1192;
		word32 a3_1193;
		word32 a1_1191;
		Eq_2 s0_407 = pvPortMalloc(ra, a0_66, s3_76, a3_69, a4_70, a5_71, mstatus, dwLoc20, dwLoc1C, dwArg2C, dwArgD8, dwArg0118, out s1_91, out a0_83, out a1_1191, out a2_1192, out a3_1193, out a4_1194, out a5_1195, out a6_1196, out s2_1197, out s3_93, out s4_94, out s8_95);
		if (s1_91 != 0x00 && a0_83 != 0x00)
		{
			word32 a5_1159;
			word32 a0_1155;
			word32 a3_1151;
			word32 t1_1147;
			word32 a1_1156;
			word32 a2_1157;
			word32 a4_1158;
			word32 a4_1152;
			word32 a5_1153;
			word32 t1_1154;
			word32 a0_1148;
			word32 a1_1149;
			word32 a2_1150;
			Eq_2 a3_117;
			Eq_2 ra_120 = memset(memset(ra, s1_91, 0x00, s3_93, out t1_1147, out a0_1148, out a1_1149, out a2_1150, out a3_1151, out a4_1152, out a5_1153), a0_83, 0x00, s3_93, out t1_1154, out a0_1155, out a1_1156, out a2_1157, out a3_117, out a4_1158, out a5_1159);
			Eq_2 s10_123 = 0x00;
			while (s10_123 != s6_55)
			{
				a3_117 = s1_91 + s10_123;
				a3_117->u1 = 118;
				s10_123 = (word32) s10_123 + 1;
			}
			struct Eq_274 * a0_276;
			Eq_2 s2_160;
			Eq_2 s3_161;
			word32 s8_166;
			Eq_2 a0_180;
			Eq_2 s1_190;
			Eq_2 s10_191;
			word32 s11_192;
			Eq_2 s2_193;
			struct Eq_149666 * s4_195;
			word32 s5_196;
			word32 s9_200;
			Eq_2 ra_188 = ef_get_env_blob(ef_set_env_blob(ra_120, s0_407, s8_95 + 1512, s1_91, s10_123, a3_117, a0_83, s3_93, s4_94, s5_142, s6_55, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc50, dwLoc4C, s10, s2, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc14, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, s1, dwArg58, dwArg68, dwArg88, dwArgC8, dwArg0108, out s2_160, out s3_161, out s8_166), s8_166 + 1512, s2_160, fp + -92, s3_161, mstatus, dwLoc58, dwLoc4C, dwLoc08, dwArg28, dwArg68, dwArgA8, out s1_190, out a0_180, out s2_193, out s4_195, out s5_196, out s9_200, out s10_191, out s11_192);
			if (s9_200 == 0x00 && s10_191 == a0_180)
			{
				word32 a2_1199;
				word32 a4_1201;
				word32 a5_1202;
				word32 a3_1200;
				word32 a1_1198;
				Eq_2 a0_212 = memcmp(s2_193, s1_190, a0_180, out a1_1198, out a2_1199, out a3_1200, out a4_1201, out a5_1202);
				int32 a5_218 = s4_195->dwFFFFFE84;
				if (a0_212 != 0x00)
				{
					if (a5_218 != 0x00)
					{
						word32 a5_1206;
						xTaskGetTickCountFromISR(out a5_1206);
					}
					else
					{
						word32 a5_1205;
						xTaskGetTickCount(out a5_1205);
					}
					a0_276 = (struct Eq_274 *) &g_t23082678;
					goto l2302E57C;
				}
				if (a5_218 != 0x00)
				{
					word32 a5_1220;
					xTaskGetTickCountFromISR(out a5_1220);
				}
				else
				{
					word32 a5_1219;
					xTaskGetTickCount(out a5_1219);
				}
				word32 s8_1229;
				word32 s9_1230;
				word32 s10_1231;
				word32 s11_1232;
				word32 a0_1221;
				word32 s6_1227;
				word32 s7_1228;
				word32 a3_1223;
				word32 s3_1225;
				word32 s4_1226;
				word32 a4_1224;
				word32 a1_1222;
				ra = bl_printk(ra_188, s11_192 + 0x06CC, s5_196 + 1448, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1221, out a1_1222, out a2_242, out a3_1223, out a4_1224, out a5_238, out s2_250, out s3_1225, out s4_1226, out s5_142, out s6_1227, out s7_1228, out s8_1229, out s9_1230, out s10_1231, out s11_1232);
			}
			else
			{
				if (s4_195->dwFFFFFE84 != 0x00)
				{
					word32 a5_1204;
					xTaskGetTickCountFromISR(out a5_1204);
				}
				else
				{
					word32 a5_1203;
					xTaskGetTickCount(out a5_1203);
				}
				a0_276 = (struct Eq_274 *) &g_t2308262C;
l2302E57C:
				word32 s9_1216;
				word32 s10_1217;
				word32 s11_1218;
				word32 a0_1207;
				word32 a1_1208;
				word32 s7_1214;
				word32 s8_1215;
				word32 a4_1210;
				word32 s4_1212;
				word32 s6_1213;
				word32 s3_1211;
				word32 a3_1209;
				ra = bl_printk(ra_188, a0_276, s5_196 + 1448, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1207, out a1_1208, out a2_242, out a3_1209, out a4_1210, out a5_238, out s2_250, out s3_1211, out s4_1212, out s5_142, out s6_1213, out s7_1214, out s8_1215, out s9_1216, out s10_1217, out s11_1218);
			}
			goto l2302E4C6;
		}
		if (*((word32) s4_94 - 380) != 0x00)
		{
			word32 a5_1161;
			xTaskGetTickCountFromISR(out a5_1161);
		}
		else
		{
			word32 a5_1160;
			xTaskGetTickCount(out a5_1160);
		}
		word32 s4_1170;
		word32 s6_1171;
		word32 s7_1172;
		word32 s8_1173;
		word32 s10_1175;
		word32 s11_1176;
		word32 s9_1174;
		word32 a1_1168;
		word32 s3_1169;
		word32 a0_1167;
		ra = bl_printk(ra, &g_t230825B8, (word32) s5_142 + 1448, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1167, out a1_1168, out a2_242, out a3_367, out a4_35, out a5_238, out s2_250, out s3_1169, out s4_1170, out s5_142, out s6_1171, out s7_1172, out s8_1173, out s9_1174, out s10_1175, out s11_1176);
		if (s1_247 != 0x00)
		{
l2302E4C6:
			word32 a0_1162;
			word32 a6_1164;
			word32 t3_1166;
			word32 s4_1165;
			word32 a1_1163;
			vPortFree(s1_247, a2_242, a5_238, mstatus, dwArgF8, dwArg0138, out s0_407, out s1_247, out a0_1162, out a1_1163, out a2_242, out a3_367, out a4_35, out a5_238, out a6_1164, out s4_1165, out t3_1166);
		}
		if (s2_250 != 0x00)
		{
			word32 a6_1181;
			word32 s4_1182;
			word32 t3_1183;
			word32 a2_1179;
			word32 a5_1180;
			word32 a0_1177;
			word32 a1_1178;
			vPortFree(s2_250, a2_242, a5_238, mstatus, dwArgF8, dwArg0138, out s0_407, out s1_247, out a0_1177, out a1_1178, out a2_1179, out a3_367, out a4_35, out a5_1180, out a6_1181, out s4_1182, out t3_1183);
		}
		s0_34 = (word32) s0_407 + 4;
		a5_36 = fp + -64;
	} while (s0_34 != fp + -64);
	ef_del_env(ra, s0_34, 587736552, a3_367, mstatus, dwLoc5C, dwLoc58, dwLoc28, dwLoc10, dwLoc0C, dwArg18, dwArg24, s7, dwArg98, dwArgD8, dwArg0118);
}

// 2302E5FA: void psm_erase_cmd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C)
void psm_erase_cmd(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C)
{
	word32 a2_27;
	word32 a3_28;
	word32 a4_29;
	ef_env_set_default(ra, a0, a3, s5, dwArg20, dwArg24, dwArg6C, out a2_27, out a3_28, out a4_29);
}

