pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302E5FE: void psm_dump_cmd(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void psm_dump_cmd(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ef_print_env(ra, a2, a3, a4, mstatus, dwArg00, dwArg04, dwArg28, dwArg34, dwArg4C, dwArg68, dwArgA8, dwArgE8, dwArg0128);
}

// 2302E602: void psm_unset_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void psm_unset_cmd(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if (a2 == 0x02)
	{
		ef_del_env(ra, s0, a0, *((word32) a0 + 4), mstatus, dwLoc0C, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArgE8, dwArg0128, dwArg0168);
		ef_save_env();
	}
	else
	{
		word32 s1_120;
		word32 a0_121;
		word32 a1_122;
		word32 a2_123;
		word32 a3_124;
		word32 a4_125;
		word32 a5_126;
		word32 a7_127;
		word32 s2_128;
		word32 s3_129;
		word32 s4_130;
		word32 s5_131;
		word32 s6_132;
		word32 s7_133;
		word32 s8_134;
		word32 s9_135;
		word32 s10_136;
		word32 s11_137;
		word32 t4_138;
		printf(ra, &g_t2308271C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out a7_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138);
	}
}

// 2302E626: void psm_set_cmd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void psm_set_cmd(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a2 == 0x03)
	{
		ef_set_env(ra, a0, a1, s2, s3, s4, s5, s6, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg3C, dwArg58, dwArg64, dwArg68, dwArg6C, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArg0118, dwArg0158);
		ef_save_env();
	}
	else
	{
		word32 s1_141;
		word32 a0_142;
		word32 a1_143;
		word32 a2_144;
		word32 a3_145;
		word32 a4_146;
		word32 a5_147;
		word32 a7_148;
		word32 s2_149;
		word32 s3_150;
		word32 s4_151;
		word32 s5_152;
		word32 s6_153;
		word32 s7_154;
		word32 s8_155;
		word32 s9_156;
		word32 s10_157;
		word32 s11_158;
		word32 t4_159;
		printf(ra, &g_t23082588, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_141, out a0_142, out a1_143, out a2_144, out a3_145, out a4_146, out a5_147, out a7_148, out s2_149, out s3_150, out s4_151, out s5_152, out s6_153, out s7_154, out s8_155, out s9_156, out s10_157, out s11_158, out t4_159);
	}
}

// 2302E64C: void easyflash_cli_init()
// Called from:
//      aos_loop_proc
void easyflash_cli_init()
{
}

// 2302E650: Register (ptr32 Eq_126385) xEventGroupCreateStatic(Register (ptr32 Eq_126385) a0, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out (ptr32 Eq_126389) a5Out)
// Called from:
//      cmd_mgr_queue
struct Eq_126385 * xEventGroupCreateStatic(struct Eq_126385 * a0, Eq_2 a4, ptr32 mstatus, union Eq_2 & a4Out, struct Eq_126389 & a5Out)
{
	struct Eq_126389 * a5_14;
	if (a0 != null)
	{
		if (a4 != 32)
		{
			word32 a5_57;
			vAssertCalled(a4, mstatus, out a5_57);
		}
		a0->dw0000 = 0x00;
		a4 = vListInitialise(&a0->dw0000 + 1);
		a0->b001C = 0x01;
		a5_14 = (struct Eq_126389 *) 0x01;
	}
	else
	{
		word32 a5_56;
		vAssertCalled(a4, mstatus, out a5_56);
		a5_14 = (struct Eq_126389 *) 32;
		if (a4 != 32)
			vAssertCalled(a4, mstatus, out a5_14);
	}
	a4Out = a4;
	a5Out = a5_14;
	return a0;
}

// 2302E69C: Register (ptr32 int32) xEventGroupWaitBits(Register (ptr32 int32) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_126492 a5Out, Register out Eq_2 s3Out)
// Called from:
//      cmd_mgr_queue
int32 * xEventGroupWaitBits(int32 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_126492 & a5Out, union Eq_2 & s3Out)
{
	Eq_2 s3_146 = a4;
	if (a0 == null)
	{
		word32 a5_467;
		vAssertCalled(a4, mstatus, out a5_467);
	}
	Eq_2 a3_165;
	Eq_126492 a5_167;
	Eq_2 a4_160;
	int32 * s0_201;
	int32 s0_229;
	Eq_2 a4_114;
	Eq_2 a5_203;
	if ((a1 & 0xFF000000) == 0x00 && a1 != 0x00)
	{
		word32 a5_470;
		if (xTaskGetSchedulerState(out a5_470) != 0x00)
			goto l2302E6C8;
	}
	else
	{
		word32 a5_468;
		vAssertCalled(a4, mstatus, out a5_468);
		word32 a5_469;
		if (xTaskGetSchedulerState(out a5_469) != 0x00)
			goto l2302E6C8;
	}
	if (a4 != 0x00)
	{
		word32 a5_490;
		vAssertCalled(a4, mstatus, out a5_490);
		word32 a5_491;
		a4_114 = vTaskSuspendAll(a4, out a5_491);
		s0_229 = *a0;
		a5_203 = a1 & s0_229;
		if (a3 == 0x00)
		{
l2302E6D8:
			if (a5_203 != 0x00)
			{
l2302E6DA:
				if (a2 != 0x00)
				{
					*a0 = ~a1 & s0_229;
					word32 s1_478;
					word32 t3_483;
					word32 a0_479;
					word32 s4_482;
					word32 a2_480;
					word32 a6_481;
					xTaskResumeAll(a3, a4_114, a5_203, mstatus, dwArg0128, dwArg0168, out s0_201, out s1_478, out a0_479, out a2_480, out a3_165, out a4_160, out a5_167, out a6_481, out s4_482, out t3_483);
					goto l2302E6EC;
				}
l2302E762:
				word32 s1_472;
				word32 a0_473;
				word32 s4_476;
				word32 a2_474;
				word32 t3_477;
				word32 a6_475;
				xTaskResumeAll(a3, a4_114, a5_203, mstatus, dwArg0128, dwArg0168, out s0_201, out s1_472, out a0_473, out a2_474, out a3_165, out a4_160, out a5_167, out a6_475, out s4_476, out t3_477);
				goto l2302E6EC;
			}
l2302E710:
			if (a4 == 0x00)
				goto l2302E762;
			ui32 a1_89 = (word32) (a2 != 0x00);
			ui32 a1_90 = a1_89 << 24;
			if (a3 != 0x00)
				a1_90 = a1_89 << 24 | 0x04000000;
			Eq_2 a5_141;
			int32 * s2_145;
			ui32 s1_155;
			word32 s4_156;
			struct Eq_150186 * a3_159;
			word32 s0_484;
			word32 a5_486;
			word32 a2_485;
			word32 a6_487;
			word32 t3_488;
			int32 a0_150;
			xTaskResumeAll(a3, vTaskPlaceOnUnorderedEventList(a0 + 1, a1_90 | a1, a4, a3, a4_114, mstatus, dwLoc0C, dwArg18, out a5_141, out s2_145, out s3_146), a5_141, mstatus, dwArg0128, dwArg0168, out s0_484, out s1_155, out a0_150, out a2_485, out a3_159, out a4_160, out a5_486, out a6_487, out s4_156, out t3_488);
			if (a0_150 == 0x00)
				__syscall();
			a3_165 = uxTaskResetEventItemValue(a3_159, a4_160);
			a5_167 = a0_150 << 0x06;
			if (a0_150 << 0x06 < 0x00)
			{
l2302E740:
				s0_201 = (word32) (word24) a0_150;
l2302E6EC:
				0x00 = (uint16) dwArg0128;
				a2Out = dwArg0100;
				a3Out = a3_165;
				a4Out = a4_160;
				a5Out = a5_167;
				s3Out = s3_146;
				return s0_201;
			}
			word32 a5_489;
			vTaskEnterCritical(a4_160, mstatus, out a5_489);
			a0_150 = *s2_145;
			ui32 a5_175 = s1_155 & a0_150;
			if (s4_156 == 0x00)
			{
				if (a5_175 == 0x00)
					goto l2302E796;
			}
			else if (s1_155 != a5_175)
				goto l2302E796;
			if (a2 != 0x00)
				*s2_145 = ~s1_155 & a0_150;
l2302E796:
			a3_165 = vTaskExitCritical(a3_165, mstatus, out a4_160, out a5_167);
			goto l2302E740;
		}
l2302E70C:
		if (a1 == a5_203)
			goto l2302E6DA;
		goto l2302E710;
	}
l2302E6C8:
	word32 a5_471;
	a4_114 = vTaskSuspendAll(a4, out a5_471);
	s0_229 = *a0;
	a5_203 = a1 & s0_229;
	if (a3 == 0x00)
		goto l2302E6D8;
	goto l2302E70C;
}

// 2302E7A6: Register Eq_2 xEventGroupSetBits(Register Eq_2 s0, Register ptr32 a0, Register Eq_125686 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack (ptr32 Eq_125592) dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_2) s1Out, Register out (ptr32 (ptr32 Eq_2)) a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_2) a4Out, Register out (ptr32 Eq_125698) a5Out, Register out Eq_125686 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_125592) s4Out)
// Called from:
//      cmd_complete.isra.1
//      cmd_mgr_drain
Eq_2 xEventGroupSetBits(Eq_2 s0, ptr32 a0, Eq_125686 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_125592 * dwArg04, Eq_2 dwArg24, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_125698 & a5Out, union Eq_125686 & s2Out, ptr32 & s3Out, struct Eq_125592 & s4Out)
{
	Eq_125686 s2_156 = a1;
	if (a0 == 0x00)
	{
		word32 a5_270;
		vAssertCalled(a4, mstatus, out a5_270);
	}
	if ((a1 & 0xFF000000) != 0x00)
	{
		word32 a5_271;
		vAssertCalled(a4, mstatus, out a5_271);
	}
	word32 s1_101;
	Eq_2 a5_119;
	Eq_2 a4_126 = vTaskSuspendAll(a4, out a5_119);
	word32 s1_44 = *((word32) s0 + 16);
	Eq_2 a3_110 = a1 | a3;
	*a3_110 = s1_44;
	s1_101 = s1_44;
	if (s1_44 + 0x0C != s0)
	{
		ui32 s5_106 = 0x00;
		s2_156.u0 = 0x00FFFFFF;
		ui32 s4_155 = 0x02000000;
		s1_101 = s1_44;
		do
		{
			Eq_2 a2_61 = a4_126 & s2_156;
			ui32 a1_59 = a3_110 | s4_155;
			a5_119 = a4_126 << 0x05;
			Eq_2 a6_63 = a2_61 & a3_110;
			struct Eq_125592 * s0_105 = *((word32) *a4_126 + 4);
			if (a5_119 >= 0x00)
			{
				if (a6_63 != 0x00)
					goto l2302E806;
			}
			else
			{
				if (a2_61 != a6_63)
				{
					if (s1_44 + 0x0C == s0_105)
						break;
					continue;
				}
l2302E806:
				if (a4_126 << 0x07 < 0x00)
					s5_106 |= a2_61;
				word32 s1_278;
				word32 a0_279;
				word32 a2_280;
				s0_105 = vTaskRemoveFromUnorderedEventList(s0_105, a1_59, a2_61, a3_110, a4_126, mstatus, dwArg04, dwArg24, out s1_278, out a0_279, out a2_280, out a3_110, out a4_126, out a5_119, out s2_156, out s4_155);
				s1_101 = (word32) *a3_110;
			}
		} while (s1_44 + 0x0C != s0_105);
		a3_110 &= ~s5_106;
	}
	*a3_110 = s1_101;
	union Eq_2 ** a0_134;
	struct Eq_125698 * a5_136;
	ptr32 a3_143;
	union Eq_2 * a4_144;
	word32 s4_276;
	word32 t3_277;
	word32 s0_272;
	word32 s1_273;
	word32 a2_274;
	word32 a6_275;
	xTaskResumeAll(a3_110, a4_126, a5_119, mstatus, dwArg0138, dwArg0178, out s0_272, out s1_273, out a0_134, out a2_274, out a3_143, out a4_144, out a5_136, out a6_275, out s4_276, out t3_277);
	s1Out = (union Eq_2 *) *a0_134;
	a0Out = a0_134;
	a3Out = a3_143;
	a4Out = a4_144;
	a5Out = a5_136;
	s2Out = s2_156;
	s3Out = s1_44 + 0x0C;
	s4Out = dwArg04;
	return s1;
}

// 2302E854: void vEventGroupDelete(Register (ptr32 Eq_126473) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack (ptr32 Eq_125592) dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
// Called from:
//      cmd_mgr_queue
void vEventGroupDelete(struct Eq_126473 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_125592 * dwArg14, Eq_2 dwArg34, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	struct Eq_150416 * a5_14;
	Eq_2 a4_13 = vTaskSuspendAll(a4, out a5_14);
	Eq_2 s0_15 = a5_14->t0004;
	struct Eq_126473 * s1_16 = (word32) s0_15 + 0x0C;
	if (a5_14 != null)
	{
		do
		{
			struct Eq_125592 * s0_19 = a0->ptr0010;
			if (a0 == s1_16)
			{
				struct Eq_150461 * a5_50;
				word32 a5_161;
				word32 s2_162;
				word32 s4_163;
				vTaskRemoveFromUnorderedEventList(a0->ptr0010, 0x02000000, vAssertCalled(a4_13, mstatus, out a5_161), a3, a4_13, mstatus, dwArg14, dwArg34, out s1_16, out a0, out a2, out a3, out a4_13, out a5_50, out s2_162, out s4_163);
				s0_15 = a5_50->t0004;
				if (a5_50 == null)
					break;
				continue;
			}
			struct Eq_150442 * a5_32;
			word32 s4_160;
			word32 s2_159;
			vTaskRemoveFromUnorderedEventList(s0_19, 0x02000000, a2, a3, a4_13, mstatus, dwArg14, dwArg34, out s1_16, out a0, out a2, out a3, out a4_13, out a5_32, out s2_159, out s4_160);
			s0_15 = a5_32->t0004;
		} while (a5_32 != null);
	}
	Eq_2 a5_61 = (word32) *((word32) s0_15 + 28);
	if (a5_61 == 0x00)
	{
		Eq_2 a3_69;
		Eq_2 a4_70;
		Eq_2 a5_71;
		word32 s0_164;
		word32 s1_165;
		word32 a0_166;
		word32 a1_167;
		word32 a2_168;
		word32 a6_169;
		word32 s4_170;
		word32 t3_171;
		vPortFree(s0_15, a2, a5_61, mstatus, dwArg0148, dwArg0188, out s0_164, out s1_165, out a0_166, out a1_167, out a2_168, out a3_69, out a4_70, out a5_71, out a6_169, out s4_170, out t3_171);
		word32 s0_182;
		word32 s1_183;
		word32 a0_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a6_189;
		word32 s4_190;
		word32 t3_191;
		xTaskResumeAll(a3_69, a4_70, a5_71, mstatus, dwArg0158, dwArg0198, out s0_182, out s1_183, out a0_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out s4_190, out t3_191);
	}
	else
	{
		word32 s0_172;
		word32 s1_173;
		word32 a0_174;
		word32 a2_175;
		word32 a3_176;
		word32 a4_177;
		word32 a5_178;
		word32 a6_179;
		word32 s4_180;
		word32 t3_181;
		xTaskResumeAll(a3, a4_13, a5_61, mstatus, dwArg0158, dwArg0198, out s0_172, out s1_173, out a0_174, out a2_175, out a3_176, out a4_177, out a5_178, out a6_179, out s4_180, out t3_181);
	}
}

// 2302E8B4: Register word32 vListInitialise(Register Eq_2 a0)
// Called from:
//      xEventGroupCreateStatic
//      xQueueGenericReset
//      prvAddNewTaskToReadyList
//      prvCheckForValidListAndQueue
word32 vListInitialise(Eq_2 a0)
{
	*((word32) a0 + 0x0C) = a0;
	*(union Eq_2 *) 0x07 = a0;
	*((word32) a0 + 20) = a0;
	*((word32) a0 + 24) = a0;
	*a0 = 0x00;
	return ~0x00;
}

// 2302E8C8: void vListInitialiseItem(Register (ptr32 Eq_150572) a0)
// Called from:
//      prvInitialiseNewTask.isra.2
//      xTimerCreateStatic
void vListInitialiseItem(struct Eq_150572 * a0)
{
	a0->dw0010 = 0x00;
}

// 2302E8CE: Register word32 vListInsertEnd(Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 Eq_150581) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      xTaskPriorityInherit
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
//      aos_task_exit
word32 vListInsertEnd(Eq_2 a1, Eq_2 a4, Eq_2 a5, struct Eq_150581 & a5Out)
{
	Eq_2 a0_5 = *((word32) a5 + 4);
	*((word32) a5 + 4) = a1;
	Eq_2 a5_9 = *((word32) a4 + 8);
	*((word32) a4 + 8) = a1;
	*((word32) a1 + 4) = a4;
	*((word32) a1 + 8) = a5_9;
	*((word32) a0_5 + 16) = a1;
	word32 a0_14 = *a5_9;
	*((word32) a5_9 + 1) = a0_14;
	a5Out = (word32) a5_9 + 1;
	return a0_14;
}

// 2302E8E4: Register Eq_2 vListInsert(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      vTaskPlaceOnEventList
//      prvInsertTimerInActiveList
//      prvSwitchTimerLists
Eq_2 vListInsert(Eq_2 a0, Eq_2 a2, Eq_2 a3, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_11;
	Eq_2 a1_5 = *a2;
	struct Eq_150623 * a5_13 = (struct Eq_150623 *) ~0x00;
	if (a2 == ~0x00)
	{
		a0 = *((word32) a0 + 24);
		a4_11 = *(union Eq_2 *) 0x03;
	}
	else
	{
		do
		{
			a4_11 = a5_13->t0004;
			a5_13 = (struct Eq_150623 *) *a3;
		} while (a2 >= a3);
	}
	a5_13->t0004 = a1_5;
	*((word32) a1_5 + 8) = a5_13;
	*((word32) a4_11 + 8) = a1_5;
	*((word32) a1_5 + 4) = a4_11;
	*((word32) a0 + 16) = a1_5;
	Eq_2 a0_29 = a5_13->t0000;
	union Eq_2 * a5_30 = (char *) &a5_13->t0000 + 1;
	*a5_30 = (union Eq_2 *) a0_29;
	a4Out = a4_11;
	a5Out = a5_30;
	return a0_29;
}

// 2302E914: Register Eq_2 uxListRemove(Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      prvIdleTask
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskPlaceOnEventList
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      xTaskPriorityInherit
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
//      prvSwitchTimerLists
//      prvTimerTask
//      aos_task_exit
Eq_2 uxListRemove(Eq_2 a3, Eq_2 a4, union Eq_2 & a4Out, ptr32 & a5Out)
{
	*((word32) a4 + 8) = a3;
	Eq_2 a0_11 = *((word32) a3 + 4);
	*((word32) a3 + 4) = a4;
	word32 a5_13 = *((word32) a4 + 4);
	if (a4 == a0_11)
	{
		Eq_2 a0_14 = *((word32) a4 + 8);
		*((word32) a4 + 4) = a5_13;
		*((word32) a0_14 + 16) = 0x00;
		*((word32) a4 - 1) = *a4;
		ptr32 a5_20 = *a0_14;
		a4Out.u0 = <invalid>;
		a5Out = a5_20;
		return a0_14;
	}
	else
	{
		*((word32) a0_11 + 16) = 0x00;
		*((word32) a4 - 1) = *a4;
		ptr32 a5_25 = *a0_11;
		a4Out.u0 = <invalid>;
		a5Out = a5_25;
		return a0_11;
	}
}

// 2302E946: Register uint32 prvCopyDataToQueue(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out)
// Called from:
//      xQueueGenericSend
//      xQueueGenericSendFromISR
uint32 prvCopyDataToQueue(Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out)
{
	ptr32 a0_126;
	Eq_2 a0_14 = *((word32) s1 + 56);
	Eq_2 s0_102 = a0_14;
	if (a5 == 0x00)
	{
		s1 = (word32) s1 + 1;
		a0_126 = 0x00;
		if (a5 == 0x00)
		{
			s0_102 = *(union Eq_2 *) 0x08;
			s1 = xTaskPriorityDisinherit(0x00, a1, a3, a4, mstatus, out a0_126, out a1, out a4, out a5);
			*((word32) s0_102 + 8) = 0x00;
		}
	}
	else
	{
		s2 = a2;
		if (a2 == 0x00)
		{
			word32 a5_61;
			word32 a2_188;
			word32 a6_189;
			t1 = memcpy(*((word32) a0_14 + 4), a1, a5, out a1, out a2_188, out a3, out a4, out a5_61, out a6_189, out a7);
			s0_102 = *((word32) a4 + 8);
			a5 = (word32) a3 + a5_61;
			*((word32) a5 + 4) = s0_102;
			s1 = (word32) s1 + 1;
			a0_126 = 0x00;
			if (a5 >= a4)
			{
				Eq_2 s0_79 = *a5;
				*((word32) s1 + 57) = s0_79;
				*((word32) a5 + 4) = s0_79;
				0x00 = (uint16) dwArg38;
				s1Out = (word32) s1 + 1;
				a0Out = 0x00;
				a1Out = a1;
				a2Out.u0 = <invalid>;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				a7Out = a7;
				s2Out = a2;
				return t1;
			}
		}
		else
		{
			word32 a4_21;
			word32 a5_22;
			word32 a2_186;
			word32 a6_187;
			t1 = memcpy(*((word32) a0_14 + 0x0C), a1, a5, out a1, out a2_186, out a3, out a4_21, out a5_22, out a6_187, out a7);
			a4 = 0x00 - a4_21;
			s0_102 = *a3;
			Eq_2 a5_38 = (word32) a4 + a5_22;
			*((word32) a5_38 + 0x0C) = s0_102;
			if (a5_38 < a3)
			{
				s0_102 = *((word32) a5_38 + 8);
				a4 += a5_38;
				*((word32) a4 + 0x0C) = s0_102;
			}
			a5.u0 = 0x02;
			if (a2 != 0x02)
			{
				*((word32) s1 + 57) = s0_102;
				0x00 = (uint16) dwArg38;
				s1Out = (word32) s1 + 1;
				a0Out = 0x00;
				a1Out = a1;
				a2Out.u0 = <invalid>;
				a3Out = a3;
				a4Out = a4;
				a5Out.u0 = 0x02;
				a7Out = a7;
				s2Out = a2;
				return t1;
			}
			a0_126 = 0x00;
			if (s1 == 0x00)
				s1.u0 = 0x01;
		}
	}
	*((word32) s1 + 56) = s0_102;
	0x00 = (uint16) dwArg38;
	s1Out = s1;
	a0Out = a0_126;
	a1Out = a1;
	a2Out.u0 = <invalid>;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s2Out = s2;
	return t1;
}

// 2302E9EA: Register Eq_2 prvCopyDataFromQueue(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      xQueueReceive
Eq_2 prvCopyDataFromQueue(Eq_2 a1, Eq_2 a2, Eq_2 a4, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a2 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a1;
		return a1;
	}
	else
	{
		word32 a1_11 = a1 + a2;
		*((word32) a1_11 + 0x0C) = *((word32) a4 + 8);
		if (a1_11 >= a4)
			*((word32) a1_11 + 0x0C) = *a1_11;
		Eq_2 a4_19;
		Eq_2 a5_20;
		Eq_2 a1_22;
		Eq_2 a2_23;
		ptr32 a3_24;
		word32 a6_61;
		word32 a7_62;
		memcpy(a1, a1_11, a2, out a1_22, out a2_23, out a3_24, out a4_19, out a5_20, out a6_61, out a7_62);
		a2Out = a2_23;
		a3Out = a3_24;
		a4Out = a4_19;
		a5Out = a5_20;
		return a1_22;
	}
}

