pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302EA08: Register Eq_2 prvUnlockQueue(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      vQueueWaitForMessageRestricted
Eq_2 prvUnlockQueue(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_150919 * a5_16;
	Eq_2 a4_123 = vTaskEnterCritical(a4, mstatus, out a5_16);
	Eq_2 s1_100 = a0;
	Eq_2 s0_122 = (int32) (byte) (word32) *((word32) a0 + 69);
	if (s0_122 > 0x00)
	{
		s1_100 = a5_16->t0024;
		if (a5_16 != null)
		{
			do
			{
				word32 a0_31;
				word32 a5_176;
				s1_100 = xTaskRemoveFromEventList(s0_122, a1, a2, a3, a4_123, mstatus, out a0_31, out a1, out a2, out a3, out a4_123, out a5_176);
				if (a0_31 != 0x00)
				{
					int32 s0_43 = (word32) s0_122 - 1;
					a4_123 = vTaskMissedYield();
					s0_122 = (int32) (byte) (s0_43 & 0x00FF);
					if ((s0_43 & 0x00FF) == 0x00)
						break;
				}
				else
				{
					int32 s0_39 = (word32) s0_122 - 1;
					s0_122 = (int32) (byte) (s0_39 & 0x00FF);
					if ((s0_39 & 0x00FF) == 0x00)
						break;
				}
				struct Eq_151034 * a5_49 = (word32) s0_122 - 1 & 0x00FF;
				s1_100 = a5_49->t0024;
			} while (a5_49 != null);
		}
	}
	((word32) s1_100 + 69)->u1 = ~0x00;
	Eq_2 a4_63;
	word32 a5_175;
	Eq_2 a3_114 = vTaskExitCritical(a3, mstatus, out a4_63, out a5_175);
	struct Eq_150945 * a5_64;
	Eq_2 a4_130 = vTaskEnterCritical(a4_63, mstatus, out a5_64);
	Eq_2 s0_129 = (int32) (byte) (word32) *((word32) s1_100 + 0x0044);
	if (s0_129 > 0x00)
	{
		s1_100 = a5_64->t0010;
		if (a5_64 != null)
		{
			do
			{
				word32 a0_79;
				word32 a5_177;
				s1_100 = xTaskRemoveFromEventList(s0_129, a1, a2, a3_114, a4_130, mstatus, out a0_79, out a1, out a2, out a3_114, out a4_130, out a5_177);
				if (a0_79 != 0x00)
				{
					int32 s0_91 = (word32) s0_129 - 1;
					a4_130 = vTaskMissedYield();
					s0_129 = (int32) (byte) (s0_91 & 0x00FF);
					if ((s0_91 & 0x00FF) == 0x00)
						break;
				}
				else
				{
					int32 s0_87 = (word32) s0_129 - 1;
					s0_129 = (int32) (byte) (s0_87 & 0x00FF);
					if ((s0_87 & 0x00FF) == 0x00)
						break;
				}
				struct Eq_151071 * a5_97 = (word32) s0_129 - 1 & 0x00FF;
				s1_100 = a5_97->t0010;
			} while (a5_97 != null);
		}
	}
	((word32) s1_100 + 0x0044)->u1 = ~0x00;
	0x00 = (uint16) dwArg38;
	ptr32 a5_118;
	ptr32 a4_120;
	Eq_2 a3_119 = vTaskExitCritical(a3_114, mstatus, out a4_120, out a5_118);
	a4Out = a4_120;
	a5Out = a5_118;
	return a3_119;
}

// 2302EABE: Register Eq_2 xQueueGenericReset(Register (ptr32 Eq_151080) a0, Register Eq_2 a1, Register (ptr32 Eq_151080) a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_151088 a5Out)
// Called from:
//      xQueueGenericCreateStatic
//      xQueueGenericCreate
Eq_2 xQueueGenericReset(struct Eq_151080 * a0, Eq_2 a1, struct Eq_151080 * a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_151088 & a5Out)
{
	Eq_2 s1_106 = a1;
	if (a0 == null)
	{
		word32 a5_113;
		vAssertCalled(a4, mstatus, out a5_113);
	}
	word32 a5_20;
	Eq_2 a4_21 = vTaskEnterCritical(a4, mstatus, out a5_20);
	struct Eq_151101 * s0_27 = *a4_21;
	s0_27->dw0038 = 0x00;
	s0_27->b0044 = ~0x00;
	*((word32) a4_21 + 4) = s0_27;
	s0_27->b0045 = ~0x00;
	word32 a5_29 = a3 + a5_20 / 84;
	Eq_2 a3_34 = a5_29 - a3;
	struct Eq_151124 * a5_35 = (word32) a4_21 + a5_29;
	a5_35->ptr0008 = s0_27;
	word32 a4_36 = a4_21 + a3_34;
	*((word32) a4_36 + 0x0C) = s0_27;
	if (a1 != 0x00)
	{
		vListInitialise((char *) s0_27 + 16);
		vListInitialise((char *) s0_27 + 36);
		Eq_151088 a5_46;
		ptr32 a4_48;
		Eq_2 a3_47 = vTaskExitCritical(a3_34, mstatus, out a4_48, out a5_46);
		a1Out = a1;
		a3Out = a3_47;
		a4Out = a4_48;
		a5Out = a5_46;
		return a1;
	}
	else
	{
		Eq_2 s0_55 = a5_35->t0010;
		if (a5_35 != null)
		{
			word32 a0_58;
			word32 a2_114;
			word32 a4_115;
			word32 a5_116;
			s1_106 = xTaskRemoveFromEventList(s0_55, a1, ~0x00, a3_34, a4_36, mstatus, out a0_58, out a1, out a2_114, out a3_34, out a4_115, out a5_116);
			if (a0_58 != 0x00)
			{
				__syscall();
				Eq_151088 a5_66;
				ptr32 a4_68;
				Eq_2 a3_67 = vTaskExitCritical(a3_34, mstatus, out a4_68, out a5_66);
				a1Out = a1;
				a3Out = a3_67;
				a4Out = a4_68;
				a5Out = a5_66;
				return s1_106;
			}
		}
		Eq_151088 a5_76;
		ptr32 a4_78;
		Eq_2 a3_77 = vTaskExitCritical(a3_34, mstatus, out a4_78, out a5_76);
		a1Out = a1;
		a3Out = a3_77;
		a4Out = a4_78;
		a5Out = a5_76;
		return s1_106;
	}
}

// 2302EB50: Register word32 xQueueGenericCreateStatic(Register ptr32 a0, Register (ptr32 Eq_151190) a1, Register (ptr32 Eq_151080) a2, Register (ptr32 Eq_151080) a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_151190) s1Out, Register out (ptr32 Eq_151080) a0Out, Register out (ptr32 Eq_151080) a3Out, Register out Eq_2 a4Out, Register out Eq_151200 a5Out, Register out (ptr32 Eq_151080) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      xQueueCreateMutexStatic
//      prvCheckForValidListAndQueue
word32 xQueueGenericCreateStatic(ptr32 a0, struct Eq_151190 * a1, struct Eq_151080 * a2, struct Eq_151080 * a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_151190 & s1Out, struct Eq_151080 & a0Out, struct Eq_151080 & a3Out, union Eq_2 & a4Out, union Eq_151200 & a5Out, struct Eq_151080 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	struct Eq_151190 * s1_100 = a1;
	struct Eq_151080 * s2_198 = a2;
	if (a0 != 0x00)
	{
		if (a3 != null)
			goto l2302EB6C;
	}
	else
	{
		word32 a5_209;
		vAssertCalled(a4, mstatus, out a5_209);
		if (a3 != null)
			goto l2302EB6C;
	}
	word32 a5_210;
	vAssertCalled(a4, mstatus, out a5_210);
l2302EB6C:
	if (a2 != null)
	{
		if (a1 != null)
			goto l2302EB72;
	}
	else if (a1 == null)
		goto l2302EB72;
	word32 a5_211;
	vAssertCalled(a4, mstatus, out a5_211);
l2302EB72:
	Eq_151200 a5_195 = 80;
	if (a4 != 80)
		vAssertCalled(a4, mstatus, out a5_195);
	struct Eq_151080 * a3_193;
	Eq_2 a4_194;
	a4_194 = a4;
	a3_193 = a3;
	if (a3 != null)
	{
		a3->b0046 = 0x01;
		if (a1 == null)
			s2_198 = a3;
		a3->ptr0000 = s2_198;
		a3->ptr003C = a0;
		a1->ptr0040 = a3;
		word32 a1_212;
		s1_100 = xQueueGenericReset(a3, 0x01, a3, a4, mstatus, out a1_212, out a3_193, out a4_194, out a5_195);
		a3->b004C = (byte) a4;
	}
	0x00 = (uint16) dwArg0128;
	s1Out = s1_100;
	a0Out = a3;
	a3Out = a3_193;
	a4Out = a4_194;
	a5Out = a5_195;
	s2Out = s2_198;
	s3Out = a0;
	s4Out = a4;
	return dwArgE4;
}

// 2302EBD0: Register (ptr32 Eq_151080) xQueueGenericCreate(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_151190) s1Out, Register out (ptr32 Eq_151080) a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_151080) a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      xQueueCreateCountingSemaphore
//      xQueueCreateMutex
//      sys_mbox_new
//      sys_sem_new
struct Eq_151080 * xQueueGenericCreate(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, struct Eq_151190 & s1Out, struct Eq_151080 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, struct Eq_151080 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	if (a0 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	ptr32 a1_149;
	struct Eq_151080 * a3_152;
	Eq_2 a4_154;
	ptr32 a5_156;
	struct Eq_151190 * s1_160;
	ptr32 s2_162;
	ptr32 s3_103;
	struct Eq_151080 * s0_51;
	if (a1 != 0x00)
	{
		struct Eq_151080 * a0_56;
		word32 a2_185;
		word32 a6_186;
		word32 s4_187;
		word32 s8_188;
		pvPortMalloc(ra, a0, (word32) a0 + a1 + 80, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_160, out a0_56, out a1_149, out a2_185, out a3_152, out a4_154, out a5_156, out a6_186, out s2_162, out s3_103, out s4_187, out s8_188);
		s0_51 = a0_56;
		if (a0_56 != null)
		{
			a0_56->b0046 = 0x00;
			a0_56->ptr0050 = a0_56;
			goto l2302EC16;
		}
	}
	else
	{
		struct Eq_151080 * a0_36;
		word32 a2_181;
		word32 a6_182;
		word32 s4_183;
		word32 s8_184;
		pvPortMalloc(ra, a0, 80, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_160, out a0_36, out a1_149, out a2_181, out a3_152, out a4_154, out a5_156, out a6_182, out s2_162, out s3_103, out s4_183, out s8_184);
		s0_51 = a0_36;
		if (a0_36 != null)
		{
			a0_36->b0046 = 0x00;
			a0_36->ptr0000 = a0_36;
l2302EC16:
			s1_160->ptr003C = s0_51;
			s0_51->ptr0040 = s2_162;
			struct Eq_151080 * a3_97;
			Eq_2 a4_98;
			ptr32 a5_99;
			ptr32 a1_102;
			struct Eq_151190 * s1_100 = xQueueGenericReset(s0_51, 0x01, a3_152, a4_154, mstatus, out a1_102, out a3_97, out a4_98, out a5_99);
			s0_51->b004C = (byte) s3_103;
			s1Out = s1_100;
			a0Out = s0_51;
			a1Out = a1_102;
			a2Out.u0 = <invalid>;
			a3Out = a3_97;
			a4Out = a4_98;
			a5Out = a5_99;
			s2Out = s2_162;
			s3Out = s3_103;
			s4Out.u0 = <invalid>;
			return s0_51;
		}
	}
	s1Out = s1_160;
	a0Out = null;
	a1Out = a1_149;
	a2Out.u0 = <invalid>;
	a3Out = a3_152;
	a4Out = a4_154;
	a5Out = a5_156;
	s2Out = s2_162;
	s3Out = s3_103;
	s4Out.u0 = <invalid>;
	return null;
}

// 2302EC50: Register (ptr32 Eq_151392) xQueueCreateCountingSemaphore(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_sem_new
struct Eq_151392 * xQueueCreateCountingSemaphore(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a0 != 0x00)
	{
		if (a0 >= a1)
			goto l2302EC5E;
	}
	else
	{
		vAssertCalled(a4, mstatus, out a5);
		if (a0 >= a1)
			goto l2302EC5E;
	}
	vAssertCalled(a4, mstatus, out a5);
l2302EC5E:
	word32 a3_102;
	word32 s1_99;
	word32 a1_100;
	ptr32 a0_39;
	ptr32 s2_48;
	ptr32 s3_49;
	word32 a2_101;
	word32 a5_104;
	word32 a4_103;
	word32 s4_105;
	struct Eq_151392 * s0_46 = xQueueGenericCreate(ra, a0, 0x00, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s1_99, out a0_39, out a1_100, out a2_101, out a3_102, out a4_103, out a5_104, out s2_48, out s3_49, out s4_105);
	if (a0_39 != 0x00)
		s0_46->ptr0038 = a0_39;
	a0Out = a0_39;
	s2Out = s2_48;
	s3Out = s3_49;
	return s0_46;
}

// 2302EC88: Register word32 xQueueGenericSend(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 (ptr32 Eq_151392)) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 word32) a4Out, Register out (ptr32 Eq_125556) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      cmd_mgr_print
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
//      cmd_mgr_drain
//      ef_port_env_unlock
//      xQueueCreateMutexStatic
//      xQueueGiveMutexRecursive
//      xQueueCreateMutex
//      xTimerGenericCommand
//      bl_sha_mutex_give
//      sys_mbox_post
//      sys_mbox_trypost
//      sys_sem_new
//      sys_mutex_unlock
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
//      aos_register_driver
//      aos_register_fs
//      aos_mutex_unlock
//      aos_sem_signal
word32 xQueueGenericSend(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_151392 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, word32 & a4Out, struct Eq_125556 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 s2_137 = a3;
	if (a0 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00 && a5 != 0x00)
	{
		word32 a5_676;
		vAssertCalled(a4, mstatus, out a5_676);
	}
	if (a3 == 0x02 && a4 != 0x01)
	{
		word32 a5_675;
		vAssertCalled(a4, mstatus, out a5_675);
	}
	word32 a5_52;
	if (xTaskGetSchedulerState(out a5_52) == 0x00 && a5_52 != 0x00)
	{
		word32 a5_645;
		vAssertCalled(a4, mstatus, out a5_645);
	}
	Eq_2 a1_124;
	struct Eq_125556 * a5_151;
	word32 * a4_159;
	Eq_2 a3_158;
	struct Eq_151392 ** a0_160;
	Eq_2 a5_228;
	Eq_2 a4_229 = vTaskEnterCritical(a4, mstatus, out a5_228);
	Eq_2 s0_233 = *((word32) a5_228 + 60);
	ptr32 s6_326 = 0x00;
	Eq_2 s3_179 = 0x02;
	Eq_2 s1_105 = ~0x00;
	a1_124 = a1;
	if (a4_229 >= a5_228)
	{
		while (s2_137 != s3_179)
		{
			if (a5_228 == 0x00)
			{
				a3_158 = vTaskExitCritical(a3, mstatus, out a4_159, out a5_151);
				a0_160 = null;
				goto l2302ED58;
			}
			if (s6_326 == 0x00)
				vTaskInternalSetTimeOutState(fp + -40);
			Eq_2 a4_93;
			word32 a5_646;
			Eq_2 a3_92 = vTaskExitCritical(a3, mstatus, out a4_93, out a5_646);
			word32 a5_647;
			word32 a5_648;
			vTaskEnterCritical(vTaskSuspendAll(a4_93, out a5_647), mstatus, out a5_648);
			if ((int32) (byte) (word32) *((word32) s0_233 + 0x0044) == s1_105)
				((word32) s0_233 + 0x0044)->u1 = 0x00;
			if ((int32) (byte) (word32) *((word32) s0_233 + 69) == s1_105)
				((word32) s0_233 + 69)->u1 = 0x00;
			word32 a5_118;
			Eq_2 a4_120;
			vTaskExitCritical(a3_92, mstatus, out a4_120, out a5_118);
			a1_124 = fp + -52;
			word32 a0_129;
			Eq_2 a2_130;
			Eq_2 a3_131;
			Eq_2 a4_132;
			Eq_2 s4_138;
			word32 s1_649;
			word32 a5_650;
			Eq_2 s0_135 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_120, a5_118, mstatus, out s1_649, out a0_129, out a2_130, out a3_131, out a4_132, out a5_650, out s2_137, out s4_138);
			if (a0_129 != 0x00)
			{
				Eq_2 a4_145;
				Eq_2 a5_146;
				word32 a0_652;
				word32 a2_653;
				word32 s0_651;
				word32 a6_654;
				word32 s4_655;
				word32 t3_656;
				xTaskResumeAll(prvUnlockQueue(s0_135, fp + -52, a2_130, a3_131, a4_132, mstatus, dwLoc08, out a4_145, out a5_146), a4_145, a5_146, mstatus, dwArg0118, dwArg0158, out s0_651, out s1_105, out a0_652, out a2_653, out a3_158, out a4_159, out a5_151, out a6_654, out s4_655, out t3_656);
				a0_160 = null;
				goto l2302ED58;
			}
			Eq_2 a4_200;
			Eq_2 a1_171;
			Eq_2 a5_161;
			Eq_2 a4_162 = vTaskEnterCritical(a4_132, mstatus, out a5_161);
			Eq_2 s0_164 = *((word32) a5_161 + 60);
			if (a4_162 != a5_161)
			{
				Eq_2 a4_204;
				Eq_2 a4_208;
				Eq_2 a5_209;
				word32 a5_664;
				word32 s0_665;
				word32 a2_667;
				word32 a0_666;
				word32 a6_669;
				word32 s4_670;
				word32 t3_671;
				word32 a5_668;
				xTaskResumeAll(prvUnlockQueue(s0_164, fp + -52, a2_130, vTaskExitCritical(a3_131, mstatus, out a4_204, out a5_664), a4_204, mstatus, dwLoc08, out a4_208, out a5_209), a4_208, a5_209, mstatus, dwArg0118, dwArg0158, out s0_665, out s1_105, out a0_666, out a2_667, out a3, out a4_200, out a5_668, out a6_669, out s4_670, out t3_671);
				goto l2302ED34;
			}
			Eq_2 a4_167;
			word32 a5_657;
			Eq_2 a3_166 = vTaskExitCritical(a3_131, mstatus, out a4_167, out a5_657);
			Eq_2 a2_172;
			Eq_2 a4_173;
			Eq_2 a4_186;
			Eq_2 a5_187;
			word32 a0_190;
			word32 a5_660;
			word32 a6_661;
			word32 s0_658;
			word32 a2_659;
			word32 s4_662;
			word32 t3_663;
			xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_138, fp + -52, dwArg24, a3_166, a4_167, mstatus, dwLoc1C, dwArg08, out a1_171, out a2_172, out a4_173, out s2_137, out s3_179), a1_171, a2_172, a3_166, a4_173, mstatus, dwLoc08, out a4_186, out a5_187), a4_186, a5_187, mstatus, dwArg0118, dwArg0158, out s0_658, out s1_105, out a0_190, out a2_659, out a3, out a4_200, out a5_660, out a6_661, out s4_662, out t3_663);
			a1_124 = a1_171;
			if (a0_190 == 0x00)
			{
				__syscall();
				a1_124 = a1_171;
			}
			else
			{
l2302ED34:
			}
			a4_229 = vTaskEnterCritical(a4_200, mstatus, out a5_228);
			s6_326 = 0x01;
			s0_233 = *((word32) a5_228 + 60);
			if (a4_229 < a5_228)
				break;
		}
	}
	word32 a0_272;
	Eq_2 a2_274;
	Eq_2 a4_276;
	struct Eq_151498 * a5_277;
	Eq_2 a3_275;
	t1 = prvCopyDataToQueue(s1_105, a1, s2_137, a3, a4_229, a5_228, mstatus, dwLoc08, out s1_105, out a0_272, out a1_124, out a2_274, out a3_275, out a4_276, out a5_277, out a7, out s2_137);
	Eq_2 s0_289 = a5_277->t0024;
	if (a5_277 == null)
	{
		if (a0_272 == 0x00)
			goto l2302ED52;
	}
	else
	{
		word32 a0_291;
		word32 a2_672;
		word32 a4_673;
		word32 a5_674;
		s1_105 = xTaskRemoveFromEventList(s0_289, a1_124, a2_274, a3_275, a4_276, mstatus, out a0_291, out a1_124, out a2_672, out a3_275, out a4_673, out a5_674);
		if (a0_291 == 0x00)
			goto l2302ED52;
	}
	__syscall();
l2302ED52:
	a3_158 = vTaskExitCritical(a3_275, mstatus, out a4_159, out a5_151);
	a0_160 = (struct Eq_151392 **) 0x01;
l2302ED58:
	0x00 = (uint16) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_105;
	a0Out = a0_160;
	a1Out = a1_124;
	a2Out = dwArg0138;
	a3Out = a3_158;
	a4Out = a4_159;
	a5Out = a5_151;
	a7Out = a7;
	s2Out = s2_137;
	s3Out = s3_179;
	s4Out = dwArgF4;
	s5Out = a1;
	s6Out = s6_326;
	s8Out = dwArgD4;
	return t1;
}

// 2302EDE0: Register word32 xQueueCreateMutexStatic(Register Eq_2 a0, Register (ptr32 Eq_151080) a1, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bl_sec_init
//      vfs_init
word32 xQueueCreateMutexStatic(Eq_2 a0, struct Eq_151080 * a1, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out)
{
	Eq_2 a0_16;
	Eq_2 a5_18;
	word32 s2_112;
	word32 s3_113;
	word32 s4_114;
	ptr32 a3_28;
	Eq_2 a4_29;
	word32 s1_20;
	xQueueGenericCreateStatic(0x01, null, null, a1, a0, mstatus, dwArg0118, out s1_20, out a0_16, out a3_28, out a4_29, out a5_18, out s2_112, out s3_113, out s4_114);
	Eq_2 s0_30 = a0_16;
	if (a0_16 != 0x00)
	{
		*((word32) a0_16 + 8) = 0x00;
		*a0_16 = 0x00;
		*((word32) a0_16 + 0x0C) = 0x00;
		word32 a0_115;
		word32 a1_116;
		word32 a2_117;
		word32 a5_118;
		word32 a7_119;
		word32 s2_120;
		word32 s3_121;
		word32 s4_122;
		word32 s5_123;
		word32 s6_124;
		word32 s8_125;
		xQueueGenericSend(a0_16, 0x00, 0x00, a4_29, a5_18, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_30, out s1_20, out a0_115, out a1_116, out a2_117, out a3_28, out a4_29, out a5_118, out a7_119, out s2_120, out s3_121, out s4_122, out s5_123, out s6_124, out s8_125);
	}
	a0Out = s0_30;
	a2Out = dwArg10;
	a3Out = a3_28;
	a4Out = a4_29;
	return s1_20;
}

