pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302EE18: Register word32 xQueueGiveMutexRecursive(Register (ptr32 Eq_151879) a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s5Out)
// Called from:
//      aws_iot_mqtt_client_unlock_mutex
word32 xQueueGiveMutexRecursive(struct Eq_151879 * a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s5Out)
{
	if (a0 == null)
	{
		word32 a5_143;
		vAssertCalled(a4, mstatus, out a5_143);
	}
	ptr32 s1_23 = 0x00;
	struct Eq_151900 * a5_22;
	if (a0->t0008 == xTaskGetCurrentTaskHandle(out a5_22))
	{
		Eq_2 s0_24 = a5_22->t000C;
		a5_22->t000B = s0_24;
		s1_23 = 0x01;
		if (a5_22 == (struct Eq_151900 *) ~0x00)
		{
			word32 a7_150;
			word32 s2_151;
			word32 s3_152;
			word32 s4_153;
			word32 a5_149;
			word32 a4_148;
			word32 a2_147;
			word32 a1_146;
			word32 a0_145;
			word32 s0_144;
			word32 s6_154;
			word32 s8_155;
			t1 = xQueueGenericSend(s0_24, 0x00, 0x00, a4, (char *) a5_22 - 1, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_144, out s1_23, out a0_145, out a1_146, out a2_147, out a3, out a4_148, out a5_149, out a7_150, out s2_151, out s3_152, out s4_153, out s5, out s6_154, out s8_155);
		}
	}
	0x00 = (uint16) dwArg38;
	s1Out = s1_23;
	a0Out = s1_23;
	a3Out = a3;
	s5Out = s5;
	return t1;
}

// 2302EE60: Register word32 xQueueCreateMutex(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      bl_cmd_mgr_init
//      ef_port_init
//      mem_init
//      aos_mutex_new
//      aws_iot_thread_mutex_init
word32 xQueueCreateMutex(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a0_16;
	word32 a2_117;
	ptr32 a3_19;
	ptr32 a1_17;
	Eq_2 a4_20;
	Eq_2 a5_21;
	word32 s1_24;
	ptr32 s2_25;
	ptr32 s3_26;
	ptr32 s4_27;
	xQueueGenericCreate(ra, 0x01, 0x00, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_24, out a0_16, out a1_17, out a2_117, out a3_19, out a4_20, out a5_21, out s2_25, out s3_26, out s4_27);
	Eq_2 s0_31 = a0_16;
	if (a0_16 != 0x00)
	{
		*((word32) a0_16 + 8) = 0x00;
		*a0_16 = 0x00;
		*((word32) a0_16 + 0x0C) = 0x00;
		word32 a0_118;
		word32 a2_119;
		word32 a7_120;
		word32 s8_121;
		xQueueGenericSend(a0_16, 0x00, 0x00, a4_20, a5_21, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_31, out s1_24, out a0_118, out a1_17, out a2_119, out a3_19, out a4_20, out a5_21, out a7_120, out s2_25, out s3_26, out s4_27, out s5, out s6, out s8_121);
	}
	a0Out = s0_31;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_25;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5;
	s6Out = s6;
	return s1_24;
}

// 2302EE94: Register Eq_2 xQueueGenericSendFromISR(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      xTimerGenericCommand
Eq_2 xQueueGenericSendFromISR(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	if (a0 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00 && a5 != 0x00)
		vAssertCalled(a4, mstatus, out a5);
	Eq_2 s0_55;
	Eq_2 a4_39 = 0x02;
	if (a3 != 0x02)
	{
		s0_55 = *(union Eq_2 *) 0x3A;
		if (a5 <= 0x02)
		{
			0x00 = (uint16) dwArg0128;
			s1Out = s1;
			a0Out = 0x00;
			a3Out = a3;
			a4Out.u0 = 0x02;
			a5Out = a5;
			s2Out = a3;
			s3Out.u0 = <invalid>;
			return <invalid>;
		}
	}
	else
	{
		a4_39.u0 = 0x01;
		if (a5 != 0x01)
			vAssertCalled(0x01, mstatus, out a5);
		s0_55 = *((word32) a5 + 56);
	}
	Eq_2 a1_78;
	Eq_2 a2_79;
	Eq_2 s2_85;
	word32 a7_273;
	word32 a4_271;
	word32 a5_272;
	word32 a0_270;
	Eq_2 s1_105;
	Eq_2 a3_102;
	prvCopyDataToQueue((word32) *((word32) s0_55 + 69), a1, a3, a3, a4_39, a5, mstatus, dwArg08, out s1_105, out a0_270, out a1_78, out a2_79, out a3_102, out a4_271, out a5_272, out a7_273, out s2_85);
	Eq_2 a4_103 = (int32) (byte) s1_105;
	Eq_2 a5_104 = ~0x00;
	if (a4_103 != ~0x00)
	{
		int32 s1_125 = (word32) s1_105 + 1 << 24;
		((word32) s0_55 + 69)->u1 = (byte) (s1_125 >> 24);
		0x00 = (uint16) dwArg0128;
		s1Out = s1_125 >> 24;
		a0Out = 0x01;
		a3Out = a3_102;
		a4Out = a4_103;
		a5Out.u0 = ~0x00;
		s2Out = s2_85;
		s3Out.u0 = <invalid>;
		return <invalid>;
	}
	Eq_2 s0_97 = *(union Eq_2 *) 0x23;
	if (true)
	{
		word32 a0_99;
		word32 a2_275;
		word32 a1_274;
		s1_105 = xTaskRemoveFromEventList(s0_97, a1_78, a2_79, a3_102, a4_103, mstatus, out a0_99, out a1_274, out a2_275, out a3_102, out a4_103, out a5_104);
		if (a0_99 != 0x00 && a2 != null)
		{
			*a2 = (union Eq_2 *) 0x01;
			a5_104.u0 = 0x01;
l2302EF1E:
			0x00 = (uint16) dwArg0128;
			s1Out = s1_105;
			a0Out = 0x01;
			a3Out = a3_102;
			a4Out = a4_103;
			a5Out = a5_104;
			s2Out = s2_85;
			s3Out.u0 = <invalid>;
			return <invalid>;
		}
	}
	goto l2302EF1E;
}

