pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302EF4E: Register Eq_2 xQueueGiveFromISR(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      aos_sem_signal
Eq_2 xQueueGiveFromISR(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
		a2 = vAssertCalled(a4, mstatus, out a5);
	if (a5 == 0x00)
	{
		if (a5 != 0x00)
			goto l2302EF64;
	}
	else
	{
		a2 = vAssertCalled(a4, mstatus, out a5);
		if (a5 != 0x00)
			goto l2302EF64;
	}
	if (a5 != 0x00)
		a2 = vAssertCalled(a4, mstatus, out a5);
l2302EF64:
	Eq_2 s0_39 = *((word32) a4 + 60);
	if (a5 < a4)
	{
		Eq_2 a4_41 = (word32) *((word32) s0_39 + 69);
		*((word32) a5 + 57) = s0_39;
		a3 = (int32) (byte) a4_41;
		a5.u0 = ~0x00;
		if (a3 != ~0x00)
		{
			((word32) s0_39 + 69)->u1 = (byte) (int32) (byte) ((word32) a4_41 + 1);
			goto l2302EF8C;
		}
		Eq_2 s0_47 = *(union Eq_2 *) 0x23;
		if (false)
			goto l2302EF8C;
		word32 a4_125;
		word32 a0_57;
		word32 a2_124;
		word32 a1_123;
		Eq_2 s1_63 = xTaskRemoveFromEventList(s0_47, a1, a2, a3, a4_41, mstatus, out a0_57, out a1_123, out a2_124, out a3, out a4_125, out a5);
		if (a0_57 == 0x00 || s1_63 == 0x00)
		{
l2302EF8C:
			goto l2302EF8E;
		}
		*(union Eq_2 *) 0x01 = s1_63;
		a5.u0 = 0x01;
	}
l2302EF8E:
	a5Out = a5;
	return a3;
}

// 2302EFC8: Register Eq_2 xQueueReceive(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      prvTimerTask
//      sys_arch_mbox_fetch
//      sys_arch_mbox_tryfetch
Eq_2 xQueueReceive(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s0_132 = a0;
	Eq_2 s3_153 = a1;
	if (a0 == 0x00)
		a2 = vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00)
	{
		s0_132 = *((word32) a5 + 64);
		if (a5 != 0x00)
		{
			word32 a5_574;
			a2 = vAssertCalled(a4, mstatus, out a5_574);
		}
	}
	word32 a5_36;
	if (xTaskGetSchedulerState(out a5_36) == 0x00)
	{
		a2 = dwArgA4;
		if (a5_36 != 0x00)
		{
			word32 a5_573;
			a2 = vAssertCalled(a4, mstatus, out a5_573);
		}
	}
	word32 a5_47;
	Eq_2 a4_178 = vTaskEnterCritical(a4, mstatus, out a5_47);
	Eq_2 s2_107 = *((word32) s0_132 + 56);
	if (s2_107 != 0x00)
	{
l2302F0A0:
		Eq_2 s2_217 = (word32) s2_107 - 1;
		struct Eq_152281 * a5_225;
		Eq_2 a2_227;
		Eq_2 a4_229;
		Eq_2 a3_228;
		Eq_2 a1_226 = prvCopyDataFromQueue(s3_153, a2, a4_178, out a2_227, out a3_228, out a4_229, out a5_225);
		*((word32) s0_132 + 56) = s2_217;
		Eq_2 s0_239 = a5_225->t0010;
		if (a5_225 != null)
		{
			word32 a5_550;
			word32 a4_549;
			word32 a2_548;
			word32 a0_242;
			s1 = xTaskRemoveFromEventList(s0_239, a1_226, a2_227, a3_228, a4_229, mstatus, out a0_242, out a1_226, out a2_548, out a3_228, out a4_549, out a5_550);
			if (a0_242 != 0x00)
				__syscall();
		}
		ptr32 a5_252;
		ptr32 a4_254;
		Eq_2 a3_253 = vTaskExitCritical(a3_228, mstatus, out a4_254, out a5_252);
		s1Out = s1;
		a0Out = 0x01;
		a1Out = a1_226;
		a2Out.u0 = <invalid>;
		a3Out = a3_253;
		a4Out = a4_254;
		a5Out = a5_252;
		s2Out = s2_217;
		s3Out = s3_153;
		s4Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		if (a5_47 != 0x00)
		{
			vTaskInternalSetTimeOutState(fp + -40);
			s1.u0 = ~0x00;
			do
			{
				Eq_2 a4_65;
				word32 a5_569;
				Eq_2 a3_64 = vTaskExitCritical(a3, mstatus, out a4_65, out a5_569);
				word32 a5_571;
				word32 a5_570;
				vTaskEnterCritical(vTaskSuspendAll(a4_65, out a5_570), mstatus, out a5_571);
				if ((int32) (byte) (word32) *((word32) s0_132 + 0x0044) == s1)
					((word32) s0_132 + 0x0044)->u1 = 0x00;
				if ((int32) (byte) (word32) *((word32) s0_132 + 69) == s1)
					((word32) s0_132 + 69)->u1 = 0x00;
				word32 a5_177;
				Eq_2 a4_135;
				Eq_2 a1_145;
				word32 a5_88;
				Eq_2 a4_90;
				vTaskExitCritical(a3_64, mstatus, out a4_90, out a5_88);
				a1 = fp + -52;
				word32 a0_99;
				Eq_2 a2_100;
				Eq_2 a3_101;
				Eq_2 a4_102;
				Eq_2 s4_108;
				word32 a5_547;
				word32 s1_546;
				Eq_2 s0_105 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_90, a5_88, mstatus, out s1_546, out a0_99, out a2_100, out a3_101, out a4_102, out a5_547, out s2_107, out s4_108);
				if (a0_99 == 0x00)
				{
					struct Eq_152427 * a5_136;
					vTaskEnterCritical(a4_102, mstatus, out a5_136);
					Eq_2 s0_138 = a5_136->t0038;
					if (a5_136 != null)
					{
						word32 a5_563;
						word32 a5_565;
						Eq_2 a4_184;
						Eq_2 a4_188;
						Eq_2 a5_189;
						Eq_2 a4_202;
						word32 a0_564;
						word32 s4_567;
						word32 t3_568;
						word32 a6_566;
						xTaskResumeAll(prvUnlockQueue(s0_138, fp + -52, a2_100, vTaskExitCritical(a3_101, mstatus, out a4_184, out a5_563), a4_184, mstatus, dwLoc08, out a4_188, out a5_189), a4_188, a5_189, mstatus, dwArg0118, dwArg0158, out s0_132, out s1, out a0_564, out a2, out a3, out a4_202, out a5_565, out a6_566, out s4_567, out t3_568);
						a4_178 = vTaskEnterCritical(a4_202, mstatus, out a5_177);
						s2_107 = *((word32) s0_132 + 56);
						if (s2_107 != 0x00)
							goto l2302F0A0;
						goto l2302F064;
					}
					word32 a5_557;
					Eq_2 a4_141;
					Eq_2 a3_140 = vTaskExitCritical(a3_101, mstatus, out a4_141, out a5_557);
					word32 a5_559;
					word32 s2_558;
					Eq_2 a2_146;
					Eq_2 a4_147;
					Eq_2 a4_160;
					Eq_2 a5_161;
					word32 a0_164;
					word32 t3_562;
					word32 a6_560;
					word32 s4_561;
					xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_108, fp + -52, dwArg24, a3_140, a4_141, mstatus, dwLoc1C, dwArg08, out a1_145, out a2_146, out a4_147, out s2_558, out s3_153), a1_145, a2_146, a3_140, a4_147, mstatus, dwLoc08, out a4_160, out a5_161), a4_160, a5_161, mstatus, dwArg0118, dwArg0158, out s0_132, out s1, out a0_164, out a2, out a3, out a4_135, out a5_559, out a6_560, out s4_561, out t3_562);
					a1 = a1_145;
					if (a0_164 == 0x00)
					{
						__syscall();
						a1 = a1_145;
					}
				}
				else
				{
					word32 t3_556;
					word32 s0_551;
					word32 a0_552;
					word32 s4_555;
					word32 a6_554;
					word32 a5_553;
					Eq_2 a4_115;
					Eq_2 a5_116;
					Eq_2 a4_129;
					xTaskResumeAll(prvUnlockQueue(s0_105, fp + -52, a2_100, a3_101, a4_102, mstatus, dwLoc08, out a4_115, out a5_116), a4_115, a5_116, mstatus, dwArg0118, dwArg0158, out s0_551, out s1, out a0_552, out a2, out a3, out a4_129, out a5_553, out a6_554, out s4_555, out t3_556);
					struct Eq_152418 * a5_130;
					vTaskEnterCritical(a4_129, mstatus, out a5_130);
					s0_132 = a5_130->t0038;
					if (a5_130 == null)
						break;
					word32 a5_572;
					a3 = vTaskExitCritical(a3, mstatus, out a4_135, out a5_572);
				}
				a4_178 = vTaskEnterCritical(a4_135, mstatus, out a5_177);
				s2_107 = *((word32) s0_132 + 56);
				if (s2_107 != 0x00)
					goto l2302F0A0;
l2302F064:
			} while (a5_177 != 0x00);
		}
		ptr32 a5_280;
		ptr32 a4_282;
		Eq_2 a3_281 = vTaskExitCritical(a3, mstatus, out a4_282, out a5_280);
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a1;
		a2Out.u0 = <invalid>;
		a3Out = a3_281;
		a4Out = a4_282;
		a5Out = a5_280;
		s2Out = s2_107;
		s3Out = s3_153;
		s4Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 2302F114: Register Eq_2 xQueueSemaphoreTake(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      cmd_mgr_print
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
//      cmd_mgr_drain
//      ef_port_env_lock
//      xQueueTakeMutexRecursive
//      bl_sha_mutex_take
//      sys_sem_new
//      sys_arch_sem_wait
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
//      aos_register_driver
//      aos_register_fs
//      aos_mutex_lock
//      aos_sem_wait
Eq_2 xQueueSemaphoreTake(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
		a2 = vAssertCalled(a4, mstatus, out a5);
	if (a5 != 0x00)
	{
		word32 a5_583;
		a2 = vAssertCalled(a4, mstatus, out a5_583);
	}
	word32 a5_33;
	Eq_2 a0_132 = xTaskGetSchedulerState(out a5_33);
	if (a0_132 == 0x00)
	{
		a2 = dwArgA4;
		if (a5_33 != 0x00)
		{
			word32 a5_613;
			a2 = vAssertCalled(a4, mstatus, out a5_613);
		}
	}
	Eq_2 a4_148;
	Eq_2 a3_147;
	ptr32 a5_146;
	struct Eq_152592 * a5_280;
	Eq_2 a4_281 = vTaskEnterCritical(a4, mstatus, out a5_280);
	Eq_2 s0_284 = a5_280->t0038;
	ptr32 s3_162 = 0x00;
	ptr32 s2_120 = 0x00;
	Eq_2 s1_137 = ~0x00;
	while (a5_280 == null)
	{
		if (a5_280 == null)
		{
			if (s3_162 != 0x00)
			{
				word32 a5_589;
				vAssertCalled(a4_281, mstatus, out a5_589);
			}
			a3_147 = vTaskExitCritical(a3, mstatus, out a4_148, out a5_146);
			s3_162 = 0x00;
			goto l2302F214;
		}
		if (s2_120 == 0x00)
			vTaskInternalSetTimeOutState(fp + -40);
		Eq_2 a4_76;
		word32 a5_584;
		Eq_2 a3_75 = vTaskExitCritical(a3, mstatus, out a4_76, out a5_584);
		word32 a5_586;
		word32 a5_585;
		vTaskEnterCritical(vTaskSuspendAll(a4_76, out a5_585), mstatus, out a5_586);
		if ((int32) (byte) (word32) *((word32) s0_284 + 0x0044) == s1_137)
			((word32) s0_284 + 0x0044)->u1 = 0x00;
		if ((int32) (byte) (word32) *((word32) s0_284 + 69) == s1_137)
			((word32) s0_284 + 69)->u1 = 0x00;
		Eq_2 a4_184;
		Eq_2 a1_223;
		word32 a5_101;
		Eq_2 a4_103;
		vTaskExitCritical(a3_75, mstatus, out a4_103, out a5_101);
		a1 = fp + -52;
		word32 a0_112;
		Eq_2 a2_113;
		Eq_2 a3_114;
		Eq_2 a4_115;
		word32 s1_587;
		word32 a5_588;
		Eq_2 s4_121;
		Eq_2 s0_118 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_103, a5_101, mstatus, out s1_587, out a0_112, out a2_113, out a3_114, out a4_115, out a5_588, out s2_120, out s4_121);
		if (a0_112 == 0x00)
		{
			struct Eq_152746 * a5_186;
			vTaskEnterCritical(a4_115, mstatus, out a5_186);
			Eq_2 s0_188 = a5_186->t0038;
			if (a5_186 != null)
			{
				Eq_2 a4_256;
				Eq_2 a4_260;
				Eq_2 a5_261;
				word32 t3_600;
				word32 s4_599;
				word32 s0_596;
				word32 a5_597;
				word32 a6_598;
				word32 a5_595;
				xTaskResumeAll(prvUnlockQueue(s0_188, fp + -52, a2_113, vTaskExitCritical(a3_114, mstatus, out a4_256, out a5_595), a4_256, mstatus, dwLoc08, out a4_260, out a5_261), a4_260, a5_261, mstatus, dwArg0118, dwArg0158, out s0_596, out s1_137, out a0_132, out a2, out a3, out a4_184, out a5_597, out a6_598, out s4_599, out t3_600);
				goto l2302F1A4;
			}
			word32 a5_189;
			Eq_2 a4_191;
			Eq_2 a3_190 = vTaskExitCritical(a3_114, mstatus, out a4_191, out a5_189);
			if (a5_189 == 0x00)
			{
				word32 a5_605;
				a1 = xTaskPriorityInherit(a0_112, a2_113, a3_190, vTaskEnterCritical(a4_191, mstatus, out a5_605), out s4_121);
				word32 a5_606;
				a3_190 = vTaskExitCritical(a3_190, mstatus, out a4_191, out a5_606);
			}
			Eq_2 a2_224;
			Eq_2 a4_225;
			Eq_2 a4_238;
			Eq_2 a5_239;
			word32 a5_609;
			word32 s4_611;
			word32 t3_612;
			word32 a6_610;
			word32 s0_608;
			word32 s2_607;
			xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_121, a1, dwArg24, a3_190, a4_191, mstatus, dwLoc1C, dwArg08, out a1_223, out a2_224, out a4_225, out s2_607, out s3_162), a1_223, a2_224, a3_190, a4_225, mstatus, dwLoc08, out a4_238, out a5_239), a4_238, a5_239, mstatus, dwArg0118, dwArg0158, out s0_608, out s1_137, out a0_132, out a2, out a3, out a4_184, out a5_609, out a6_610, out s4_611, out t3_612);
			a1 = a1_223;
			if (a0_132 == 0x00)
			{
				__syscall();
				a1 = a1_223;
			}
			else
			{
l2302F1A4:
			}
		}
		else
		{
			Eq_2 a4_128;
			Eq_2 a5_129;
			Eq_2 a3_141;
			Eq_2 a4_142;
			word32 a6_592;
			word32 s4_593;
			word32 t3_594;
			word32 s0_590;
			word32 a5_591;
			xTaskResumeAll(prvUnlockQueue(s0_118, fp + -52, a2_113, a3_114, a4_115, mstatus, dwLoc08, out a4_128, out a5_129), a4_128, a5_129, mstatus, dwArg0118, dwArg0158, out s0_590, out s1_137, out a0_132, out a2, out a3_141, out a4_142, out a5_591, out a6_592, out s4_593, out t3_594);
			word32 a5_143;
			vTaskEnterCritical(a4_142, mstatus, out a5_143);
			if (a5_143 == 0x00)
			{
				a3_147 = vTaskExitCritical(a3_141, mstatus, out a4_148, out a5_146);
				if (s3_162 != 0x00)
				{
					Eq_2 a5_152;
					Eq_2 a4_153 = vTaskEnterCritical(a4_148, mstatus, out a5_152);
					if (fp != ~0x33)
					{
						a5_152 = *a5_152;
						a1 = 32 - a5_152;
					}
					Eq_2 a3_177;
					s1_137 = vTaskPriorityDisinheritAfterTimeout(a0_132, a1, a2, a3_147, a4_153, a5_152, mstatus, dwLoc08, out a1, out a3_177, out s2_120);
					s3_162 = 0x00;
					a3_147 = vTaskExitCritical(a3_177, mstatus, out a4_148, out a5_146);
				}
				goto l2302F214;
			}
			word32 a5_604;
			a3 = vTaskExitCritical(a3_141, mstatus, out a4_184, out a5_604);
		}
		a4_281 = vTaskEnterCritical(a4_184, mstatus, out a5_280);
		s2_120 = 0x01;
		s0_284 = a5_280->t0038;
	}
	word32 s0_287 = *a4_281;
	struct Eq_152613 * a5_289 = (char *) a5_280 - 1;
	a5_289->dw0038 = s0_287;
	if (a4_281 == 0x00)
	{
		a3 = pvTaskIncrementMutexHeldCount(a0_132, a4_281, out a4_281, out a5_289);
		*((word32) a0_132 + 8) = s0_287;
	}
	Eq_2 s0_301 = a5_289->t0010;
	if (a5_289 != null)
	{
		word32 a0_329;
		word32 a2_601;
		word32 a4_602;
		word32 a5_603;
		s1_137 = xTaskRemoveFromEventList(s0_301, a1, a2, a3, a4_281, mstatus, out a0_329, out a1, out a2_601, out a3, out a4_602, out a5_603);
		if (a0_329 != 0x00)
			__syscall();
	}
	a3_147 = vTaskExitCritical(a3, mstatus, out a4_148, out a5_146);
	s3_162 = 0x01;
l2302F214:
	s1Out = s1_137;
	a0Out = s3_162;
	a1Out = a1;
	a2Out = dwArg0138;
	a3Out = a3_147;
	a4Out = a4_148;
	a5Out = a5_146;
	s2Out = s2_120;
	s3Out = s3_162;
	s4Out = dwArgF4;
	return dwArg0158;
}

// 2302F29C: Register word32 xQueueTakeMutexRecursive(Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aws_iot_mqtt_client_lock_mutex
word32 xQueueTakeMutexRecursive(Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		word32 a5_135;
		a2 = vAssertCalled(a4, mstatus, out a5_135);
	}
	Eq_2 s0_22 = *((word32) s1 + 8);
	Eq_2 a5_24;
	if (s1 == xTaskGetCurrentTaskHandle(out a5_24))
	{
		*((word32) a5_24 + 0x0D) = *((word32) a5_24 + 0x0C);
		0x00 = (uint16) dwArg38;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = a1;
		s3Out = s3;
		s4Out = s4;
		return 0x01;
	}
	else
	{
		word32 a0_43;
		Eq_2 a1_44;
		Eq_2 a3_46;
		Eq_2 a4_47;
		struct Eq_152996 * a5_48;
		Eq_2 s2_52;
		ptr32 s3_53;
		ptr32 s4_54;
		word32 a2_137;
		word32 s1_136;
		xQueueSemaphoreTake(s0_22, a1, a2, a3, a4, a5_24, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_136, out a0_43, out a1_44, out a2_137, out a3_46, out a4_47, out a5_48, out s2_52, out s3_53, out s4_54);
		if (a0_43 != 0x00)
			a5_48->dw000D = a5_48->dw000C;
		0x00 = (uint16) dwArg38;
		a1Out = a1_44;
		a3Out = a3_46;
		a4Out = a4_47;
		s2Out = s2_52;
		s3Out = s3_53;
		s4Out = s4_54;
		return a0_43;
	}
}

// 2302F2EC: Register (ptr32 Eq_153024) uxQueueMessagesWaiting(Register (ptr32 Eq_153024) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      sys_mbox_free
struct Eq_153024 * uxQueueMessagesWaiting(struct Eq_153024 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a3Out, ptr32 & a4Out)
{
	if (a0 == null)
	{
		word32 a5_38;
		vAssertCalled(a4, mstatus, out a5_38);
	}
	word32 a5_39;
	vTaskEnterCritical(a4, mstatus, out a5_39);
	struct Eq_153024 * s0_20 = a0->ptr0038;
	ptr32 a4_25;
	word32 a5_40;
	a3Out = vTaskExitCritical(a3, mstatus, out a4_25, out a5_40);
	a4Out = a4_25;
	return s0_20;
}

