pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302F310: Register word32 vQueueDelete(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 word32) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      sys_mbox_free
//      sys_sem_free
//      aos_mutex_free
//      aos_sem_free
//      aws_iot_thread_mutex_destroy
word32 vQueueDelete(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, word32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		word32 a5_168;
		vAssertCalled(a4, mstatus, out a5_168);
		word32 * a4_121 = null;
		do
		{
			if (a0 == a3)
			{
				struct Eq_153167 * a4_24 = a4_121 << 3;
				a4_24->dw4201FC1C = 0x00;
				a4_24->dw4201FC20 = 0x00;
				a4_121 = &a4_24->dw4201FC1C;
				break;
			}
			a4_121 = (word32 *) ((char *) a4_121 + 1);
		} while (a4_121 != (word32 *) 0x08);
		Eq_2 a5_33 = (word32) *((word32) a0 + 70);
		if (a5_33 == 0x00)
		{
			ptr32 a2_41;
			Eq_2 a3_42;
			word32 * a4_43;
			Eq_2 a5_44;
			ptr32 s1_45;
			Eq_2 a0_47;
			ptr32 a1_48;
			word32 s0_50;
			ptr32 s4_51;
			word32 t3_170;
			word32 a6_169;
			vPortFree(a0, 0x08, a5_33, mstatus, dwArg0158, dwArg0198, out s0_50, out s1_45, out a0_47, out a1_48, out a2_41, out a3_42, out a4_43, out a5_44, out a6_169, out s4_51, out t3_170);
			s1Out = s1_45;
			a0Out = a0_47;
			a1Out = a1_48;
			a2Out = a2_41;
			a3Out = a3_42;
			a4Out = a4_43;
			a5Out = a5_44;
			s4Out = s4_51;
			return s0_50;
		}
		else
		{
			s1Out = s1;
			a0Out = a0;
			a1Out = 0x4201FC1C;
			a2Out = 0x08;
			a3Out = a3;
			a4Out = a4_121;
			a5Out = a5_33;
			s4Out = s4;
			return s0;
		}
	}
	else
	{
		word32 * a4_120 = null;
		do
		{
			if (a0 == a3)
			{
				struct Eq_153110 * a4_66 = a4_120 << 3;
				a4_66->dw4201FC1C = 0x00;
				a4_66->dw4201FC20 = 0x00;
				a4_120 = &a4_66->dw4201FC1C;
				break;
			}
			a4_120 = (word32 *) ((char *) a4_120 + 1);
		} while (a4_120 != (word32 *) 0x08);
		Eq_2 a5_75 = (word32) *((word32) a0 + 70);
		if (a5_75 == 0x00)
		{
			ptr32 a2_81;
			Eq_2 a3_82;
			word32 * a4_83;
			Eq_2 a5_84;
			ptr32 s1_85;
			Eq_2 a0_87;
			ptr32 a1_88;
			word32 s0_90;
			ptr32 s4_91;
			word32 a6_166;
			word32 t3_167;
			vPortFree(a0, 0x08, a5_75, mstatus, dwArg0158, dwArg0198, out s0_90, out s1_85, out a0_87, out a1_88, out a2_81, out a3_82, out a4_83, out a5_84, out a6_166, out s4_91, out t3_167);
			s1Out = s1_85;
			a0Out = a0_87;
			a1Out = a1_88;
			a2Out = a2_81;
			a3Out = a3_82;
			a4Out = a4_83;
			a5Out = a5_84;
			s4Out = s4_91;
			return s0_90;
		}
		else
		{
			s1Out = s1;
			a0Out = a0;
			a1Out = 0x4201FC1C;
			a2Out = 0x08;
			a3Out = a3;
			a4Out = a4_120;
			a5Out = a5_75;
			s4Out = s4;
			return s0;
		}
	}
}

// 2302F396: Register word32 vQueueAddToRegistry(Register (ptr32 Eq_153180) a0, Register (ptr32 ui32) a1, Register Eq_2 a3)
// Called from:
//      prvCheckForValidListAndQueue
word32 vQueueAddToRegistry(struct Eq_153180 * a0, ui32 * a1, Eq_2 a3)
{
	ui32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		if (a3 == 0x00)
		{
			ui32 a4_13 = a4_12 << 3;
			*a1 = a4_13 + 0x4201FC1C;
			a0->dw0004 = a4_13 + 0x4201FC1C;
			return;
		}
	}
	return;
}

// 2302F3BE: Register Eq_2 vQueueWaitForMessageRestricted(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      prvTimerTask
Eq_2 vQueueWaitForMessageRestricted(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	word32 a5_139;
	vTaskEnterCritical(a4, mstatus, out a5_139);
	if ((int32) (byte) (word32) *((word32) a0 + 0x0044) == ~0x00)
		((word32) a0 + 0x0044)->u1 = 0x00;
	if ((int32) (byte) (word32) *((word32) a0 + 69) == ~0x00)
		((word32) a0 + 69)->u1 = 0x00;
	struct Eq_153239 * a5_39;
	Eq_2 a4_41;
	Eq_2 a3_40 = vTaskExitCritical(a3, mstatus, out a4_41, out a5_39);
	Eq_2 s0_43 = a5_39->t0038;
	if (a5_39 == null)
	{
		Eq_2 a1_54;
		Eq_2 a4_56;
		ptr32 s3_62;
		Eq_2 s0_59 = vTaskPlaceOnEventListRestricted((word32) s0_43 + 36, a1, a2, a3_40, a4_41, mstatus, dwArg14, dwArg38, out a1_54, out a4_56, out s3_62);
		0x00 = (uint16) dwArg38;
		ptr32 a4_73;
		ptr32 a5_74;
		Eq_2 a3_72 = prvUnlockQueue(s0_59, a1_54, dwArg10, a3_40, a4_56, mstatus, dwArg38, out a4_73, out a5_74);
		a4Out = a4_73;
		a5Out = a5_74;
		s3Out = s3_62;
		return a3_72;
	}
	else
	{
		0x00 = (uint16) dwArg38;
		ptr32 a4_86;
		ptr32 a5_87;
		Eq_2 a3_85 = prvUnlockQueue(s0_43, a1, dwArg10, a3_40, a4_41, mstatus, dwArg38, out a4_86, out a5_87);
		a4Out = a4_86;
		a5Out = a5_87;
		s3Out = s3;
		return a3_85;
	}
}

// 2302F42A: Register Eq_2 prvInitialiseNewStreamBuffer(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      xStreamBufferGenericCreate
//      xStreamBufferGenericCreateStatic
Eq_2 prvInitialiseNewStreamBuffer(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 a4, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 a0_28;
	Eq_2 a4_32;
	word32 t1_93;
	word32 a1_94;
	word32 a2_95;
	word32 a3_96;
	word32 a5_97;
	Eq_2 ra_34 = memset(ra, a1, 0x0055, a2, out t1_93, out a0_28, out a1_94, out a2_95, out a3_96, out a4_32, out a5_97);
	if (a1 != a0_28)
	{
		word32 a5_102;
		vAssertCalled(a4_32, mstatus, out a5_102);
	}
	ptr32 a3_48;
	ptr32 a4_49;
	ptr32 a5_50;
	word32 t1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	Eq_2 ra_51 = memset(ra_34, a0, 0x00, 36, out t1_98, out a0_99, out a1_100, out a2_101, out a3_48, out a4_49, out a5_50);
	*((word32) a1 + 24) = a0;
	*((word32) a0 + 8) = a2;
	*((word32) a0 + 0x0C) = a3;
	((word32) a0 + 28)->u1 = (byte) a4;
	s0Out = s1;
	s1Out = a1;
	a3Out = a3_48;
	a4Out = a4_49;
	a5Out = a5_50;
	s2Out = a4;
	s4Out = dwArg04;
	return ra_51;
}

