pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302F47E: Register Eq_2 prvWriteBytesToBuffer(Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_153378 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferSendFromISR
Eq_2 prvWriteBytesToBuffer(Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_153378 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	Eq_153378 a3_104;
	ptr32 a1_102;
	Eq_2 a5_100;
	Eq_2 a4_114;
	Eq_2 s0_132;
	word32 s1_129;
	if (a2 != 0x00)
	{
		a0 = *((word32) a5 + 8);
		s3 = a5 - s0;
		if (a2 >= s3)
		{
			a4 = s0 + s3;
			if (a5 >= a4)
				goto l2302F4A8;
		}
		else
		{
			s3 = a2;
			a4 = s0 + a2;
			if (a5 >= a4)
				goto l2302F4A8;
		}
	}
	else
	{
		Eq_2 a5_25;
		vAssertCalled(a4, mstatus, out a5_25);
		if (a5_25 >= s0)
		{
			word32 a2_251;
			word32 a6_252;
			word32 a7_253;
			memcpy(a0 + s0, a1, 0x00, out a1_102, out a2_251, out a3_104, out a4_114, out a5_100, out a6_252, out a7_253);
			s1_129 = (word32) *((word32) a5_100 + 8);
			s0_132 = s0 + a2;
			if (s0_132 < a5_100)
				goto l2302F4D6;
			goto l2302F4D4;
		}
		s3.u0 = 0x00;
	}
	word32 a5_240;
	vAssertCalled(a4, mstatus, out a5_240);
l2302F4A8:
	word32 a0_72 = a0 + s0;
	word32 a2_241;
	word32 a6_242;
	word32 a7_243;
	memcpy(a0_72, a1, s3, out a1_102, out a2_241, out a3_104, out a4_114, out a5_100, out a6_242, out a7_243);
	if (s3 < a2)
	{
		Eq_2 a2_89 = a2 - s3;
		if (a5_100 >= a2_89)
		{
			word32 a2_248;
			word32 a6_249;
			word32 a7_250;
			memcpy(a0_72, a1 + s3, a2_89, out a1_102, out a2_248, out a3_104, out a4_114, out a5_100, out a6_249, out a7_250);
		}
		else
		{
			word32 a5_244;
			vAssertCalled(a4_114, mstatus, out a5_244);
			word32 a2_245;
			word32 a6_246;
			word32 a7_247;
			memcpy(a0_72, a1 + s3, a2_89, out a1_102, out a2_245, out a3_104, out a4_114, out a5_100, out a6_246, out a7_247);
		}
	}
	s1_129 = (word32) *((word32) a5_100 + 8);
	s0_132 = s0 + a2;
	if (s0_132 < a5_100)
	{
l2302F4D6:
		*((word32) s0_132 + 4) = s1_129;
		0x00 = (uint16) dwArg0128;
		a0Out = a2;
		a1Out = a1_102;
		a2Out = dwArg0100;
		a3Out = a3_104;
		a4Out = a4_114;
		a5Out = a5_100;
		s2Out = a2;
		s3Out = s3;
		return dwArgE4;
	}
l2302F4D4:
	s0_132 -= a5_100;
	goto l2302F4D6;
}

// 2302F534: Register (ptr32 Eq_2) prvReadBytesFromBuffer(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out (ptr32 Eq_2) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      xStreamBufferReceive
//      xStreamBufferReceiveFromISR
union Eq_2 * prvReadBytesFromBuffer(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s0_19 = a3;
	if (a3 >= a2)
		s0_19 = a2;
	union Eq_2 * s1_129;
	s1_129 = s1;
	if (s0_19 == 0x00)
	{
l2302F5A0:
		s1Out = s1_129;
		a0Out = s0_19;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		return s1;
	}
	Eq_2 a4_53;
	Eq_2 s3_26 = *a0;
	Eq_2 s4_30 = a5 - s3_26;
	if (s0_19 >= s4_30)
	{
		if (a2 >= s4_30)
		{
l2302F566:
			a4_53 = s3_26 + s4_30;
			if (a5 >= a4_53)
				goto l2302F56E;
l2302F5CE:
			word32 a5_299;
			vAssertCalled(a4_53, mstatus, out a5_299);
l2302F56E:
			word32 a2_300;
			word32 a6_301;
			word32 a7_302;
			memcpy(a1, a1 + s3_26, s4_30, out a1, out a2_300, out a3, out a4, out a5, out a6_301, out a7_302);
			s2 = a2;
			s5 = a1;
			if (s4_30 < s0_19)
			{
				if (a2 < s0_19)
				{
					word32 a5_303;
					vAssertCalled(a4, mstatus, out a5_303);
				}
				word32 a7_306;
				word32 a2_304;
				word32 a6_305;
				memcpy(a1 + s4_30, a1, s0_19 - s4_30, out a1, out a2_304, out a3, out a4, out a5, out a6_305, out a7_306);
			}
			s1_129 = (union Eq_2 *) *((word32) a5 + 8);
			s3 = s3_26 + s0_19;
			if (s3 >= a5)
				s3 -= a5;
			*s1_129 = (union Eq_2 *) s3;
			goto l2302F5A0;
		}
	}
	else
	{
		s4_30 = s0_19;
		if (a2 >= s0_19)
			goto l2302F566;
	}
	Eq_2 a5_48;
	vAssertCalled(a4, mstatus, out a5_48);
	a4_53 = s3_26 + s4_30;
	if (a5_48 >= a4_53)
		goto l2302F56E;
	goto l2302F5CE;
}

// 2302F5DA: Register Eq_2 xStreamBufferGenericCreate(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out)
// Called from:
//      vfs_uart_open
Eq_2 xStreamBufferGenericCreate(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a5_14 = 0x01;
	Eq_2 s1_18 = a1;
	if (a2 != 0x01)
	{
		if (a0 == 0x00)
		{
			vAssertCalled(a4, mstatus, out a5_14);
			if (a0 >= a1)
				goto l2302F5F8;
			goto l2302F62A;
		}
	}
	else
	{
		a5_14.u0 = 0x04;
		if (a0 <= 0x04)
		{
			vAssertCalled(a4, mstatus, out a5_14);
			if (a0 >= a1)
			{
l2302F5F8:
				if (a1 != 0x00)
					goto l2302F5FA;
l2302F626:
				s1_18.u0 = 0x01;
l2302F5FA:
				word32 s8_229;
				Eq_2 a0_78;
				ptr32 s3_88;
				word32 s4_228;
				word32 a1_224;
				word32 a2_225;
				word32 a6_226;
				word32 s2_227;
				Eq_2 s1_107;
				ptr32 a3_101;
				ptr32 a4_102;
				ptr32 a5_103;
				Eq_2 s0_106 = pvPortMalloc(ra, s1_18, (word32) a0 + 37, a3, a4, a5_14, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_107, out a0_78, out a1_224, out a2_225, out a3_101, out a4_102, out a5_103, out a6_226, out s2_227, out s3_88, out s4_228, out s8_229);
				Eq_2 s2_108 = a0_78;
				if (a0_78 != 0x00)
				{
					word32 s4_230;
					ra = prvInitialiseNewStreamBuffer(ra, a0_78, (word32) a0_78 + 36, (word32) s0_106 + 1, s1_107, s3_88, mstatus, out s0_106, out s1_107, out a3_101, out a4_102, out a5_103, out s2_108, out s4_230);
				}
				s0Out = s0_106;
				s1Out = s1_107;
				a0Out = s2_108;
				a3Out = a3_101;
				a4Out = a4_102;
				a5Out = a5_103;
				s2Out = s2_108;
				return ra;
			}
l2302F62A:
			vAssertCalled(a4, mstatus, out a5_14);
			if (a1 != 0x00)
				goto l2302F5FA;
			goto l2302F626;
		}
	}
	if (a0 >= a1)
		goto l2302F5F8;
	goto l2302F62A;
}

// 2302F650: Register Eq_2 xStreamBufferGenericCreateStatic(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out Eq_2 s4Out)
// Called from:
//      wifi_mgmr_init
Eq_2 xStreamBufferGenericCreateStatic(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & a0Out, union Eq_2 & s4Out)
{
	ptr32 s1_114;
	Eq_2 s4_161 = a0;
	Eq_2 s2_120 = a1;
	Eq_2 s0_102 = a4;
	if (a3 != 0x00)
	{
		if (a4 != 0x00)
		{
l2302F66C:
			if (a0 >= a1)
			{
l2302F670:
				if (a1 != 0x00)
				{
l2302F674:
					s1_114 = (word32) (a2 != 0x00) + 0x02;
					if (a0 > 0x04)
					{
l2302F680:
						if (a4 == 36)
						{
l2302F68C:
							if (a3 != 0x00)
							{
l2302F690:
								if (a4 != 0x00)
								{
									word32 a3_383;
									word32 s2_386;
									word32 a5_385;
									word32 a4_384;
									word32 s1_382;
									ra = prvInitialiseNewStreamBuffer(ra, a4, a3, a0, s2_120, s1_114, mstatus, out s0_102, out s1_382, out a3_383, out a4_384, out a5_385, out s2_386, out s4_161);
									((word16) s0_102.u0 + 28)->u1 = (byte) ((word32) *((word16) s0_102.u0 + 28) | 2);
								}
l2302F6AC:
								0x00 = (uint16) dwArg0128;
								s0Out = dwArgE4;
								a0Out = s0_102;
								s4Out = s4_161;
								return ra;
							}
l2302F6E4:
							s0_102.u0 = 0x00;
							goto l2302F6AC;
						}
l2302F6DC:
						word32 a5_381;
						vAssertCalled(a4, mstatus, out a5_381);
						if (a3 != 0x00)
							goto l2302F690;
						goto l2302F6E4;
					}
l2302F6CC:
					word32 a5_380;
					vAssertCalled(a4, mstatus, out a5_380);
					if (a4 == 36)
						goto l2302F68C;
					goto l2302F6DC;
				}
l2302F6BE:
				s2_120.u0 = 0x01;
				s1_114 = (word32) (a2 != 0x00) + 0x02;
				if (a0 > 0x04)
					goto l2302F680;
				goto l2302F6CC;
			}
l2302F6E8:
			word32 a5_379;
			vAssertCalled(a4, mstatus, out a5_379);
			if (a1 != 0x00)
				goto l2302F674;
			goto l2302F6BE;
		}
	}
	else
	{
		word32 a5_377;
		vAssertCalled(a4, mstatus, out a5_377);
		if (a4 != 0x00)
			goto l2302F66C;
	}
	word32 a5_378;
	vAssertCalled(a4, mstatus, out a5_378);
	if (a0 >= a1)
		goto l2302F670;
	goto l2302F6E8;
}

// 2302F704: Register Eq_2 vStreamBufferDelete(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out)
// Called from:
//      vfs_uart_close
Eq_2 vStreamBufferDelete(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a4Out)
{
	if (a0 == 0x00)
	{
		word32 a5_103;
		vAssertCalled(a4, mstatus, out a5_103);
		ui32 a5_13 = (word32) *((word32) a0 + 28);
		if ((a5_13 & 0x02) != 0x00)
		{
			ptr32 a0_19;
			ptr32 a2_21;
			ptr32 a4_23;
			word32 t1_118;
			word32 a1_119;
			word32 a3_120;
			word32 a5_121;
			Eq_2 ra_25 = memset(ra, a0, 0x00, 36, out t1_118, out a0_19, out a1_119, out a2_21, out a3_120, out a4_23, out a5_121);
			s1Out = s1;
			a0Out = a0_19;
			a2Out = a2_21;
			a4Out = a4_23;
			return ra_25;
		}
		else
		{
			ptr32 a2_30;
			ptr32 a4_32;
			ptr32 s1_34;
			ptr32 a0_36;
			word32 s0_111;
			word32 a1_112;
			word32 a3_113;
			word32 a5_114;
			word32 a6_115;
			word32 s4_116;
			word32 t3_117;
			vPortFree(a0, dwArg24, a5_13 & 0x02, mstatus, dwArg0158, dwArg0198, out s0_111, out s1_34, out a0_36, out a1_112, out a2_30, out a3_113, out a4_32, out a5_114, out a6_115, out s4_116, out t3_117);
			s1Out = s1_34;
			a0Out = a0_36;
			a2Out = a2_30;
			a4Out = a4_32;
			return ra;
		}
	}
	else
	{
		ui32 a5_43 = (word32) *((word32) a0 + 28);
		if ((a5_43 & 0x02) != 0x00)
		{
			ptr32 a0_47;
			ptr32 a2_49;
			ptr32 a4_51;
			word32 t1_122;
			word32 a1_123;
			word32 a3_124;
			word32 a5_125;
			Eq_2 ra_53 = memset(ra, a0, 0x00, 36, out t1_122, out a0_47, out a1_123, out a2_49, out a3_124, out a4_51, out a5_125);
			s1Out = s1;
			a0Out = a0_47;
			a2Out = a2_49;
			a4Out = a4_51;
			return ra_53;
		}
		else
		{
			ptr32 a2_57;
			ptr32 a4_59;
			ptr32 s1_61;
			ptr32 a0_63;
			word32 s0_104;
			word32 a1_105;
			word32 a3_106;
			word32 a5_107;
			word32 a6_108;
			word32 s4_109;
			word32 t3_110;
			vPortFree(a0, a2, a5_43 & 0x02, mstatus, dwArg0158, dwArg0198, out s0_104, out s1_61, out a0_63, out a1_105, out a2_57, out a3_106, out a4_59, out a5_107, out a6_108, out s4_109, out t3_110);
			s1Out = s1_61;
			a0Out = a0_63;
			a2Out = a2_57;
			a4Out = a4_59;
			return ra;
		}
	}
}

// 2302F746: Register Eq_2 xStreamBufferSpacesAvailable(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_153890 a5, Register ptr32 mstatus, Register out Eq_153890 a5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferSendFromISR
Eq_2 xStreamBufferSpacesAvailable(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_153890 a5, ptr32 mstatus, union Eq_153890 & a5Out)
{
	if (a0 == 0x00)
	{
		Eq_153890 a5_11;
		vAssertCalled(a4, mstatus, out a5_11);
		word32 a0_19 = a4 + a5_11 + ~0x00 - a3;
		if (a0_19 >= a4)
			a0_19 -= a4;
		a5Out = a5_11;
		return a0_19;
	}
	else
	{
		word32 a0_32 = a4 + a5 + ~0x00 - a3;
		if (a0_32 < a4)
		{
			a5Out = a5;
			return a0_32;
		}
		else
		{
			a5Out = a5;
			return a0_32 - a4;
		}
	}
}

