pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302F786: Register Eq_2 xStreamBufferSend(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_event_notify
//      vfs_uart_write
Eq_2 xStreamBufferSend(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 s4_135 = a1;
	Eq_2 s0_132 = a0;
	Eq_2 s3_116 = a2;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l2302F7A4;
	}
	else
	{
		word32 a5_711;
		vAssertCalled(a4, mstatus, out a5_711);
		if (a0 != 0x00)
			goto l2302F7A4;
	}
	word32 a5_712;
	vAssertCalled(a4, mstatus, out a5_712);
l2302F7A4:
	Eq_2 a3_128;
	Eq_2 s1_180;
	Eq_2 s1_133;
	ui32 a5_36 = (word32) *((word32) a0 + 28);
	Eq_2 s2_134 = a2;
	Eq_153890 a5_130 = a5_36 & 0x01;
	if ((a5_36 & 0x01) != 0x00)
	{
		s2_134 = (word32) a2 + 4;
		if (a2 >= (word32) a2 + 4)
		{
			vAssertCalled(a4, mstatus, out a5_130);
			if (a5_130 == 0x00)
			{
				a3_128 = a3;
				goto l2302F85C;
			}
l2302F7BA:
			a3_128 = vTaskSetTimeOutState(fp + -40, a4, a5_130, mstatus, out a4);
			do
			{
				Eq_153890 a5_68;
				Eq_2 a4_69 = vTaskEnterCritical(a4, mstatus, out a5_68);
				Eq_2 a5_75;
				Eq_2 a0_73 = xStreamBufferSpacesAvailable(s0_132, a3_128, a4_69, a5_68, mstatus, out a5_75);
				s1_133 = a0_73;
				if (a0_73 >= s2_134)
				{
					a3_128 = vTaskExitCritical(a3_128, mstatus, out a4, out a5_130);
					break;
				}
				Eq_2 a4_81;
				struct Eq_154002 * a5_82;
				Eq_2 a3_89 = xTaskNotifyStateClear(0x00, a3_128, a4_69, a5_75, mstatus, out a4_81, out a5_82);
				word32 s0_91 = a5_82->dw0014;
				if (a5_82 != null)
				{
					word32 a5_721;
					vAssertCalled(a4_81, mstatus, out a5_721);
				}
				word32 a5_714;
				*((word32) xTaskGetCurrentTaskHandle(out a5_714) + 20) = s0_91;
				Eq_2 a4_102;
				Eq_2 a2_110;
				Eq_2 a4_111;
				word32 a5_112;
				word32 s2_717;
				word32 s1_716;
				word32 a5_715;
				word32 s4_718;
				word32 s5_719;
				*((word32) xTaskNotifyWait(null, 0x00, 0x00, vTaskExitCritical(a3_89, mstatus, out a4_102, out a5_715), a4_102, mstatus, s2, dwArgE8, out s1_716, out a2_110, out a4_111, out a5_112, out s2_717, out s3_116, out s4_718, out s5_719) + 20) = 0x00;
				a1 = fp + -52;
				word32 a0_126;
				word32 a2_720;
				s0_132 = xTaskCheckForTimeOut(fp + -40, fp + -52, a2_110, a4_111, a5_112, mstatus, out s1_133, out a0_126, out a2_720, out a3_128, out a4, out a5_130, out s2_134, out s4_135);
			} while (a0_126 == 0x00);
			if (s1_133 != 0x00)
			{
l2302F80C:
				Eq_2 a2_189;
				ui32 a5_173 = (word32) *((word32) s0_132 + 28);
				Eq_2 a5_174 = a5_173 & 0x01;
				if ((a5_173 & 0x01) == 0x00)
				{
					a2_189 = s3_116;
					if (s1_133 < s3_116)
						a2_189 = s1_133;
l2302F81C:
					Eq_2 a0_238;
					word32 a5_243;
					word32 s2_740;
					word32 a2_739;
					prvWriteBytesToBuffer(s0_132, s0_132, s4_135, a2_189, a4, a5_174, mstatus, dwArgE8, out a0_238, out a1, out a2_739, out a3_128, out a4, out a5_243, out s2_740, out s3_116);
					s1_180 = a0_238;
					if (a0_238 != 0x00)
					{
						Eq_2 a5_264 = (word32) a4 + a5_243 - a3_128;
						if (a5_264 >= a4)
							a5_264 -= a4;
						if (a5_264 >= a4)
						{
							Eq_2 a5_271;
							Eq_2 a4_270 = vTaskSuspendAll(a4, out a5_271);
							if (a5_271 != 0x00)
							{
								struct Eq_154141 * s0_297;
								word32 s1_729;
								word32 a0_730;
								word32 a2_731;
								word32 s4_733;
								word32 s2_732;
								ra = xTaskGenericNotify(ra, a0_238, 0x00, 0x00, 0x00, a4_270, mstatus, s4, dwLoc08, dwArg18, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_297, out s1_729, out a0_730, out a1, out a2_731, out a3_128, out a4_270, out a5_271, out s2_732, out s3_116, out s4_733, out mstatus);
								s0_297->dw0010 = 0x00;
							}
							word32 s0_722;
							word32 a2_724;
							word32 s4_727;
							word32 a0_723;
							word32 a5_725;
							word32 t3_728;
							word32 a6_726;
							xTaskResumeAll(a3_128, a4_270, a5_271, mstatus, dwArg0118, dwArg0158, out s0_722, out s1_180, out a0_723, out a2_724, out a3_128, out a4, out a5_725, out a6_726, out s4_727, out t3_728);
						}
					}
l2302F86A:
					s1Out = s1_180;
					a0Out = s1_180;
					a1Out = a1;
					a3Out = a3_128;
					a4Out = a4;
					s3Out = s3_116;
					mstatusOut = mstatus;
					return ra;
				}
				if (s1_133 >= s2_134)
				{
					word32 a3_736;
					word32 s2_737;
					word32 s3_738;
					word32 a1_735;
					word32 a0_734;
					s0_132 = prvWriteBytesToBuffer(s0_132, s0_132, fp + -44, 0x04, a4, a5_173 & 0x01, mstatus, dwArgE8, out a0_734, out a1_735, out a2_189, out a3_736, out a4, out a5_174, out s2_737, out s3_738);
					s4_135 = a3;
					goto l2302F81C;
				}
l2302F868:
				s1_180.u0 = 0x00;
				goto l2302F86A;
			}
l2302F85C:
			word32 a5_713;
			Eq_2 a0_157 = xStreamBufferSpacesAvailable(s0_132, a3_128, a4, a5_130, mstatus, out a5_713);
			s1_133 = a0_157;
			if (a0_157 == 0x00)
				goto l2302F868;
			goto l2302F80C;
		}
	}
	a3_128 = a3;
	if ((a5_36 & 0x01) == 0x00)
		goto l2302F85C;
	goto l2302F7BA;
}

// 2302F8AC: Register Eq_2 xStreamBufferSendFromISR(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      __uart_rx_irq
Eq_2 xStreamBufferSendFromISR(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg14, Eq_2 dwArgF8, word32 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 s2_122 = a1;
	Eq_2 s0_100 = a0;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l2302F8C6;
	}
	else
	{
		word32 a5_372;
		vAssertCalled(a4, mstatus, out a5_372);
		if (a0 != 0x00)
			goto l2302F8C6;
	}
	word32 a5_373;
	vAssertCalled(a4, mstatus, out a5_373);
l2302F8C6:
	ui32 a5_36 = (word32) *((word32) a0 + 28);
	Eq_2 s4_39 = a2;
	if ((a5_36 & 0x01) != 0x00)
		s4_39 = (word32) a2 + 4;
	Eq_2 s1_133;
	Eq_2 a5_108;
	Eq_2 a0_52 = xStreamBufferSpacesAvailable(a0, a3, a4, a5_36 & 0x01, mstatus, out a5_108);
	Eq_2 dwArg54_197 = a2;
	if (a0_52 != 0x00)
	{
		Eq_2 a2_103;
		ui32 a5_61 = (word32) *((word32) a0 + 28);
		a5_108 = a5_61 & 0x01;
		if ((a5_61 & 0x01) == 0x00)
		{
			a2_103 = a2;
			if (a0_52 < a2)
				a2_103 = a0_52;
			dwArg54_197 = a2_103;
		}
		else
		{
			if (a0_52 < s4_39)
				goto l2302F8DE;
			word32 a3_377;
			word32 s3_378;
			word32 a2_376;
			word32 a1_375;
			word32 a0_374;
			s0_100 = prvWriteBytesToBuffer(a0, a0, fp + -36, 0x04, a4, a5_61 & 0x01, mstatus, dwArgF8, out a0_374, out a1_375, out a2_376, out a3_377, out a4, out a5_108, out s2_122, out s3_378);
			a2_103 = a2;
		}
		word32 a1_379;
		word32 a2_380;
		Eq_2 a0_112;
		Eq_2 s3_123;
		prvWriteBytesToBuffer(s0_100, s0_100, s2_122, a2_103, a4, a5_108, mstatus, dwArgF8, out a0_112, out a1_379, out a2_380, out a3, out a4, out a5_108, out s2_122, out s3_123);
		s1_133 = a0_112;
		if (a0_112 != 0x00)
		{
			a5_108 = a5_108 + a4 - a3;
			if (a5_108 >= a4)
				a5_108 -= a4;
			if (a5_108 >= a4 && a5_108 != 0x00)
			{
				struct Eq_154316 * s0_167;
				ra = xTaskGenericNotifyFromISR(ra, a0_112, null, 0x00, 0x00, s3_123, a5_108, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg54_197, out s0_167, out s1_133, out a3, out a4, out a5_108, out s2_122, out mstatus);
				s0_167->dw0010 = 0x00;
			}
		}
l2302F8E0:
		0x00 = dwArg0128;
		a0Out = s1_133;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_108;
		s2Out = s2_122;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
l2302F8DE:
		s1_133.u0 = 0x00;
		goto l2302F8E0;
	}
}

// 2302F95E: Register Eq_2 xStreamBufferReceive(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_116648) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out (ptr32 Eq_2) s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_start
//      vfs_uart_read
//      uart_ioctl_cmd_waimode
Eq_2 xStreamBufferReceive(Eq_2 ra, Eq_2 s0, struct Eq_116648 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s3_104 = a1;
	Eq_2 s4_105 = a2;
	Eq_2 s5_106 = a3;
	if (a1 != 0x00)
	{
		if (a0 != null)
			goto l2302F97A;
	}
	else
	{
		vAssertCalled(a4, mstatus, out a5);
		if (a0 != null)
			goto l2302F97A;
	}
	vAssertCalled(a4, mstatus, out a5);
l2302F97A:
	union Eq_2 * s1_123;
	ptr32 s0_269;
	Eq_2 s0_125;
	Eq_2 s0_101;
	Eq_2 s2_103 = ((word32) a0->b001C & 1) << 2;
	s0_101 = s0;
	if (a3 != 0x00)
	{
		Eq_2 a5_45;
		Eq_2 a4_46 = vTaskEnterCritical(a4, mstatus, out a5_45);
		s1_123 = (union Eq_2 *) *a4_46;
		s0_125 = s0 + a5_45 - a4_46;
		if (s0_125 >= a5_45)
			s0_125 -= a5_45;
		if (s2_103 < s0_125)
		{
			vTaskExitCritical(a3, mstatus, out a4, out a5);
			goto l2302F9CE;
		}
		Eq_2 a4_65;
		struct Eq_154504 * a5_66;
		Eq_2 a3_73 = xTaskNotifyStateClear(0x00, a3, a4_46, a5_45, mstatus, out a4_65, out a5_66);
		word32 s1_75 = a5_66->dw0010;
		if (a5_66 != null)
		{
			word32 a5_589;
			vAssertCalled(a4_65, mstatus, out a5_589);
		}
		word32 a5_586;
		*((word32) xTaskGetCurrentTaskHandle(out a5_586) + 16) = s1_75;
		Eq_2 a4_86;
		word32 a5_587;
		vTaskExitCritical(a3_73, mstatus, out a4_86, out a5_587);
		struct Eq_154539 * s1_102;
		word32 a2_588;
		s0_101 = xTaskNotifyWait(null, 0x00, 0x00, a3, a4_86, mstatus, dwLoc18, dwArgF8, out s1_102, out a2_588, out a4, out a5, out s2_103, out s3_104, out s4_105, out s5_106);
		s1_102->dw0010 = 0x00;
		a1.u0 = 0x00;
	}
	s1_123 = (union Eq_2 *) *a4;
	s0_125 = s0_101 + a5 - a4;
	if (s0_125 >= a5)
		s0_125 -= a5;
	if (s2_103 >= s0_125)
	{
l2302F99C:
		s0_269 = 0x00;
		goto l2302F99E;
	}
l2302F9CE:
	if (s2_103 != 0x00)
	{
		Eq_2 s4_156;
		word32 s2_166;
		Eq_2 s5_168;
		word32 a0_572;
		word32 a1_573;
		word32 a3_574;
		s0_125 = prvReadBytesFromBuffer(s1_123, fp + -36, s2_103, s0_125, a4, a5, mstatus, out s1_123, out a0_572, out a1_573, out a3_574, out a4, out a5, out s2_166, out s3_104, out s4_156, out s5_168) - s2_166;
		if (s4_156 < a5)
		{
			*s1_123 = (union Eq_2 *) s5_168;
			s4_105.u0 = 0x00;
		}
		else
			s4_105 = a5;
	}
	Eq_2 a0_202;
	word32 s4_575;
	Eq_2 a3_211;
	prvReadBytesFromBuffer(s1_123, s3_104, s4_105, s0_125, a4, a5, mstatus, out s1_123, out a0_202, out a1, out a3_211, out a4, out a5, out s2_103, out s3_104, out s4_575, out s5_106);
	if (a0_202 != 0x00)
	{
		Eq_2 a5_226;
		Eq_2 a4_225 = vTaskSuspendAll(a4, out a5_226);
		if (a5_226 != 0x00)
		{
			struct Eq_154477 * s1_248;
			word32 a0_583;
			word32 a2_584;
			word32 s4_585;
			word32 s0_582;
			ra = xTaskGenericNotify(ra, a0_202, 0x00, 0x00, 0x00, a4_225, mstatus, s0, dwArg08, dwArg28, dwArgB4, dwArgD0, dwArgD4, dwArgF8, out s0_582, out s1_248, out a0_583, out a1, out a2_584, out a3_211, out a4_225, out a5_226, out s2_103, out s3_104, out s4_585, out mstatus);
			s1_248->dw0014 = 0x00;
		}
		word32 a6_579;
		word32 a0_576;
		word32 a2_577;
		word32 s4_580;
		word32 a3_578;
		word32 t3_581;
		xTaskResumeAll(a3_211, a4_225, a5_226, mstatus, dwArg0128, dwArg0168, out s0_269, out s1_123, out a0_576, out a2_577, out a3_578, out a4, out a5, out a6_579, out s4_580, out t3_581);
l2302F99E:
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_123;
		a0Out = s0_269;
		a1Out = a1;
		a2Out = dwArg0100;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2_103;
		s3Out = s3_104;
		s4Out = dwArg78;
		s5Out = s5_106;
		s8Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	goto l2302F99C;
}

// 2302FA5C: Register Eq_2 xStreamBufferReceiveFromISR(Register Eq_2 ra, Register (ptr32 Eq_154569) s0, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArg54, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      __uart_tx_irq
Eq_2 xStreamBufferReceiveFromISR(Eq_2 ra, struct Eq_154569 * s0, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg14, Eq_2 dwArg54, word32 dwArg0128, ptr32 & s0Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 s3_102 = a1;
	Eq_2 s4_25 = a2;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l2302FA7A;
	}
	else
	{
		vAssertCalled(a4, mstatus, out a5);
		if (a0 != 0x00)
			goto l2302FA7A;
	}
	vAssertCalled(a4, mstatus, out a5);
l2302FA7A:
	union Eq_2 * s1_107 = *a4;
	word32 s0_49 = s0 + a5 - a4;
	Eq_2 s2_126 = ((word32) *((word32) *((word32) a5 + 8) + 28) & 1) << 2;
	if (s0_49 >= a5)
		s0_49 -= a5;
	Eq_2 s0_134;
	if (s2_126 < s0_49)
	{
		if (s2_126 != 0x00)
		{
			Eq_2 s6_63 = *s1_107;
			word32 a1_350;
			word32 a0_349;
			Eq_2 s4_72;
			word32 s2_82;
			word32 a3_351;
			word32 s5_352;
			s0_49 = prvReadBytesFromBuffer(s1_107, fp + -36, s2_126, s0_49, a4, a5, mstatus, out s1_107, out a0_349, out a1_350, out a3_351, out a4, out a5, out s2_82, out s3_102, out s4_72, out s5_352) - s2_82;
			if (s4_72 < a5)
			{
				*s1_107 = (union Eq_2 *) s6_63;
				s4_25.u0 = 0x00;
			}
			else
				s4_25 = a5;
		}
		word32 s1_353;
		Eq_2 a0_112;
		Eq_2 s5_128;
		word32 a1_354;
		word32 s4_356;
		word32 s3_355;
		prvReadBytesFromBuffer(s1_107, s3_102, s4_25, s0_49, a4, a5, mstatus, out s1_353, out a0_112, out a1_354, out a3, out a4, out a5, out s2_126, out s3_355, out s4_356, out s5_128);
		s0_134 = a0_112;
		if (a0_112 != 0x00)
		{
			if (a5 != 0x00)
			{
				struct Eq_154678 * s1_155;
				ra = xTaskGenericNotifyFromISR(ra, a0_112, null, 0x00, 0x00, s5_128, a5, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg54, out s0_134, out s1_155, out a3, out a4, out a5, out s2_126, out mstatus);
				s1_155->dw0014 = 0x00;
			}
l2302FA9A:
			0x00 = dwArg0128;
			s0Out = dwArgE4;
			a0Out = s0_134;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2_126;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s0_134.u0 = 0x00;
	goto l2302FA9A;
}

// 2302FB0E: Register word32 xStreamBufferIsEmpty(Register word32 a0, Register Eq_2 a4, Register (ptr32 (ptr32 Eq_154728)) a5, Register ptr32 mstatus, Register out ptr32 a2Out)
// Called from:
//      vfs_uart_poll
word32 xStreamBufferIsEmpty(word32 a0, Eq_2 a4, struct Eq_154728 ** a5, ptr32 mstatus, ptr32 & a2Out)
{
	if (a0 == 0x00)
	{
		struct Eq_154716 ** a5_11;
		vAssertCalled(a4, mstatus, out a5_11);
		word32 a0_18 = (word32) (*((char *) *a5_11 + 4) - a5_11 < 1);
		a2Out = dwArg24;
		return a0_18;
	}
	else
	{
		word32 a0_24 = (word32) (*((char *) *a5 + 4) - a5 < 1);
		a2Out = a2;
		return a0_24;
	}
}

// 2302FB38: Register word32 prvResetNextTaskUnblockTime.part.0(Register out ptr32 a5Out)
// Called from:
//      xTaskIncrementTick
//      xTaskResumeAll
//      aos_task_exit
word32 prvResetNextTaskUnblockTime.part.0(ptr32 & a5Out)
{
	word32 a4_9 = *((word32) *((word32) *((word32) g_t4200DE3C + 0x0C) + 0x0C) + 4);
	g_dw4200EE5C = a4_9;
	a5Out = 0x4200E000;
	return a4_9;
}

