pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302FB50: Register Eq_2 prvInitialiseNewTask.isra.2(Register Eq_2 ra, Register (ptr32 ptr32) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out ptr32 t0Out, Register out ptr32 s0Out, Register out ptr32 a2Out, Register out Eq_154767 a4Out, Register out ptr32 a5Out)
// Called from:
//      xTaskCreateStatic
//      xTaskCreate
Eq_2 prvInitialiseNewTask.isra.2(Eq_2 ra, ptr32 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg0128, ptr32 & t0Out, ptr32 & s0Out, ptr32 & a2Out, union Eq_154767 & a4Out, ptr32 & a5Out)
{
	word32 t1_225;
	word32 a0_226;
	word32 a4_230;
	word32 a3_229;
	word32 a2_228;
	word32 a1_227;
	word32 a5_231;
	Eq_2 ra_45 = memset(ra, *((word32) a6 + 48), 0x00A5, a2 << 0x02, out t1_225, out a0_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_231);
	Eq_2 s2_36 = a4;
	int32 s3_50 = (word32) *((word32) a6 + 48) + ((a2 << 0x02) + ~0x03);
	if (a1 != 0x00)
	{
		Eq_2 a1_53 = a1;
		struct Eq_154808 * a5_54 = (word32) a6 + 52;
		do
		{
			word32 a3_58 = (word32) *a1_53;
			++a5_54;
			a5_54[0x0FFF] = (struct Eq_154808) (byte) a3_58;
			a1_53 = (word32) a1_53 + 1;
		} while (a3_58 != 0x00 && a1_53 != (word32) a1 + 16);
		((word32) a6 + 67)->u1 = 0x00;
	}
	else
		((word32) a6 + 52)->u1 = 0x00;
	if (a4 > 0x1F)
		s2_36.u0 = 0x1F;
	*((word32) a6 + 44) = s2_36;
	*((word32) a6 + 80) = s2_36;
	((word32) a6 + 84)->u0 = 0x00;
	vListInitialiseItem((word32) a6 + 4);
	vListInitialiseItem((word32) a6 + 24);
	((word32) a6 + 88)->u0 = 0x00;
	*((word32) a6 + 16) = a6;
	(32 - s2_36)->t0018 = a6;
	*((word32) a6 + 36) = a6;
	((word32) a6 + 0x0044)->u0 = 0x00;
	((word32) a6 + 92)->u1 = 0x00;
	union Eq_2 * a0_108;
	ptr32 t0_109 = fn23032000(s3_50 & -8, a0, a3, mstatus, out a0_108);
	*a0_108 = (union Eq_2 *) a6;
	if (a5 != 0x00)
		*a5 = a6;
	0x00 = (uint16) dwArg0128;
	t0Out = t0_109;
	s0Out = dwArgE4;
	a2Out = dwArgB8;
	a4Out.u0 = 32;
	a5Out = 0x1F;
	return ra_45;
}

// 2302FC1E: Register word32 prvDeleteTCB(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_155331) s4Out)
// Called from:
//      prvIdleTask
//      aos_task_exit
word32 prvDeleteTCB(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188, Eq_2 dwArg0198, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_155331 & s4Out)
{
	Eq_2 a4_5 = (word32) *((word32) a0 + 93);
	if (a4_5 == 0x00)
	{
		Eq_2 a5_19;
		Eq_2 s0_25;
		word32 s1_92;
		word32 a0_93;
		word32 a1_94;
		word32 a2_95;
		word32 a3_96;
		word32 a4_97;
		word32 a6_98;
		word32 s4_99;
		word32 t3_100;
		vPortFree(*((word32) a0 + 48), a2, a5, mstatus, dwArg0148, dwArg0188, out s0_25, out s1_92, out a0_93, out a1_94, out a2_95, out a3_96, out a4_97, out a5_19, out a6_98, out s4_99, out t3_100);
		Eq_2 a2_32;
		ptr32 a3_33;
		Eq_2 a4_34;
		ptr32 a5_35;
		word32 s1_36;
		union Eq_155331 * s4_42;
		word32 s0_101;
		word32 a0_102;
		word32 a1_103;
		word32 a6_104;
		word32 t3_105;
		vPortFree(s0_25, dwArg10, a5_19, mstatus, dwArg0158, dwArg0198, out s0_101, out s1_36, out a0_102, out a1_103, out a2_32, out a3_33, out a4_34, out a5_35, out a6_104, out s4_42, out t3_105);
		a2Out = a2_32;
		a3Out = a3_33;
		a4Out = a4_34;
		a5Out = a5_35;
		s4Out = s4_42;
		return s1_36;
	}
	else if (a4_5 == 0x01)
	{
		Eq_2 a2_45;
		ptr32 a3_46;
		Eq_2 a4_47;
		ptr32 a5_48;
		word32 s1_49;
		union Eq_155331 * s4_55;
		word32 s0_106;
		word32 a0_107;
		word32 a1_108;
		word32 a6_109;
		word32 t3_110;
		vPortFree(a0, a2, 0x01, mstatus, dwArg0158, dwArg0198, out s0_106, out s1_49, out a0_107, out a1_108, out a2_45, out a3_46, out a4_47, out a5_48, out a6_109, out s4_55, out t3_110);
		a2Out = a2_45;
		a3Out = a3_46;
		a4Out = a4_47;
		a5Out = a5_48;
		s4Out = s4_55;
		return s1_49;
	}
	else if (a4_5 != 0x02)
	{
		ptr32 a5_59;
		a2Out = vAssertCalled(a4_5, mstatus, out a5_59);
		a3Out = a3;
		a4Out = a4_5;
		a5Out = a5_59;
		s4Out = s4;
		return s1;
	}
	else
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4_5;
		a5Out = 0x02;
		s4Out = s4;
		return s1;
	}
}

// 2302FC54: Register word32 prvAddCurrentTaskToDelayedList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg48, Register out Eq_2 s1Out, Register out (ptr32 Eq_150378) a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_155025) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      vTaskDelay
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      ulTaskNotifyTake
//      xTaskNotifyWait
word32 prvAddCurrentTaskToDelayedList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 dwArg48, union Eq_2 & s1Out, struct Eq_150378 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, struct Eq_155025 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s2_10 = g_t4200DE68;
	word32 a5_161;
	Eq_2 a4_26;
	if (uxListRemove(a3, a4, out a4_26, out a5_161) == 0x00)
	{
		a4_26 = *a3;
		*(~(0x01 << a2) & a3) = (union Eq_2 *) a4_26;
	}
	if (a0 == ~0x00 && a1 != 0x00)
	{
		word32 s0_43 = *a1;
		struct Eq_155025 * a5_56;
		struct Eq_150378 * a0_55 = vListInsertEnd((word32) a1 + 4, a4_26, ~0x00, out a5_56);
		s1Out = a0;
		a0Out = a0_55;
		a1Out = (word32) a1 + 4;
		a2Out.u0 = <invalid>;
		a4Out = a4_26;
		a5Out = a5_56;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s0_43;
	}
	else
	{
		word32 s1_63 = a0 + s2_10;
		*((word32) s1_63 + 4) = ~0x00;
		if (s1_63 < s2_10)
		{
			Eq_2 a0_66 = g_t4200DE40;
			word32 s0_68 = *a1;
			Eq_2 a4_81;
			struct Eq_155025 * a5_82;
			struct Eq_150378 * a0_79 = vListInsert(a0_66, dwArg48, a3, out a4_81, out a5_82);
			s1Out = s1_63;
			a0Out = a0_79;
			a1Out = a1_80;
			a2Out.u0 = <invalid>;
			a4Out = a4_81;
			a5Out = a5_82;
			s2Out.u0 = <invalid>;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			return s0_68;
		}
		else
		{
			word32 s0_85 = *a1;
			Eq_2 a4_91;
			word32 a5_162;
			struct Eq_150378 * a0_89 = vListInsert(g_t4200DE3C, a2, a3, out a4_91, out a5_162);
			struct Eq_155025 * a5_94 = *a4_91;
			if (s1_63 < a4_91)
				*s1_63 = a5_94;
			s1Out = s1_63;
			a0Out = a0_89;
			a1Out = a1_90;
			a2Out.u0 = <invalid>;
			a4Out = a4_91;
			a5Out = a5_94;
			s2Out.u0 = <invalid>;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			return s0_85;
		}
	}
}

