pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 2302FD16: Register Eq_2 vTaskEnterCritical.part.7(Register Eq_2 a4, Register out (ptr32 Eq_155115) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      prvIdleTask
//      eTaskGetState
//      xTaskResumeAll
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      vTaskEnterCritical
//      ulTaskNotifyTake
//      xTaskNotifyWait
//      xTaskGenericNotify
//      xTaskNotifyStateClear
//      aos_task_exit
Eq_2 vTaskEnterCritical.part.7(Eq_2 a4, struct Eq_155115 & a5Out)
{
	struct Eq_155116 * a5_7 = **a4;
	Eq_2 a4_8 = a5_7->t0044;
	a5_7->t0045 = a4_8;
	a5Out = (struct Eq_155115 *) ((char *) a5_7 + 1);
	return a4_8;
}

// 2302FD2A: Register Eq_2 vTaskExitCritical.part.8(Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out (ptr32 Eq_155135) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      prvIdleTask
//      eTaskGetState
//      xTaskResumeAll
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      vTaskExitCritical
//      ulTaskNotifyTake
//      xTaskNotifyWait
//      xTaskGenericNotify
//      xTaskNotifyStateClear
//      aos_task_exit
Eq_2 vTaskExitCritical.part.8(Eq_2 a3, ptr32 mstatus, union Eq_2 & a4Out, struct Eq_155135 & a5Out)
{
	struct Eq_155136 * a5_8 = *a3;
	Eq_2 a4_9 = a5_8->t0044;
	a5_8->t0043 = a4_9;
	Eq_2 a3_12 = a5_8->t0043;
	if (a5_8 == (struct Eq_155136 *) ~0x00)
		__csrrs(mstatus, 0x08);
	a4Out = a4_9;
	a5Out = (struct Eq_155135 *) ((char *) a5_8 - 1);
	return a3_12;
}

// 2302FD46: Register word32 prvAddNewTaskToReadyList(Register (ptr32 Eq_155159) a0, Register (ptr32 Eq_155160) a2, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_155159) s2Out)
// Called from:
//      xTaskCreateStatic
//      xTaskCreate
word32 prvAddNewTaskToReadyList(struct Eq_155159 * a0, struct Eq_155160 * a2, Eq_2 a4, word32 a5, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_155159 & s2Out)
{
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_232;
		a4 = vTaskEnterCritical.part.7(a4, out a5_232);
	}
	Eq_2 a1_76;
	struct Eq_155175 * a5_30 = *a4;
	struct Eq_155175 ** a4_32 = (word32) a4 + 1;
	*a4_32 = (struct Eq_155175 **) a5_30;
	struct Eq_155175 * s1_34 = *a4_32;
	if (a4_32 != null)
	{
		a1_76 = a0->t002C;
		if (a5_30 == null)
		{
			struct Eq_155159 * s1_82 = a5_30->ptr0000;
			if (a1_76 >= a5_30->t002C)
				s1_82->ptr0000 = a0;
		}
	}
	else
	{
		s1_34->ptr0000 = a0;
		if (a4_32 != (struct Eq_155175 **) 0x01)
			a1_76 = a0->t002C;
		else
		{
			Eq_2 s4_42 = 1107371324;
			do
			{
				vListInitialise(s4_42);
				s4_42 = (word32) s4_42 + 20;
			} while (s4_42 != 0x420127BC);
			vListInitialise(0x420127BC);
			vListInitialise(0x420127D0);
			vListInitialise(0x420127E4);
			vListInitialise(0x4201280C);
			vListInitialise(1107372024);
			g_dw4200EE3C = 0x420127BC;
			g_dw4200EE40 = 0x420127D0;
			a1_76 = a0->t002C;
		}
	}
	Eq_2 a3_126 = a2->t0000;
	Eq_2 a5_107 = 0x01 << a1_76 | g_t4200DE58;
	a0->ptr0048 = &a2->t0001;
	*a5_107 = 1107353176;
	a2->t0001 = a3_126;
	Eq_2 a5_118;
	vListInsertEnd((char *) &a0->ptr0000 + 4, 1107353176, a5_107, out a5_118);
	Eq_2 a4_127 = 1107353176;
	if (a5_118 != 0x00)
	{
		a5_118 = *((word32) a5_118 + 0x0044);
		if (a5_118 != 0x00)
			a3_126 = vTaskExitCritical.part.8(a3_126, mstatus, out a4_127, out a5_118);
	}
	if (a5_118 != 0x00)
	{
		a5_118 = a0->t002C;
		a4_127 = *((word32) a4_127 + 44);
		if (a4_127 < a5_118)
			__syscall();
	}
	s0Out = s1;
	a3Out = a3_126;
	a4Out = a4_127;
	a5Out = a5_118;
	s2Out = a0;
	return dwArg88;
}

// 2302FEA6: void prvIdleTask(Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void prvIdleTask(Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	union Eq_155331 * s4_33 = &g_t4201253C;
	while (true)
	{
		if (a5 == 0x00)
		{
			if (*s4_33 > 0x01)
				__syscall();
			a5 = vApplicationIdleHook();
		}
		else
		{
			__csrrc(mstatus, 0x08);
			if (g_t4200DE64 != 0x00)
			{
				word32 a5_162;
				a4 = vTaskEnterCritical.part.7(a4, out a5_162);
			}
			word32 a4_160;
			word32 a5_161;
			uxListRemove(a3, a4, out a4_160, out a5_161);
			Eq_2 a5_60 = g_t4200DE44;
			g_t4200DE44 = (word32) a5_60 - 1;
			*((word32) a5_60 - 2) = *((word32) a5_60 - 1);
			Eq_2 a5_67 = g_t4200DE64;
			if (a5_67 != 0x00)
			{
				a5_67 = *((word32) g_t4200DE38 + 0x0044);
				if (a5_67 != 0x00)
				{
					word32 a4_163;
					vTaskExitCritical.part.8(a3, mstatus, out a4_163, out a5_67);
				}
			}
			s1 = prvDeleteTCB(s1, a2, a5_67, mstatus, s2, dwArg0118, dwArg0128, dwArg0158, dwArg0168, out a2, out a3, out a4, out a5, out s4_33);
		}
	}
}

// 2302FF48: Register Eq_2 xTaskCreateStatic(Register Eq_2 ra, Register (ptr32 ptr32) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg01B4, Register out ptr32 tpOut, Register out ptr32 t0Out, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      bfl_main
//      vTaskStartScheduler
//      xTimerCreateTimerTask
//      hal_wifi_start_firmware_task
//      looprt_start
//      aos_task_new
Eq_2 xTaskCreateStatic(Eq_2 ra, ptr32 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArgE8, Eq_2 dwArg01B4, ptr32 & tpOut, ptr32 & t0Out, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	if (a5 != 0x00)
	{
		if (a6 != 0x00)
		{
l2302FF58:
			if (a6 != 96)
			{
				word32 a5_304;
				vAssertCalled(a4, mstatus, out a5_304);
				a2 = dwArg04;
			}
			Eq_2 s0_123 = dwArg01B4;
			ptr32 a5_121 = 0x00;
			if (a5 != 0x00)
			{
				((word32) dwArg01B4 + 93)->u1 = 0x02;
				*((word32) a5 + 48) = dwArg01B4;
				struct Eq_155160 * a2_96;
				Eq_2 a4_98;
				word32 a5_99;
				struct Eq_155159 * s0_102;
				ra = prvInitialiseNewTask.isra.2(ra, a0, a1, a2, a3, a4, fp + -20, dwArg01B4, mstatus, dwArgE8, out t0, out s0_102, out a2_96, out a4_98, out a5_99);
				tp = prvAddNewTaskToReadyList(s0_102, a2_96, a4_98, a5_99, mstatus, out s0_123, out a3, out a4, out a5_121, out s2);
				a2 = dwArg01B4;
			}
			tpOut = tp;
			t0Out = t0;
			s0Out = s0_123;
			a0Out = a5_121;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_121;
			s2Out = s2;
			return ra;
		}
	}
	else
	{
		word32 a5_302;
		vAssertCalled(a4, mstatus, out a5_302);
		a6 = dwArg24;
		a2 = dwArg04;
		if (a6 != 0x00)
			goto l2302FF58;
	}
	word32 a5_303;
	Eq_2 a2_201 = vAssertCalled(a4, mstatus, out a5_303);
	if (a4 != 96)
	{
		word32 a5_305;
		a2_201 = vAssertCalled(a4, mstatus, out a5_305);
	}
	tpOut = tp;
	t0Out = t0;
	s0Out = dwArg01B4;
	a0Out = 0x00;
	a2Out = a2_201;
	a3Out = a3;
	a4Out = a4;
	a5Out = 0x00;
	s2Out = s2;
	return ra;
}

// 2302FFE8: Register word32 xTaskCreate(Register Eq_2 ra, Register Eq_2 s1, Register int32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      cmd_aws
//      wifi_mgmr_start_background
//      cmd_looprt_test
//      tcpip_init
//      cmd_tcp_server
word32 xTaskCreate(Eq_2 ra, Eq_2 s1, int32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	word32 a0_131;
	Eq_2 a0_36;
	word32 s1_195;
	word32 a1_196;
	word32 a2_197;
	word32 a6_198;
	word32 s2_199;
	word32 s3_200;
	word32 s4_201;
	word32 s8_202;
	Eq_2 a5_120;
	Eq_2 a4_119;
	Eq_2 a3_118;
	pvPortMalloc(ra, s1, a2 << 0x02, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_195, out a0_36, out a1_196, out a2_197, out a3_118, out a4_119, out a5_120, out a6_198, out s2_199, out s3_200, out s4_201, out s8_202);
	if (a0_36 != 0x00)
	{
		Eq_2 a0_54;
		Eq_2 a2_56;
		Eq_2 a5_59;
		Eq_2 s1_62;
		Eq_2 s2_63;
		ptr32 * s3_64;
		Eq_2 s4_65;
		word32 a1_203;
		word32 a3_204;
		word32 a4_205;
		word32 a6_206;
		word32 s8_207;
		pvPortMalloc(ra, a0_36, 96, a3_118, a4_119, a5_120, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_62, out a0_54, out a1_203, out a2_56, out a3_204, out a4_205, out a5_59, out a6_206, out s2_63, out s3_64, out s4_65, out s8_207);
		if (a0_54 != 0x00)
		{
			*((word32) s1_62 + 48) = a0_54;
			((word32) a0_54 + 93)->u1 = 0x00;
			struct Eq_155160 * a2_95;
			Eq_2 a4_97;
			word32 a5_98;
			struct Eq_155159 * s0_101;
			word32 t0_216;
			prvInitialiseNewTask.isra.2(ra, s3_64, s4_65, s2_63, a3, a4, a5, a0_54, mstatus, dwArgF8, out t0_216, out s0_101, out a2_95, out a4_97, out a5_98);
			word32 s0_217;
			word32 s2_218;
			prvAddNewTaskToReadyList(s0_101, a2_95, a4_97, a5_98, mstatus, out s0_217, out a3_118, out a4_119, out a5_120, out s2_218);
			a0_131 = 0x01;
		}
		else
		{
			word32 s0_208;
			word32 s1_209;
			word32 a0_210;
			word32 a1_211;
			word32 a2_212;
			word32 a6_213;
			word32 s4_214;
			word32 t3_215;
			vPortFree(s1_62, a2_56, a5_59, mstatus, dwArg0128, dwArg0168, out s0_208, out s1_209, out a0_210, out a1_211, out a2_212, out a3_118, out a4_119, out a5_120, out a6_213, out s4_214, out t3_215);
			a0_131 = ~0x00;
		}
	}
	else
		a0_131 = ~0x00;
	0x00 = (uint16) dwArg0128;
	a2Out = dwArgB8;
	a3Out = a3_118;
	a4Out = a4_119;
	a5Out = a5_120;
	return a0_131;
}

// 23030064: Register word32 vTaskDelete(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      aos_loop_proc
//      aws_main_entry
//      TCP_Server
//      iperf_client_udp
//      dfl_entry
//      aos_task_exit
word32 vTaskDelete(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	Eq_2 s0_15 = a0;
	if (a5 != 0x00)
	{
		word32 a5_248;
		a4 = vTaskEnterCritical.part.7(a4, out a5_248);
	}
	if (a0 == 0x00)
		s0_15 = g_t4200DE38;
	Eq_2 s3_29 = (word32) s0_15 + 4;
	struct Eq_155584 * a5_38;
	Eq_2 a4_37;
	if (uxListRemove(a3, a4, out a4_37, out a5_38) == 0x00)
	{
		a4_37 = a3 * 0x14;
		a5_38 = (struct Eq_155584 *) *((char *) &g_t4201253C + a3 * 0x14);
		if (a5_38 == null)
		{
			a4_37 = *a2;
			a5_38 = ~(0x01 << a3) & a2;
			a5_38->t0000 = a4_37;
		}
	}
	Eq_2 s0_60 = a5_38->t0028;
	if (a5_38 != null)
	{
		word32 a5_249;
		uxListRemove(a3, a4_37, out a4_37, out a5_249);
	}
	Eq_2 a4_100;
	Eq_2 a5_101;
	Eq_2 a5_70 = *a4_37;
	Eq_2 a3_74 = g_t4200DE38;
	Eq_2 a4_75 = (word32) a4_37 + 1;
	*a4_75 = a5_70;
	if (a3_74 != s0_60)
	{
		*((word32) a4_75 - 1) = *a4_75;
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg328 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		Eq_2 stackArg392 = <invalid>;
		Eq_2 stackArg408 = <invalid>;
		word32 a3_256;
		word32 a5_258;
		word32 a4_257;
		word32 s4_259;
		word32 a2_255;
		prvDeleteTCB(a0, a2, a5, mstatus, stackArg16, stackArg328, stackArg344, stackArg392, stackArg408, out a2_255, out a3_256, out a4_257, out a5_258, out s4_259);
		if (*g_t4200DE3C != 0x00)
			a4_100 = prvResetNextTaskUnblockTime.part.0(out a5_101);
		else
		{
			g_dw4200EE5C = ~0x00;
			a5_101.u0 = 0x4200E000;
			a4_100.u0 = ~0x00;
		}
	}
	else
	{
		word32 a5_261;
		vListInsertEnd(s3_29, a4_75, a5_70, out a5_261);
		a5_101 = *a4_75;
		*((word32) a4_75 + 1) = a5_101;
		a4_100 = (word32) a4_75 + 1;
	}
	if (a5_101 != 0x00)
	{
		a5_101 = *((word32) g_t4200DE38 + 0x0044);
		if (a5_101 != 0x00)
			vTaskExitCritical.part.8(a3_74, mstatus, out a4_100, out a5_101);
	}
	if (a5_101 == 0x00 || g_t4200DE38 != s0_60)
		return;
	if (g_t4200DE50 == 0x00)
		__syscall();
	else
	{
		word32 a5_260;
		vAssertCalled(a4_100, mstatus, out a5_260);
		__syscall();
	}
	return;
}

// 23030196: Register Eq_2 eTaskGetState(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_155722 a5, Register ptr32 mstatus, Register out Eq_155724 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_155722 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      vTaskGetInfo
Eq_2 eTaskGetState(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_155722 a5, ptr32 mstatus, union Eq_155724 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_155722 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	if (a0 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	Eq_2 s1_166 = *a4;
	Eq_155724 a0_146 = 0x00;
	if (a4 == a0)
	{
l23030212:
		a0Out = a0_146;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out.u0 = <invalid>;
		s3Out = s3;
		s4Out.u0 = <invalid>;
		return s1_166;
	}
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_190;
		vTaskEnterCritical.part.7(a4, out a5_190);
	}
	Eq_155722 a5_160 = 0x4200E000;
	a4.u0 = 0x4200E000;
	s3 = g_t4200DE3C;
	Eq_2 s4_39 = g_t4200DE40;
	Eq_2 s0_42 = *((word32) a0 + 20);
	if (true)
	{
		s1_166 = g_t4200E000;
		a5_160 = g_t4200E044;
		if (a5_160 != 0x00)
		{
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_160);
			if (s0_42 == s3)
			{
l23030230:
				a0Out.u0 = 0x02;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_160;
				s2Out.u0 = <invalid>;
				s3Out = s3;
				s4Out.u0 = <invalid>;
				return s1_166;
			}
l230301E8:
			if (s0_42 != s4_39)
			{
				a5.u0 = 1107372024;
				if (s0_42 != 1107372024)
				{
					a5.u0 = 0x4201280C;
					if (s0_42 != 0x4201280C)
					{
						a5 = 0x00 - (word32) (s0_42 < 1);
						a0_146 = (a5 & 3) + 0x01;
					}
					else
						a0_146.u0 = 0x04;
				}
				else
				{
					a4 = *((word32) a0 + 40);
					a0_146.u0 = 0x02;
					if (a4 == 0x00)
					{
						a5 = (word32) ((word32) *((word32) a0 + 92) != ~0x00);
						a0_146 = (word32) a5 + 2;
					}
				}
				goto l23030212;
			}
			goto l23030230;
		}
	}
	if (s0_42 == s3)
		goto l23030230;
	goto l230301E8;
}

