pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0002.c
// 23030264: void vTaskStartScheduler(Register Eq_2 ra, Register ptr32 gp, Register Eq_2 a6, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 mie, Register ptr32 mtvec, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0174, Stack Eq_2 dwArg0194)
// Called from:
//      bfl_main
void vTaskStartScheduler(Eq_2 ra, ptr32 gp, Eq_2 a6, ptr32 fcsr, ptr32 mstatus, ptr32 mie, ptr32 mtvec, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0174, Eq_2 dwArg0194)
{
	word32 a0_23;
	Eq_2 a3_33;
	Eq_2 a4_34;
	word32 tp_174;
	word32 t0_175;
	word32 s0_176;
	word32 a2_177;
	word32 a5_178;
	word32 s2_179;
	Eq_2 ra_36 = xTaskCreateStatic(ra, &g_ptr2302FEA6, 0x230782DC, dwArg64, 0x00, 0x00, vApplicationGetIdleTaskMemory(fp + ~0x1B, fp + ~0x17, fp + ~0x13), a6, mstatus, 0x00, dwArg04, dwArgC8, dwArg0194, out tp_174, out t0_175, out s0_176, out a0_23, out a2_177, out a3_33, out a4_34, out a5_178, out s2_179);
	if (a0_23 == 0x00)
		return;
	word32 a0_45;
	Eq_2 a4_49;
	Eq_2 t0_65;
	Eq_2 tp_58 = xTimerCreateTimerTask(ra_36, a3_33, a4_34, mstatus, 0x00, dwLoc08, dwArg44, dwArgA8, dwArgD8, dwArg0174, out t0_65, out a0_45, out a4_49);
	if (a0_45 != 0x01)
	{
		if (a0_45 != ~0x00)
			return;
		word32 a5_180;
		vAssertCalled(a4_49, mstatus, out a5_180);
	}
	else
	{
		__csrrc(mstatus, 0x08);
		g_dw4200EE5C = ~0x00;
		g_dw4200EE64 = a0_45;
		g_dw4200EE68 = 0x00;
		xPortStartScheduler(gp, tp_58, t0_65, 0x4200E000, fcsr, mstatus, mie, mtvec);
	}
}

// 230302D8: Register Eq_2 vTaskSuspendAll(Register Eq_2 a4, Register out ptr32 a5Out)
// Called from:
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvTimerTask
//      pvPortMalloc
//      vPortFree
Eq_2 vTaskSuspendAll(Eq_2 a4, ptr32 & a5Out)
{
	ptr32 a5_6 = *a4;
	*((word32) a4 + 1) = a5_6;
	a5Out = a5_6;
	return (word32) a4 + 1;
}

// 230302E8: Register Eq_2 xTaskGetTickCount(Register out (ptr32 Eq_1344) a5Out)
// Called from:
//      get_dts_addr.part.2
//      http_test_cmd
//      mm_cfg_element_keepalive_timestamp_update
//      rxl_cntrl_evt
//      apm_sta_connect_timeout_ind_handler
//      bl_main_cfg_task_req
//      tcpip_stack_input
//      stateConnectedIPNoEnter
//      stateGlobalGuard_scan_beacon
//      stateDisconnect_enter
//      wifi_mgmr_start
//      cmd_wifi_coex_pta_force_on
//      sniffer_cb
//      wifi_mgmr_cli_scanlist
//      bl_irq_bottomhalf
//      wifi_tx
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      bl_sys_time_update
//      bl_sys_time_get
//      bl_sys_time_sync_state
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      prvTimerTask
//      _cb_cmd
//      bl_cks_test
//      _cb_cmd
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      bl_dma_test
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      _pka_test_case2
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      Aes_Compare_Data
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      sys_arch_mbox_fetch
//      sys_arch_sem_wait
//      sys_now
//      TCP_Server
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      sntp_recv
//      sntp_get_time
//      log_buf_out
//      has_timer_expired
//      countdown_ms
//      left_ms
//      bl_mtd_write
//      bloop_timer_configure
//      bloop_timer_repeat_reconfigure
//      bloop_run
//      bloop_status_dump
Eq_2 xTaskGetTickCount(struct Eq_1344 & a5Out)
{
	Eq_2 a0_5 = g_t4200DE68;
	a5Out = (struct Eq_1344 *) &g_t4200E000;
	return a0_5;
}

// 230302F2: Register ptr32 xTaskGetTickCount2(Register ptr32 a0, Register ptr32 a1)
// Called from:
//      aos_now_ms
ptr32 xTaskGetTickCount2(ptr32 a0, ptr32 a1)
{
	Eq_2 a5_7 = g_t4200DE60;
	*g_t4200DE68 = a0;
	*a5_7 = a1;
	return 0x01;
}

